{"chunk_id": "75-0", "text": "66 Chapter 1 The Fundamental Group e e lines we attach a copy of B. Each of these copies of B has one of its boundary lines attached to the initial copy of A e , leaving n−1 boundary lines free, and we attach a newcopyof A e toeachofthesefreeboundarylines. Thuswenowhave m(cid:132)n−1(cid:133)(cid:130)1 copiesof A e . Eachofthenewlyattachedcopiesof A e has m−1 freeboundarylines, e andtoeachoftheselinesweattachanewcopyof B. Theprocessisnowrepeatedad e infinitimintheevidentway. Let X betheresultingspace. m;n The product structures A e (cid:131) C (cid:2)R and B e (cid:131) C (cid:2)R m n give X e thestructureofaproduct T (cid:2)R where T m;n m;n m;n is an infinite graph constructed by an inductive scheme e justliketheconstructionofX . ThusT istheunion m;n m;n ofasequenceoffinitesubgraphs,eachobtainedfromthe preceding by attaching new copies of C or C . Each m n of these finite subgraphs deformation retracts onto the precedingone. Theinfiniteconcatenationofthesedefor- mation retractions, with the kth graph deformation retracting to the previous one during the time interval (cid:134)1=2k;1=2k−1(cid:135), gives a deformation retraction of T onto m;n theinitialstage C . Since C iscontractible,thismeans T iscontractible,hence m m m;n also X e ,whichistheproduct T (cid:2)R. Inparticular, X e issimply-connected. m;n m;n m;n e e The map that projects each copy of A in X to A and m;n e each copy of B to B is a covering space. To define this map precisely, choose a point x 2 S1, and then the image of the 0 linesegmentfx g(cid:2)I inX meetsAinalinesegmentwhose 0 m;n e preimagein A consistsofaninfinitenumberoflinesegments, appearingintheearlierfigureasthehorizontalsegmentsspi- e raling around the central vertical axis. The picture in B is e e similar, andwhenwegluetogetherallthecopiesof A and B e toform X ,wedosoinsuchawaythatthesehorizontalsegmentsalwayslineup m;n e exactly. This decomposes X into infinitely many rectangles, each formed from a m;n e e e ! rectangleinan A andarectangleina B. Thecoveringprojection X X isthe m;n m;n quotientmapthatidentifiesalltheserectangles. Nowwereturntothegeneraltheory. Thehypothesesforconstructingasimply- connectedcoveringspaceof X infactsufficeforconstructingcoveringspacesrealiz- ingarbitrarysubgroupsof (cid:25) (cid:132)X(cid:133): 1 P roposition1.36. Suppose X ispath-connected,locallypath-connected,andsemilo- callysimply-connected. Thenforeverysubgroup H (cid:26)(cid:25) (cid:132)X;x (cid:133) thereisacovering (cid:0) (cid:1) 1 0 ! space p:X H X such that p(cid:3) (cid:25) 1 (cid:132)X H ;xe 0 (cid:133) (cid:131) H for a suitably chosen basepoint xe 2X . 0 H Proof: For points (cid:134)γ(cid:135), (cid:134)γ 0 (cid:135) in the simply-connected covering space X e constructed above, define (cid:134)γ(cid:135) (cid:24) (cid:134)γ 0 (cid:135) to mean γ(cid:132)1(cid:133) (cid:131) γ 0 (cid:132)1(cid:133) and (cid:134)γγ0(cid:135) 2 H. It is easy to see", "rank": 0, "metadata": {"section": "75"}}
