{"chunk_id": "7.2.1-0", "text": "Introduction to TDA 7.2. Distances for Reeb Graphs 7.2 Distances for Reeb Graphs InordertocompareReebgraphstoeachother, weagainwanttodefinedistancemeasures between them. We discuss two such measures here. The first one, called interleaving distance, is, not surprisingly, similar to the interleaving distance of persistence mod- ules. The second one, called functional distortion distance is similar to the Gromov- Hausdorff distance for metric spaces. 7.2.1 Interleaving Distance When do we want two Reeb graphs to be considered the same, and thus have distance 0? We definitely need that the graphs are isomorphic in the sense of graph isomorphism. But further than that, we also want that this graph isomorphism is “function preserving”. In other words, the critical points should lie on the same function levels. The idea of the interleaving distance is to measure how far away from this we are. Thus, given two Reeb graphs R ,R , “how much” is missing towards a “function preserving isomorphism”? f g Towards formalizing this idea, we need a few definitions. Note that when we compare two Reeb graphs R ,R , those can be Reeb graphs of f g different spaces with regards to different functions. Definition 7.17. An ϵ-thickening X of some topological space X is given by X := ϵ ϵ X×[−ϵ,+ϵ]. Definition 7.18. For a Reeb graph R consider a function f : (R ) → R such that f ϵ f ϵ (x,t) (cid:55)→ f(x)+t. The ϵ-smoothing of R , denoted by S (R ) is the Reeb graph of (R ) with regards f ϵ f f ϵ to f . ϵ An example of these definitions can be seen in Figure 7.4. Note that when we say (R ) , we meananϵ-thickeningofR , not aReeb graphwith regardsto somefunctionf . f ϵ f ϵ The ϵ-smoothing S (R ) is then a Reeb graph with regards to the function f , but of ϵ f ϵ (R ) , and not of the original space that R is the Reeb graph of. Furthermore, when f ϵ f we write f(x) for some x ∈ R , we mean that we extend f to some function f∗ : R → R , f f simply by mapping x (an element of X/ ∼, i.e., an equivalence class of ∼) to f(p) for some point p ∈ X in the equivalence class x. We will just call this function f as well for simplicity. Definition7.19. The function ι : R → S (R ) with x (cid:55)→ [(x,0)] is the quotientedinclusion f ϵ f map. Here, [(x,0)] denotes the equivalence class, or the connected component that contains (x,0) in f−1(f (x,0)). ϵ ϵ Consider some function µ : R → R which is function preserving, i.e., f(x) = g(µ(x)) f g for all x ∈ R . A function-preserving map µ : R → S (R ) induces a function preserving f f ϵ g map µ : S (R ) → S (R ) with [(x,t)] (cid:55)→ [(µ(x),t)]. ϵ ϵ f 2ϵ g 81 Chapter 7. Reeb Graphs and Mapper Introduction to TDA R (R ) S (R ) f f (cid:15) (cid:15) f Figure 7.4: A Reeb graph, its ϵ-thickening, and its ϵ-smoothing. Definition 7.20 (Reeb graph interleaving). Two Reeb graphs R ,R are ϵ-interleaved, if f g there exists a pair of function preserving maps φ : R → S (R ), ψ : R → S (R ) f ϵ g g ϵ f such that the following diagram commutes: R ι S (R ) ιϵ S (R ) f ϵ f 2ϵ f ψ φ ψϵ φϵ R ι", "rank": 0, "metadata": {"section": "7.2.1"}}
{"chunk_id": "7.2.1-1", "text": ",R are ϵ-interleaved, if f g there exists a pair of function preserving maps φ : R → S (R ), ψ : R → S (R ) f ϵ g g ϵ f such that the following diagram commutes: R ι S (R ) ιϵ S (R ) f ϵ f 2ϵ f ψ φ ψϵ φϵ R ι S (R ) ιϵ S (R ) g ϵ g 2ϵ g Here, to understand why ι makes sense, we need the following fact, the proof of ϵ which is left as an exercise. ∼ Observation 7.21. S (S (R )) = S (R ). δ ϵ f δ+ϵ f Note that by construction of ι,ι and φ (or ψ , respectively), the trapezoidal parts ϵ ϵ ϵ of this diagram commute trivially: φ ◦ ι(x) = φ ([(x,0)]) = [(φ(x),0)] = ι ◦ φ(x). ϵ ϵ ϵ Furthermore, any two compact and connected Reeb graphs are ϵ-interleaved for some ϵ. Lastly, if R and R are ϵ-interleaved, then they are also δ-interleaved for all δ ⩾ ϵ. f g Definition 7.22. d (R ,R ) = inf{ϵ | R ,R are ϵ-interleaved}. I f g f g We once again have a stability theorem, which we will not prove here. Theorem 7.23. For tame functions f,g : X → R we have d I (R f ,R g ) ⩽ ||f−g|| ∞ . 82", "rank": 1, "metadata": {"section": "7.2.1"}}
