{"chunk_id": "91-0", "text": "82 Chapter 1 The Fundamental Group containing a given lift xe of x is the stabilizer of xe , the subgroup consisting 0 0 0 ofelementswhoseactiononthefiberleaves xe fixed. 0 e! 27. For a universal cover p:X X we have two actions of (cid:25) (cid:132)X;x (cid:133) on the fiber 1 0 p −1(cid:132)x (cid:133), namely the action given by lifting loops at x and the action given by re- 0 0 stricting deck transformations to the fiber. Are these two actions the same when X (cid:131)S1_S1 or X (cid:131)S1(cid:2)S1? Dotheactionsalwaysagreewhen (cid:25) (cid:132)X;x (cid:133) isabelian? 1 0 28. GeneralizetheproofofTheorem1.7toshowthatforacoveringspaceactionofa group G onasimply-connectedspace Y, (cid:25) (cid:132)Y=G(cid:133) isisomorphicto G. [If Y islocally 1 path-connected,thisisaspecialcaseofpart(b)ofProposition1.40.] 29. Let Y be path-connected, locally path-connected, and simply-connected, and let G and G be subgroups of Homeo(cid:132)Y(cid:133) defining covering space actions on Y. Show 1 2 thattheorbitspaces Y=G and Y=G arehomeomorphiciff G and G areconjugate 1 2 1 2 subgroupsof Homeo(cid:132)Y(cid:133). (cid:10) (cid:11) 30. DrawtheCayleygraphofthegroup Z(cid:3)Z (cid:131) a;b jjjjb2 . 2 31. Show that the normal covering spaces of S1 _S1 are precisely the graphs that are Cayley graphs of groups with two generators. More generally, the normal cov- ering spaces of the wedge sum of n circles are the Cayley graphs of groups with n generators. e! e 32. Consider covering spaces p:X X with X and X connected CW complexes, e the cells of X projecting homeomorphically onto cells of X. Restricting p to the 1 skeletonthengivesacoveringspace X e1 ! X1 overthe 1 skeletonof X. Show: e ! e ! (a) Twosuchcoveringspaces X X and X X areisomorphicifftherestrictions 1 2 X e1 ! X1 and X e1 ! X1 areisomorphic. 1 2 (b) X e! X isanormalcoveringspaceiff X e1 ! X1 isnormal. (c) The groups of deck transformations of the coverings X e! X and X e1 ! X1 are isomorphic,viatherestrictionmap. 33. In Example 1.44 let d be the greatest common divisor of m and n, and let m 0 (cid:131) m=d and n 0 (cid:131) n=d. Show that the graph T =K consists of m 0 vertices m;n 0 labeled a, n vertices labeled b, together with d edges joining each a vertex to each b vertex. Deduce that the subgroup K (cid:26) G is free on dm 0 n 0−m 0−n 0(cid:130)1 m;n generators.", "rank": 0, "metadata": {"section": "91"}}
