{"chunk_id": "88-0", "text": "Covering Spaces Section 1.3 79 Exercises 1. Foracoveringspace p:X e! X andasubspace A(cid:26)X,let A e(cid:131)p −1(cid:132)A(cid:133). Showthat e! therestriction p:A A isacoveringspace. e ! e ! 2. Showthatif p :X X and p :X X arecoveringspaces,soistheirproduct 1 1 1 2 2 2 p (cid:2)p :X e (cid:2)X e ! X (cid:2)X . 1 2 1 2 1 2 3. Let p:X e! X beacoveringspacewith p −1(cid:132)x(cid:133) finiteandnonemptyforall x 2X. e Showthat X iscompactHausdorffiff X iscompactHausdorff. 4. Constructasimply-connectedcoveringspaceofthespace X (cid:26)R3 thatistheunion ofasphereandadiameter. Dothesamewhen X istheunionofasphereandacircle intersectingitintwopoints. 5. Let X bethesubspaceof R2 consistingofthefoursidesofthesquare (cid:134)0;1(cid:135)(cid:2)(cid:134)0;1(cid:135) together with the segments of the vertical lines x (cid:131) 1= ;1= ;1= ;(cid:1)(cid:1)(cid:1) inside the square. 2 3 4 e! Show that for every covering space X X there is some neighborhood of the left e edgeof X thatliftshomeomorphicallyto X. Deducethat X hasnosimply-connected coveringspace. e 6. Let X betheshrinkingwedgeofcirclesinExample1.25,andlet X beitscovering spaceshowninthefigurebelow. !e !e! Constructatwo-sheetedcoveringspace Y X suchthatthecomposition Y X X of the two covering spaces is not a covering space. Note that a composition of two coveringspacesdoeshavetheuniquepathliftingproperty,however. 7. Let Y bethequasi-circleshowninthefigure,aclosedsubspace of R2 consisting of a portion of the graph of y (cid:131) sin(cid:132)1=x(cid:133), the segment (cid:134)−1;1(cid:135) in the y axis, and an arc connecting these two pieces. Collapsing the segment of Y in the y axis to a point ! gives a quotient map f:Y S1. Show that f does not lift to ! the covering space R S1, even though (cid:25) (cid:132)Y(cid:133) (cid:131) 0. Thus local 1 path-connectednessof Y isanecessaryhypothesisintheliftingcriterion. e e 8. Let X and Y be simply-connected covering spaces of the path-connected, locally path-connected spaces X and Y. Show that if X ’ Y then X e ’ Y e . [Exercise 10 in Chapter0maybehelpful.] 9. Show that if a path-connected, locally path-connected space X has (cid:25) (cid:132)X(cid:133) finite, 1 ! ! theneverymap X S1 isnullhomotopic. [Usethecoveringspace R S1.] 10. Findalltheconnected 2 sheetedand 3 sheetedcoveringspacesof S1_S1,upto isomorphismofcoveringspaceswithoutbasepoints.", "rank": 0, "metadata": {"section": "88"}}
