{"chunk_id": "6.2.2-0", "text": "Chapter 6. Distances and Stability Introduction to TDA Observation 6.24. For all p ⩾ 0, d (H F,H G) ⩽ d (F,G). I p p I As a first application of interleaving distance, we can quantify how different the Čech and Vietoris-Rips filtrations are. Recall that for a point cloud P and a radius r, we have the relationship between the Čech and Vietoris-Rips complexes as follows: Cr(P) ⊆ VR r(P) ⊆ C2r(P). Since this factor 2 is multiplicative, and we need an additive ϵ for interleaving, let us just take the logarithmic scale (base 2) for the radius, i.e., we define Cr = C2r and similarly VR r = VR 2r. Since 2(r+1) = 2·2r, we have Cr (P) ⊆ log log log VR r (P) ⊆ Cr+1(P). log log We thus have the following inclusions: Cr Cr+1 Cr+2 log log log r r+1 r+2 VR VR VR log log log Since these are all inclusions, all relevant diagrams must commute, and thus we get that d (C ,VR ) ⩽ 1. I log log 6.2.2 Stability with Respect to Interleaving Distance The main motivation for interleaving distance is that it can be used to prove stability results, at least under some tameness conditions. Definition 6.25. A persistence module V is q-tame if the linear maps have finite di- mension. Note that in this definition, the q is not a parameter, just a name. All persistence modules that show up in the context of persistent homology on point clouds are q-tame, so this condition is not restrictive. Theorem 6.26. If U,V are q-tame persistence modules over R, then d (DgmU,DgmV) = d (U,V). b I Thus, for every interleaving one can find between two persistence modules or between filtrations, one immediately gets an upper bound on the Bottleneck distance. This is a very powerful result, and the proof of it is out of scope for these lecture notes. One direction of the proof however follows from a decomposition result of persistence modules that we will discuss in Section 6.3. But first, we will consider some examples of how Theorem 6.26 can be used to prove stability theorems. Exercise 6.27. Prove Theorem 6.10. 70", "rank": 0, "metadata": {"section": "6.2.2"}}
