{"chunk_id": "6.1.1-0", "text": "Chapter 6 Distances and Stability 6.1 Distance Metrics on Persistence Diagrams As we have seen in the previous sections, persistent homology of simplicial filtrations, for example in the form of persistence diagrams or persistence barcodes, can give us a lot of insight into a given point cloud. However, so far we have always been analyzing this information manually. In this section we will show how this can be done on a more mathematical level, by defining some distance metrics that can be used to compare different persistence diagrams, and thus to assess the similarity of point clouds. 6.1.1 Bottleneck Distance Let F,G be two filtrations giving rise to persistence modules H (F),H (G), and let p p Dgm (F) and Dgm (G) be their corresponding persistence diagrams. How can we now p p compare these two filtrations F and G by using only the information stored in these diagrams? The general idea of the bottleneck distance is to find a matching between the points of the two persistence diagrams, i.e., we consider bijections between the points of Dgm (F) p and those of Dgm (G). Since we can only find bijections between sets of the same p cardinality, we need the two diagrams to have the same number of points. Recall that the way we defined it, a persistence diagram includes every possible point on the diagonal with infinite multiplicity. This peculiar definition now finally pays off; since both sets of points have the same (infinite) cardinality, and bijections between these sets are thus well-defined. We do not want to consider any arbitrary bijection, but only the best possible. To measure the “quality” or “distance” of such a bijection, we use the L -norm: ∞ Definition 6.1. Let x = (x ,x ),y = (y ,y ) be two points in R2. Then, 1 2 1 2 ||x−y|| := max(|x −y |,|x −y |), ∞ 1 1 2 2 where we say that ∞−∞ = 0 for points with coordinates that are ∞ (i.e., points in persistence diagrams that correspond to holes that did not die). 60 Introduction to TDA 6.1. Distance Metrics on Persistence Diagrams Definition 6.2. Let Π = {π : Dgm (F) → Dgm (G) | π is bijective} be the set of all p p bijections between Dgm (F) and Dgm (G). Then, the Bottleneck distance is defined p p as d (Dgm (F),Dgm (G)) := inf sup ||x−π(x)|| . b p p ∞ π∈Πx∈Dgmp(F) The Bottleneck distance thus minimizes the maximum L -norm of any pairing, over ∞ all pairings of points. Figure 6.1: An illustration of the idea of bottleneck distance. Observation 6.3. The Bottleneck distance is a metric on the space of persistence dia- grams with finitely many off-diagonal points. Proof. We check the three properties of metrics: 1. d (X,Y) = 0 if and only if X = Y: This is simple to see, since if X = Y, every point b can be matched to its copy, and if X ̸= Y, there exists some point p ∈ X\\Y∪Y\\X which must be matched to some point with positive L -distance to p. ∞ 2. d (X,Y) = d (Y,X): This is clear by definition. b b 3. d (X,Y) ⩽ d (X,Z) + d (Z,Y): Take a bijection π witnessing1 d (X,Z) and b b b 1 b a bijection π witnessing d (Z,Y), and concatenate the two: π := π ◦ π is a 2 b 2 1 bijection X → Y where for every x ∈ X we can use the triangle equality of ||·|| to ∞ bound ||x−π(x)||", "rank": 0, "metadata": {"section": "6.1.1"}}
{"chunk_id": "6.1.1-1", "text": "(X,Z) + d (Z,Y): Take a bijection π witnessing1 d (X,Z) and b b b 1 b a bijection π witnessing d (Z,Y), and concatenate the two: π := π ◦ π is a 2 b 2 1 bijection X → Y where for every x ∈ X we can use the triangle equality of ||·|| to ∞ bound ||x−π(x)|| ⩽ ||x−π (x)|| +||π (x)−π (π (x))|| . ∞ 1 ∞ 1 2 1 ∞ 1Note that since d is an infimum and not a minimum, there may not be π and π witnessing d . In b 1 2 b this case, the same argument can be applied to the converging sequences of bijections witnessing d . b 61 Chapter 6. Distances and Stability Introduction to TDA Exercise 6.4. Give an algorithm to compute the Bottleneck distance between two per- sistence diagrams. Your algorithm should be polynomial in n, where n is the total number of off-diagonal points in the two persistence diagrams. Exercise 6.5. Let D ,...,D be k persistence diagrams. Assume that for any two of 1 k them we have d (D ,D ) ⩽ 2. Prove or disprove: there exists a persistence diagram b i j D such that d (D ,D ) ⩽ 1 for all i ∈ {1,...,k}. 0 b 0 i TheBottleneckdistancecanbeusedtocompareany twofiltrations, ofpossiblywildly different spaces. What if we consider two filtrations of the same simplicial complex? Recall that simplex-wise monotone functions f,g : K → R give rise to simplicial sublevel set filtrations F ,F . While these two filtrations can be compared using the Bottleneck f g distance, we can also define a metric that directly compares the two functions f,g: Definition 6.6 (infinity norm). Let f,g : X → R. Then, the infinity norm of f − g is defined as ||f−g|| := sup|f(x)−g(x)|. ∞ x∈X The following theorem tells us that this infinity norm and the Bottleneck distance are closely related: Theorem 6.7 (Stability for simplicial filtrations). Let f,g : K → R be simplex-wise mono- tone functions. Then, ∀p ⩾ 0 we have d (Dgm (F ),Dgm (F )) ⩽ ||f−g|| . b p f p g ∞ Proof. We consider the linear interpolation f := (1 − t)f + tg for t ∈ [0,1] between f t and g. Note that f = f,f = g. 0 1 We first show that each f is a simplex-wise monotone function: Let σ ⊆ τ. Since f t and g are monotone, we have f(σ) ⩽ f(τ) and g(σ) ⩽ g(τ). Thus, f (σ) = (1−t)f(σ)+tg(σ) ⩽ (1−t)f(τ)+tg(τ) = f (τ). t t Let p ⩾ 0 be fixed. We now draw the family of persistence diagrams Dgm (F ) p ft as a multiset in R2 ×[0,1]. Each off-diagonal point of X := Dgm (F ) is of the form t p ft x(t) = (f (σ),f (τ),t) for σ being the creator and τ being the destructor. Note that the t t persistence pairings (σ,τ) may only change when the order of simplex insertion changes, which only happens finitely many times when going from t = 0 to t = 1. Let us call these values 0 = t < t < t < ... < t < t = 1. For simplicity, we assume that at 0 1 2 n n+1 each of these values t exactly two simplices have the same value f . i t i Within each open interval (t ,t ) the pairings stay constant. Furthermore, every i i+1 off-diagonal point x(t) is a linear function of t in all three", "rank": 1, "metadata": {"section": "6.1.1"}}
{"chunk_id": "6.1.1-2", "text": "t < t = 1. For simplicity, we assume that at 0 1 2 n n+1 each of these values t exactly two simplices have the same value f . i t i Within each open interval (t ,t ) the pairings stay constant. Furthermore, every i i+1 off-diagonal point x(t) is a linear function of t in all three coordinates, meaning that it defines a line segment. Let us first assume that at some value t , x(t ) is an off-diagonal point whose i+1 i+1 creator and destructor are still paired after t . In this case, x(t) continues in the same i+1 direction after t . i+1 62 Introduction to TDA 6.1. Distance Metrics on Persistence Diagrams If on the other hand x(t ) is an off-diagonal point whose creator and destructor i+1 get paired differently, recalling Exercise 4.4, there are exactly two pairs that swap their creators or destructors, and these creators or destructors that are swapped must have the same value in f . In the persistence diagram, this means that two points vertically t i+1 or horizontally of each other swap creators/destructors. However, this just means that for both of these line segments going into t , there is a unique continuing line segment. i+1 Note that for t = 0 or t = 1 we can also have that x(t) lies on the diagonal. This means that its past/future creator and destructor have the same value in f . t Every point thus moves along a polygonal path monotone in t. Every such path is called a vine, and the multiset of all vines is called a vineyard, see Figure 6.2 for an illustration. Based on this vineyard, we now wish to find a good matching giving an upper bound on the Bottleneck distance. We simply take the matching where we match the start point of every vine with its endpoint. To get a bound on the Bottleneck distance, we simply need to get a bound for the distance of each matched pair. h at e d birth emit t i+1 Figure 6.2: The vineyards in the proof of Theorem 6.7. Between any t and t , a point x(t) moves at the rate δx(t), which we can compute i i+1 δt to be δ (cid:0) (cid:1) (1−t)·(f(σ),f(τ),t) +t·(g(σ),g(τ),t)) = (g(σ)−f(σ),g(τ)−f(τ),1). δt Projecting x(t ) and x(t ) to R2 we thus get two points y ,y for which we can see i+1 i i+1 i 63", "rank": 2, "metadata": {"section": "6.1.1"}}
