{"chunk_id": "93-0", "text": "84 Chapter 1 The Fundamental Group meetseach e inaclosedset. Forthesamereason, anysubsetof D isclosed, so D (cid:11) has the discrete topology. But D is compact, being a closed subset of the compact space C,so D mustbefinite. Bythedefinitionof D thismeansthat C canmeetonly finitelymanyverticesandedges. A subgraph of a graph X is a subspace Y (cid:26) X that is a union of vertices and edges of X, such that e (cid:26) Y implies e (cid:26) Y. The latter condition just says that (cid:11) (cid:11) Y is a closed subspace of X. A tree is a contractible graph. By a tree in a graph X we mean a subgraph that is a tree. We call a tree in X maximal if it contains all the vertices of X. This is equivalent to the more obvious meaning of maximality, as we willseebelow. P roposition1A.1. Everyconnectedgraphcontainsamaximaltree,andinfactany treeinthegraphiscontainedinamaximaltree. Proof: Let X be a connected graph. We will describe a construction that embeds an arbitrary subgraph X (cid:26) X as a deformation retract of a subgraph Y (cid:26) X that 0 containsalltheverticesof X. Bychoosing X tobeanysubtreeof X,forexamplea 0 singlevertex,thiswillprovetheproposition. Asapreliminarystep,weconstructasequenceofsubgraphs X (cid:26)X (cid:26)X (cid:26)(cid:1)(cid:1)(cid:1), 0 1 2 letting X i(cid:130)1 beobtainedfrom X i byadjoining S theclosures e (cid:11) ofalledges e (cid:11) (cid:26)X−X i havingatleastoneendpointinX . Theunion X isopeninX sinceaneighborhood i i i S ofapointin X i iscontainedin X i(cid:130)1 . Furthermore, iS X i isclosedsinceitisaunion ofclosededgesand X hastheweaktopology. So X (cid:131) X since X isconnected. i i Now to construct Y we begin by setting Y (cid:131) X . Then inductively, assuming 0 0 that Y i (cid:26)X i has been constructed so as to contain all the vertices of X i , let Y i(cid:130)1 be obtained S from Y i byadjoiningoneedgeconnectingeachvertexof X i(cid:130)1 −X i to Y i ,and let Y (cid:131) i Y i . It is evident that Y i(cid:130)1 deformation retracts to Y i , and we may obtain a deformation retraction of Y to Y (cid:131) X by performing the deformation retraction 0 0 of Y i(cid:130)1 to Y i during the time interval (cid:134)1=2i(cid:130)1;1=2i(cid:135). Thus a point x 2 Y i(cid:130)1 −Y i is stationary until this interval, when it moves into Y and thereafter continues mov- i ! ing until it reaches Y . The resulting homotopy h :Y Y is continuous since it is 0 t continuousontheclosureofeachedgeand Y hastheweaktopology. tu Given a maximal tree T (cid:26) X and a base vertex x 2 T, then each edge e of 0 (cid:11) X−T determines a loop f in X that goes first from x to one endpoint of e by (cid:11) 0 (cid:11) a path in T, then across e , then back to x by a path in T. Strictly speaking, we (cid:11) 0 should first orient the edge e in order to specify which direction to cross it. Note (cid:11) thatthehomotopyclassof f isindependentofthechoiceofthepathsin T since T (cid:11) issimply-connected. P roposition 1A.2. For a connected graph X with maximal tree T, (cid:25) (cid:132)X(cid:133) is a free 1 groupwithbasistheclasses (cid:134)f (cid:135) correspondingtotheedges e of X−T. (cid:11) (cid:11)", "rank": 0, "metadata": {"section": "93"}}
