{"chunk_id": "72-0", "text": "Covering Spaces Section 1.3 63 e e e e e by p, and let U and U be the U ’s containing f (cid:132)y(cid:133) and f (cid:132)y(cid:133), respectively. By 1 2 (cid:11) 1 2 e e e e continuityof f and f thereisaneighborhood N of y mappedinto U by f and 1 2 1 1 into U e by f e . If f e (cid:132)y(cid:133) (cid:148) f e (cid:132)y(cid:133) then U e (cid:148) U e , hence U e and U e are disjoint and 2 2 1 2 1 2 1 2 f e (cid:148)f e throughouttheneighborhood N. Ontheotherhand, if f e (cid:132)y(cid:133)(cid:131)f e (cid:132)y(cid:133) then 1 2 1 2 U e (cid:131)U e so f e (cid:131)f e on N since pf e (cid:131)pf e and p is injective on U e (cid:131)U e . Thus the 1 2 1 2 1 2 1 2 setofpointswhere f e and f e agreeisbothopenandclosedin Y. tu 1 2 The Classification of Covering Spaces We consider next the problem of classifying all the different covering spaces of a fixed space X. Since the whole chapter is about paths, it should not be surprising that we will restrict attention to spaces X that are at least locally path-connected. Path-components of X are then the same as components, and for the purpose of classifyingthecoveringspacesof X thereisnolossinassumingthat X isconnected, or equivalently, path-connected. Local path-connectedness is inherited by covering spaces,sothesetooareconnectedifftheyarepath-connected. Themainthrustofthe classificationwillbetheGaloiscorrespondencebetweenconnectedcoveringspacesof X andsubgroupsof (cid:25) (cid:132)X(cid:133),butwhenthisisfinishedwewillalsodescribeadifferent 1 methodofclassificationthatincludesdisconnectedcoveringspacesaswell. TheGaloiscorrespondencearisesfromthefunctionthatassignstoeachcovering (cid:0) (cid:1) space p:(cid:132)X e ;xe 0 (cid:133) ! (cid:132)X;x 0 (cid:133) the subgroup p(cid:3) (cid:25) 1 (cid:132)X e ;xe 0 (cid:133) of (cid:25) 1 (cid:132)X;x 0 (cid:133). First we con- sider whether this function is surjective. That is, we ask whether every subgroup of (cid:0) (cid:1) (cid:25) 1 (cid:132)X;x 0 (cid:133) isrealizedas p(cid:3) (cid:25) 1 (cid:132)X e ;xe 0 (cid:133) forsomecoveringspace p:(cid:132)X e ;xe 0 (cid:133) ! (cid:132)X;x 0 (cid:133). In particular we can ask whether the trivial subgroup is realized. Since p(cid:3) is always injective,thisamountstoaskingwhether X hasasimply-connnectedcoveringspace. Answeringthiswilltakesomework. A necessary condition for X to have a simply-connected covering space is the following: Each point x 2X has a neighborhood U such that the inclusion-induced ! map (cid:25) (cid:132)U;x(cid:133) (cid:25) (cid:132)X;x(cid:133) is trivial; one says X is semilocally simply-connected if 1 1 e! this holds. To see the necessity of this condition, suppose p:X X is a covering space with X e simply-connected. Every point x 2 X has a neighborhood U having a lift U e (cid:26) X e projecting homeomorphically to U by p. Each loop in U lifts to a loop in U e ,andtheliftedloopisnullhomotopicin X e since (cid:25) (cid:132)X e (cid:133)(cid:131)0. So,composingthis 1 nullhomotopywith p,theoriginalloopin U isnullhomotopicin X. A locally simply-connected space is certainly semilocally simply-connected. For example,CWcomplexeshavethemuchstrongerpropertyofbeinglocallycontractible, as we show in the Appendix. An example of a space that is not semilocally simply- connected is the shrinking wedge of circles, the subspace X (cid:26) R2 consisting of the circlesofradius1= centeredatthepoint(cid:132)1= ;0(cid:133)for n(cid:131)1;2;(cid:1)(cid:1)(cid:1),introducedinExam- n n ple 1.25. On the other hand, the cone CX (cid:131) (cid:132)X(cid:2)I(cid:133)=(cid:132)X(cid:2)f0g(cid:133) is semilocally simply- connectedsinceitiscontractible,butitisnotlocallysimply-connected.", "rank": 0, "metadata": {"section": "72"}}
