{"chunk_id": "15-0", "text": "6 Chapter 0 Some Underlying Geometric Notions If X (cid:131)Xn forsome n, then X issaidtobefinite-dimensional, andthesmallest such n isthedimensionof X,themaximumdimensionofcellsof X. Example 0.1. A 1 dimensional cell complex X (cid:131) X1 is what is called a graph in algebraictopology. Itconsistsofvertices(the 0 cells)towhichedges(the 1 cells)are attached. Thetwoendsofanedgecanbeattachedtothesamevertex. Example 0.2. The house with two rooms, pictured earlier, has a visually obvious 2 dimensionalcellcomplexstructure. The0 cellsaretheverticeswherethreeormore ofthedepictededgesmeet,andthe 1 cellsaretheinteriorsoftheedgesconnecting these vertices. This gives the 1 skeleton X1, and the 2 cells are the components of theremainderofthespace, X−X1. Ifonecountsup,onefindsthereare29 0 cells, 51 1 cells, and23 2 cells, withthealternatingsum 29−51(cid:130)23 equalto 1. Thisis the Euler characteristic, which for a cell complex with finitely many cells is defined to be the number of even-dimensional cells minus the number of odd-dimensional cells. As we shall show in Theorem 2.44, the Euler characteristic of a cell complex dependsonlyonitshomotopytype,sothefactthatthehousewithtworoomshasthe homotopy type of a point implies that its Euler characteristic must be 1, no matter howitisrepresentedasacellcomplex. Example0.3. Thesphere Sn hasthestructureofacellcomplexwithjusttwocells, e0 and en,the n cellbeingattachedbytheconstantmap Sn−1 ! e0. Thisisequivalent toregarding Sn asthequotientspace Dn=@Dn. Example 0.4. Real projective n space RPn is defined to be the space of all lines throughtheoriginin Rn(cid:130)1. Eachsuchlineisdeterminedbyanonzerovectorin Rn(cid:130)1, unique up to scalar multiplication, and RPn is topologized as the quotient space of Rn(cid:130)1−f0g undertheequivalencerelation v (cid:24)(cid:21)v forscalars (cid:21)(cid:148)0. Wecanrestrict to vectors of length 1, so RPn is also the quotient space Sn=(cid:132)v (cid:24) −v(cid:133), the sphere withantipodalpointsidentified. Thisisequivalenttosayingthat RPn isthequotient space of a hemisphere Dn with antipodal points of @Dn identified. Since @Dn with antipodalpointsidentifiedisjust RPn−1,weseethat RPn isobtainedfrom RPn−1 by attachingan n cell,withthequotientprojection Sn−1 ! RPn−1 astheattachingmap. Itfollowsbyinductionon n that RPn hasacellcomplexstructure e0[e1[(cid:1)(cid:1)(cid:1)[en withonecell ei ineachdimension i(cid:20)n. Example 0.5. Since RPn is obtained from RPn−1 by attaching an n cell, the infinite S union RP 1 (cid:131) RPn becomes a cell complex with one cell in each dimension. We n S canview RP 1 asthespaceoflinesthroughtheoriginin R1 (cid:131) Rn. n Example0.6. Complexprojectiven space CPn isthespaceofcomplexlinesthrough the origin in Cn(cid:130)1, that is, 1 dimensional vector subspaces of Cn(cid:130)1. As in the case of RPn, each line is determined by a nonzero vector in Cn(cid:130)1, unique up to scalar multiplication,and CPn istopologizedasthequotientspaceof Cn(cid:130)1−f0g underthe", "rank": 0, "metadata": {"section": "15"}}
