{"chunk_id": "2.4-0", "text": "Chapter 2. Mathematical Foundations Introduction to TDA 2.4 Algebra In this section we recap the necessary background in algebra that is needed for the basics of homology theory. Just as in the previous sections, we first introduce the objects of study, followed by the maps between them. Definition 2.28. A group (G,+) is a set G together with a binary operation “+” such that 1. ∀a,b ∈ G: a+b ∈ G 2. ∀a,b,c ∈ G: (a+b)+c = a+(b+c) (Associativity) 3. ∃0 ∈ G: a+0 = 0+a = a ∀a ∈ G 4. ∀a ∈ G∃−a ∈ G: a+(−a) = 0 (G,+) is abelian1 if we also have 5. ∀a,b ∈ G: a+b = b+a (Commutativity) Let us point out some examples: • (Z,+) is a group (even an abelian one), but (N,+) is not, since any non-zero number does not have an inverse element. • Consider the (very large) set of all sequences of moves of a Rubik’s cube that do not contain a subsequence equivalent to doing nothing. This set forms a group (with the “+” operation being concatenation), but not an abelian one: let L denote moving the left face clockwise, and let U denote moving the upper face clockwise. Replacing “clockwise” by counter-clockwise we get −L and −U, respectively. Now, ifthegroupwasabelian, thenL+U−L−Ushouldgivethesameconfigurationagain, but if you do these moves on a Rubik’s cube, you will see that the configuration has changed. As groups can be very large, even infinitely large, it can be useful to have a concise way of writing them: Definition 2.29. Let (G,+) be a group. A subset A ⊆ G is a generator if every element of G can be written as a finite sum of elements of A and their inverses. A subset B ⊆ G is a basis if every element of G can be uniquely written as a finite sum of elements of B and their inverses (ignoring trivial cancellations, i.e., a+c+(−c)+(−b) = a+(−b)). An abelian group that has a basis is called free. 1Notethatunlikeothermathematicalconceptsnamedafteraperson,abelian isusuallynotcapitalized. 20 Introduction to TDA 2.4. Algebra Examples: • The six standard moves of the Rubik’s cube (rotating the top, bottom, front, back, left, or right layer clockwise by 90◦) are a generator for the Rubik’s cube move sequences. • {1} is a basis of (Z,+). Exercise 2.30. A cyclic group is a group G that contains an element g ∈ G such that {g} is a generator of G. Show that every cyclic group is abelian (commutative). Exercise 2.31. Consider a Rubik’s cube. Prove that no sequence X of elementary moves exists such that every Rubik’s cube can be solved by repeatedly applying X. Definition 2.32. For some group (G,+), H ⊆ G is a subgroup, if (H,+) is also a group. For example, the even integers (including 0) are a subgroup of (Z,+). Subgroups are important in group theory, as they can be used to partition a group into several parts: Definition 2.33. Let H ⊆ G be a subgroup of (G,+), and a ∈ G. The left coset a+H is the set a+H := {a+b | b ∈ H}, and the right coset H+a := {b+a | b ∈ H}. If G is abelian, a+H = H+a, and they are simply called the coset. For G abelian, the quotient group of G by H, denoted by G/H, is the group on the set of cosets {a+H,a ∈ G} with the operation ⊕ defined as (a+H)⊕(b+H) = (a+b)+H, ∀a,b ∈ G. Examples: • Let G = (Z,+) and H = nZ = {n · a | a ∈ Z}. Then, G/H = {0 +", "rank": 0, "metadata": {"section": "2.4"}}
{"chunk_id": "2.4-1", "text": "coset. For G abelian, the quotient group of G by H, denoted by G/H, is the group on the set of cosets {a+H,a ∈ G} with the operation ⊕ defined as (a+H)⊕(b+H) = (a+b)+H, ∀a,b ∈ G. Examples: • Let G = (Z,+) and H = nZ = {n · a | a ∈ Z}. Then, G/H = {0 + nZ,1 + nZ,...,(n−1)+nZ} is the group usually referred to as Z , the group of modular n arithmetic modulo n. • R/Zisthecirclegroup(themultiplicativegroupofallcomplexnumbersofabsolute value 1). Try and convince yourself of this! In order to compare groups with each other, we again want a notion of maps between groups, that behave well with the group structures: Definition 2.34. A map h : G → H between abelian groups (G,+) and (H,⋆) is a homomorphism if h(a+b) = h(a)⋆h(b), ∀a,b ∈ G. ∼ A bijective homomorphism is called an isomorphism, and then we write G = H and say that G and H are isomorphic. kernel kerh := {a ∈ G | h(a) = 0} image imh := {b ∈ H | ∃a ∈ G with h(a) = b} cokernel cokerh := H/imh 21 Chapter 2. Mathematical Foundations Introduction to TDA Note that we are assuming something in our definition of the cokernel: for the defi- nition of a quotient group to apply, we need the divisor group to be a subgroup of the dividend group. Luckily, the following lemma says that imh is always a subgroup of H. Lemma 2.35. kerh and imh are subgroups of (G,+) and (H,⋆), respectively. Proof. We first prove this for kerh. 1. a,b ∈ kerh ⇒ h(a) = h(b) = 0. By definition of homomorphism, h(a + b) = h(a)⋆h(b) = 0⋆0 = 0, and thus by definition of kerh, a+b ∈ kerh. We conclude that kerh is closed under +. 2. Associativity follows from associativity of + in G, since kerh ⊆ G. 3. ∀a ∈ G : h(0)⋆h(a) = h(0+a) = h(a), and thus h(0) = 0, from which 0 ∈ kerh follows. 4. Let a ∈ kerh. Then, 0 = h(0) = h(a−a) = h(a)⋆h(−a) = 0⋆h(−a) = h(−a), and thus −a ∈ kerh. The proof for imh is left as an exercise. Exercise 2.36. Show that imh is a subgroup of H. Exercise 2.37. For two abelian groups (G,⋆) and (H,+), let the set of all homomor- phisms f : G → H be denoted by Hom(G,H). (a) Show that (Hom(G,H),⊕), where the operation ⊕ is defined as (f⊕g)(x) = f(x)+g(x),∀x ∈ G, is also a group. ∼ (b) Show that Hom(Z2,Z ) = Z2. 2 2 2 As the example of the integers shows, a big motivation for the study of groups comes from number theory. However, in number theory we do not only have addition but also multiplication. This motivates the following definition: Definition 2.38. (R,+,·) is a ring, if 1. (R,+) is an abelian group. 2. ∀a,b,c ∈ R: (a·b)·c = a·(b·c) and (Associativity of ·) a·(b+c) = a·b+a·c, (b+c)·a = b·a+c·a (Distributivity) 22 Introduction to TDA 2.4. Algebra 3. ∃1 ∈ R, such that a·1 = 1·a = a ∀a ∈ R. (Multiplicative identity) If · is commutative, we say that R is commutative. Definition 2.39. A commutative ring in which every non-zero element has a multi- plicative inverse (i.e., ∀a ∈ R\\{0},∃b ∈ R : a·b = 1) is called a field. Another important area of algebra, which you already know, is linear algebra. Here, vectors can be added and subtracted. Further the field of real numbers are called scalars and they can be multiplied with vectors.", "rank": 1, "metadata": {"section": "2.4"}}
{"chunk_id": "2.4-2", "text": "ring in which every non-zero element has a multi- plicative inverse (i.e., ∀a ∈ R\\{0},∃b ∈ R : a·b = 1) is called a field. Another important area of algebra, which you already know, is linear algebra. Here, vectors can be added and subtracted. Further the field of real numbers are called scalars and they can be multiplied with vectors. So, we have very similar operations at hand. This motivates the following generalization of the concept of vector spaces. Definition 2.40. Given a ring (R,+,·) with multiplicative identity 1, an R-module M is an abelian group (M,⊕) with an operation ⊗ : R×M → M such that for all r,r′ ∈ R and x,y ∈ M, we have 1. r⊗(x⊕y) = (r⊗x)⊕(r⊗y) 2. (r+r′)⊗x = (r⊗x)⊕(r′ ⊗x) 3. 1⊗x = x 4. (r·r′)⊗x = r⊗(r′ ⊗x) If R is a field, the R-module is called a vector space. In the literature, often the same symbol (·) is used for both operations · and ⊗, and + for both + in R and ⊕ in M. For a vector space, this should feel quite normal, since for the vector space Rn (which is an R -module), we also write · for multiplying scalars to both scalars and vectors, and + for addition of both scalars and vectors. Modules appear all over the place in homology theory. In some cases, in particular in all the cases we discuss in these lecture notes, the modules happen to be vector spaces. Thus, most of what we discuss in the following chapters could be phrased using only language from linear algebra. However, to be consistent with most of the existing literature, we will phrase most results in a slightly more general language. 23 Chapter 2. Mathematical Foundations Introduction to TDA Questions 1. What is a topological space? Give the formal definition and some examples. 2. What is a continuous map between topological spaces? What is a homeomor- phism? State the definitions and give examples. 3. What is a homotopy? What is a homotopy equivalence? Give the formal definitions. Further, definedeformationretractsandusethemtogiveanalternative definition of homotopy equivalence. 4. What are groups and the maps between them? State the definitions and prove that the image and kernel are subgroups. References [1] Tamal Krishna Dey and Yusu Wang, Computational topology for data analysis, Cambridge University Press, 2022. [2] J.R. Munkres, Topology, Prentice Hall, Incorporated, 2000. 24", "rank": 2, "metadata": {"section": "2.4"}}
