{"chunk_id": "10.1-0", "text": "Chapter 10 Applications In this chapter we highlight some classical and recent applications of topological data analysis. The fields of application are as diverse as image analysis, medicine, analysis of time series and politics. Many of these applications are also described in the book “Topological Data Analysis with Applications” by Gunnar Carlsson and Mikael Vejdemo- Johansson [2]. We also discuss some of the approaches to use persistence diagrams in machine learning. 10.1 The Space of Image Patches We consider a dataset of about 4000 greyscale images taken around Groningen (Nether- lands) by van Hateren and van der Schaaf [8], see Figure 10.1 for some examples. Each such image is described by giving each pixel a number between 0 (white) and 1 (black). Fromeveryimage, theysampled5000patchesof3-by-3pixels. Togetinterestingpatches, they only looked at the top 20% with the highest contrast. Thus, we end up with about 4 million three by three patches, each describable as a vector in R9. They further nor- malize the contrast (such that the darkest and brightest pixel are 1 and 0, respectively) and the overall norm of the vectors. Thus, we end up with points on S7. How does this point cloud look? Is there some interesting structure in this point cloud? Carlsson, Ishkhanov, de Silva and Zomorodian analyzed this point cloud using per- sistent homology [1]. Since there are a lot of points, they at first only sampled from the densest parts of the data. Computing the persistent homology of the Witness complex in dimensions 0, 1, and 2, one gets the barcodes depicted in Figure 10.2. It is thus a reasonable assumption that β = 1, β = 1, and β = 0, suggesting that the data set 0 1 2 looks like a circle. PCA also shows a circular arrangement of the data points, see Figure 10.3. This circle can be interpreted as the possible angles of a detected “edge” in the images, depicted in Figure 10.4. What happens if we additionally also sample some points from parts of the data of intermediate density? Computing the persistent homology we end up with the barcodes in Figure 10.5, suggesting that instead of one 1-cycle, we end up with five. If we again 104 Introduction to TDA 10.1. The Space of Image Patches Figure 10.1: Some examples of images in the data set. Figure 10.2: The barcodes of the densest part of the data. 105 Chapter 10. Applications Introduction to TDA Figure 10.3: Using PCA on the densest part of the data. Figure 10.4: The interpretation of the densest part of the data. 106", "rank": 0, "metadata": {"section": "10.1"}}
