{"chunk_id": "9.1-0", "text": "Chapter 9 Multiparameter persistence This chapter closely follows the introductory paper [2] on multiparameter persis- tence. The interested reader is referred there for a (much) more comprehensive overview of the topic. As we have seen, the persistence modules arising from the Čech or Vietoris-Rips com- plexes are stable under small perturbations of the underlying data, but not robust. That is, even a small number of outliers can drastically change the persistence diagram or bar- code. We could try to remedy this problem by making these complexes density-aware in some way. For the Vietoris-Rips complex, a typical way to do this is as follows. For a vertex v in a simplicial complex, its degree deg(v) is the number of edges (1-simplices) in the complex that contain v. Then. for d ∈ N , the degree-d Vietoris-Rips complex is VRr(X) := {σ ∈ VRr(X) : each vertex of σ has degree at least d}. d Note that vertices corresponding to data points in high-density areas of X will have relatively higher degree, whereas outliers will have relatively lower degree. Thus, for d large enough, we should expect this modification to reduce the impact of outliers. On the other hand, if d is too large, we are ‘throwing away the baby with the bathwater’. So, the question is: how to choose d? Here, we run into the same issue that originally motivated persistence: there might not be one choice of d that accurately reflects the entire data set. Even if this choice would exist, it might be hard to determine. Instead, we would like to consider all choices of d simultaneously. The solution is to look at persistence w.r.t. both the scale parameter r and the density parameter d at the same time. In this chapter, we formalize such multiparameter persistence, and take a look at the representability and robustness of the resulting multiparameter persistence modules. 9.1 Persistence modules indexed by a poset A persistence module (indexed by R ) consists of a family of vectors spaces U , a ∈ R , a together with commuting maps U → U for a ⩽ b. If we want to define persistence a b 96 Introduction to TDA 9.1. Persistence modules indexed by a poset modules indexed by more exotic sets, we need to first extend the meaning of ‘⩽’. Definition 9.1. A poset (partially ordered set) is a tuple (P,⪯) consisting of a set P and a binary relation ⪯ on P satisfying • a ⪯ a for all a ∈ P; • a ⪯ b and b ⪯ a implies a = b for all a,b ∈ P; • a ⪯ b and b ⪯ c implies a ⪯ c for all a,b,c ∈ P; We will sometimes simply write P if the (partial) ordering ⪯ is clear from context. Note that partial orderings allow for elements to be incomparable, i.e., it can happen for a,b ∈ P that neither a ⪯ b nor b ⪯ a holds. In contrast, under a total ordering all elements in P must be comparable. All the posets we will see in this chapter are constructed from the following examples: • The reals R = (R,⩽) and natural numbers N = (N,⩽) with their usual ordering are posets. • If (P,⪯) is a poset, and Q ⊆ P, then (Q,⪯) is a poset; • For any poset (P,⪯), we have the opposite poset Pop = (P,⪰), where a ⪰ b ⇐⇒ b ⪯ a for all a,b ∈ P. • For two posets (P,⪯ ) and (Q,⪯ ) we have the product poset (P×Q,⪯), where P", "rank": 0, "metadata": {"section": "9.1"}}
{"chunk_id": "9.1-1", "text": "are posets. • If (P,⪯) is a poset, and Q ⊆ P, then (Q,⪯) is a poset; • For any poset (P,⪯), we have the opposite poset Pop = (P,⪰), where a ⪰ b ⇐⇒ b ⪯ a for all a,b ∈ P. • For two posets (P,⪯ ) and (Q,⪯ ) we have the product poset (P×Q,⪯), where P Q (p,q) ⪯ (p′,q′) ⇐⇒ p ⪯ p′ and q ⪯ q′ for all p,p′ ∈ P and q,q′ ∈ Q. P Q We can now define filtrations and persistence modules indexed by an arbitrary poset, generalizing our definitions from earlier chapters. Definition 9.2. Let (P,⪯) be a poset. A family (X ) of topological spaces (or sim- p p∈P plicial complexes) is called a P-filtration if X ⊆ X for all p,p′ ∈ P with p ⪯ p′. p p′ Definition 9.3. Let (P,⪯) be a poset, and let F be a field. A P-persistence module (over F) consists of • An F-vector space U for each p ∈ P; p • A linear map u : U → U for each p,p′ ∈ P with p ⪯ p′, satisfying p,p′ p p′ u ◦u = u for all p ,p ,p ∈ P with p ⪯ p ⪯ p . p ,p p ,p p ,p 1 2 3 1 2 3 2 3 1 2 1 3 Observation9.4. If (X ) is a P-filtration for some poset P, then taking k-dimensional p p∈P homology gives us a P-persistence module H (X ) (where, as before, the maps k p u : H (X ) → H (X ) are induced by the inclusions X (cid:44)→ X ). p,p′ k p k p′ p p′ 97", "rank": 1, "metadata": {"section": "9.1"}}
