{"chunk_id": "3.2.1-0", "text": "Introduction to TDA 3.2. Homology 3.2.1 Chains In the following we let K be a simplicial complex, and we use m to denote the number p of p-simplices in K. We first want to define p-chains, which are simply an algebraic way of formalizing and generalizing subsets of p-simplices. Definition 3.17. A p-chain c (in K) is a formal sum of p-simplices added with some coefficients from some ring R. A p-chain c can thus be written as (cid:88)mp c = α σ , i i i=1 where α ∈ R and σ ∈ K are p-simplices. i i All we are doing in this formal sum is giving a coefficient from R to each p-simplex of K. A formal sum is only a sum in a syntactic sense (i.e., we use the symbols + (cid:80) and ), but there is no semantic meaning behind this operation; there is no other way to represent a chain other than the sum it is defined by. Using the addition operation of the ring R however, we can now also add two p-chains (cid:80) (cid:80) c = α σ and c′ = α′σ (both in K). Since the chains are both just formal sums, i i i i we can simply do this addition “component-wise”, using addition in R on the coefficients: (cid:88)mp c+c′ := (α +α′)σ i i i i=1 We therefore have an addition operation on the set C (K) of all p-chains in K. We p show next that C (K) endowed with this operation forms a group, and we call it the p p-th chain group (of K). Observation 3.18. (C (K),+) is an abelian group, it is free, and the p-simplices form p a basis. Proof. To show that it is a group we observe that: 1. C (K) is closed under addition, since ∀c ,c ∈ C (K) we have c +c ∈ C (K). p 1 2 p 1 2 p 2. The operation + is associative: ∀c ,c ,c ∈ C (K), (cid:80) 1 (cid:80)2 3 p (cid:80) (c +c )+c = (α(1) +α(2))σ + α(3)σ = (α(1) +α(2) +α(3))σ = (cid:80)1 2 (cid:80)3 i i i i i i i i i α(1)σ + (α(2) +α(3))σ = c +(c +c ). i i i i i 1 2 3 (cid:80) 3. We have a neutral element 0 = 0σ ∈ C (K). i p (cid:80) 4. Every element has an inverse: ∀c ∈ C (K) we have −c = (−α σ ) ∈ C (K) and (cid:80) p i i p c+(−c) = (α −α )σ = 0. i i i 33", "rank": 0, "metadata": {"section": "3.2.1"}}
