{"chunk_id": "6.3-0", "text": "Chapter 6. Distances and Stability Introduction to TDA We can conclude the following Theorem 6.31. d (Dgm (C(P)),Dgm (C(Q))) ⩽ d (P,Q) for all p ⩾ 0. b p p H Proof. By Theorem 6.26, Observation 6.24, and finally Lemma 6.30, we have d (...) = d (H C(P),H C(Q)) ⩽ d (C(P),C(Q)) ⩽ d (P,Q). b I p p I H 6.3 Interval Decomposition of Persistence Modules In this section, we again look at persistence modules, this time as algebraic structures. We consider persistence modules over of vector spaces over some field . We start by R F looking at some special persistence modules, called interval modules. Definition 6.32. An interval module I[b,d] is a persistence module (cid:14) (cid:14) F if a ∈ [b,d], id b ⩽ a ⩽ a′ ⩽ d, V = and v = a a,a′ 0 otherwise. 0 otherwise. Similarly, we can define interval modules on open and clopen intervals, denoted by I(b,d), I(b,d], and I[b,d). We write I⟨b,d⟩ to include all four of these types. Foranintervalmodulewecaneasilytalkaboutbirthanddeathaswedidinpersistent homology. If we have a persistent homology module that is (isomorphic to) an interval module, the birth and death correspond to the boundaries b,d of the interval. Definition 6.33. A persistence module U is called pointwise finite dimensional (p.f.d.) if for all a ∈ R, U has finite dimension. a Note that all p.f.d. persistence modules are also q-tame. Definition 6.34. Given two persistence modules U,V, we define their direct sum U⊕V by (U⊕V) = U ⊕V and (u⊕v) = u ⊕v . a a a a,a′ a,a′ a,a′ Here, the direct sum of maps just means applying the respective maps component- wise. Proposition6.35. If U ,U are ϵ-interleaved, and V ,V are δ-interleaved, then U ⊕V 1 2 1 2 1 1 and U ⊕V are max{ϵ,δ}-interleaved. 2 2 Proof. Without loss of generality, let ϵ ⩾ δ, so we need to show that they are ϵ- interleaved. Recall that if two persistence modules are δ-interleaved, they are also ϵ- interleaved. Let φu,ψu be (series of) functions showing that U ,U are ϵ-interleaved. 1 2 Similarly, let φv,ψv be (series of) functions showing that V ,V are ϵ-interleaved. Then, 1 2 φu ⊕φv,ψu ⊕ψv show that U ⊕V and U ⊕V are ϵ-interleaved. 1 1 2 2 72 Introduction to TDA 6.3. Interval Decomposition of Persistence Modules If we now have a direct sum of interval modules, we can still nicely talk about births and deaths: we just consider each interval module in isolation. The following theorem shows that surprisingly most persistence modules can be expressed as direct sums of interval modules. Theorem6.36(Structure theorem). Any p.f.d. persistence module decomposes uniquely into interval modules, i.e., we have ∼ (cid:77) U = I⟨b ,d ⟩. i i i∈I The intervals ⟨b ,d ⟩ are exactly the barcodes if U is a persistent homology module. i i Note that unless we have some additional tame-ness condition on U , I is not guaran- teed to be finite. Recall that when we talked about persistent homology, we said that there is some consistent global choice of basis for persistent homology groups. That is a consequence of the structure theorem. The structure theorem also allows us to prove one direction of Theorem 6.26, which we will do in the following. Proposition 6.37. Consider two interval modules I = I⟨b ,d ⟩ and I = I⟨b ,d ⟩. 1 1 1 2 2 2 Then, d (I ,I ) = d (DgmI ,DgmI ). I 1 2 b 1 2 Proof. To prove that d (I ,I ) ⩾ d (DgmI ,DgmI ),", "rank": 0, "metadata": {"section": "6.3"}}
{"chunk_id": "6.3-1", "text": "6.26, which we will do in the following. Proposition 6.37. Consider two interval modules I = I⟨b ,d ⟩ and I = I⟨b ,d ⟩. 1 1 1 2 2 2 Then, d (I ,I ) = d (DgmI ,DgmI ). I 1 2 b 1 2 Proof. To prove that d (I ,I ) ⩾ d (DgmI ,DgmI ), we show that every upper bound I 1 2 b 1 2 ond isalsoanupperboundond : assumethatwehavemapsφ,ψshowingthatthetwo I b modules are ϵ-interleaved. Then, consider ψ ◦φ = v1 , equality holding because a+ϵ a a,a+2ϵ φ,ψ certify ϵ-interleaving and the triangular diagram commutes. Consider a ∈ ⟨b ,d ⟩. 1 1 Case 1: v1 = 0 for all a ∈ ⟨b ,d ⟩. Then, d −b < 2ϵ, and the (infinity-norm) a,a+2ϵ 1 1 1 1 distance of (b ,d ) to the diagonal is less than ϵ. If this case would also hold for v2 1 1 we would be done, since for both DgmI and DgmI we could match the point to the 1 2 diagonal. Case 2: v1 = id for some a ∈ ⟨b ,d ⟩. Then, d −b ⩾ 2ϵ. Furthermore, we have a,a+2ϵ 1 1 1 1 φ (F) = F for all a ∈ ⟨b ,d −2ϵ⟩. So, for these a, we must also have a+ϵ ∈ ⟨b ,d ⟩. a 1 1 2 2 Thistellsusthat⟨b ,d ⟩must“cover” alargepartof⟨b ,d ⟩, namelywegetb ⩽ b +ϵ, 2 2 1 1 2 1 and d ⩾ d −ϵ. We can now see that |b −b | ⩽ ϵ and |d −d | ⩽ ϵ: to violate this, 2 1 2 1 2 1 ⟨b ,d ⟩ would have to be a larger interval than ⟨b ,d ⟩ (in particular, it would be longer 2 2 1 1 than2ϵ), andwecouldthusexchangetheirrolesandgetthatb ⩽ b +ϵandd ⩾ d −ϵ. 1 2 1 2 We thus know that we can just match the off-diagonal points to each other, and since we must have d ((b ,d ),(b ,d )) ⩽ ϵ we get the bound on d . ∞ 1 1 2 2 b We now prove the other direction, d (I ,I ) ⩽ d (DgmI ,DgmI ). To see this, we I 1 2 b 1 2 show that from every matching whose longest edge is ϵ, we get an ϵ-interleaving. 73 Chapter 6. Distances and Stability Introduction to TDA Case 1: The two off-diagonal points are matched to the diagonal. Then, we get that d −b ⩽ 2ϵ for both of them, and thus for all ϵ′ > ϵ, I and I are ϵ′-interleaved with i i 1 2 φ,ψ = 0 (recall Exercise 6.22). Thus, d ⩽ ϵ. I Case 2: The points are matched with each other. Then, |b −b | ⩽ ϵ and |d −d | ⩽ ϵ. 2 1 2 1 Taking φ,ψ = id we can see that I and I are ϵ-interleaved. Thus, d ⩽ ϵ. 1 2 I We can now use this to show one direction of Theorem 6.26. Corollary 6.38. Let U,V be p.f.d. persistence modules. Then we have that d (U,V) ⩽ I d (DgmU,DgmV). b Proof. We apply the structure theorem to decompose U,V into direct sums of interval modules, i.e., U = (cid:76) I⟨b ,d ⟩ ⊕ (cid:76) 0 and V = (cid:76) 0 ⊕ (cid:76) I⟨b ,d ⟩. From the i∈I i i j∈J i∈I j∈J j j Bottleneck matching we get a matching between parts making up and . Since the U V Bottleneck distance is the maximum length of any edge, we have", "rank": 1, "metadata": {"section": "6.3"}}
{"chunk_id": "6.3-2", "text": "of interval modules, i.e., U = (cid:76) I⟨b ,d ⟩ ⊕ (cid:76) 0 and V = (cid:76) 0 ⊕ (cid:76) I⟨b ,d ⟩. From the i∈I i i j∈J i∈I j∈J j j Bottleneck matching we get a matching between parts making up and . Since the U V Bottleneck distance is the maximum length of any edge, we have d (DgmU,DgmV) ⩾ b d (DgmI ,DgmI ) = d (I ,I ) for every two interval modules that were matched to- b 1 2 I 1 2 gether, where we used Proposition 6.37. Finally, we use Proposition 6.35 to get the desired statement. Questions 20. How can we measure distances between persistence diagrams? Discuss Bottle- neck and Wasserstein distance. 21. How stable are filtrations derived from simplex-wise monotone functions with respect to Bottleneck distance? State, illustrate and prove the stability theorem (Theorem 6.7). 22. How can we measure distances between persistence modules? Define interleav- ing distance and discuss its relation to Bottleneck distance. 23. How stable are Čech complexes to perturbations of the underlying point set? DefineHausdorffdistance, stateandprovethestabilitytheoremforČechcomplexes (Theorem 6.31). 74", "rank": 2, "metadata": {"section": "6.3"}}
