{"chunk_id": "21-0", "text": "12 Chapter 0 Some Underlying Geometric Notions X=A and X=B arehomotopyequivalentto X. Thespace X=A isthequotient S2=S0, thespherewithtwopointsidentified,and X=B is S1_S2. Hence S2=S0 and S1_S2 arehomotopyequivalent,afactwhichmaynotbeentirelyobviousatfirstglance. Example 0.9. Let X be the union of a torus with n meridional disks. To obtain a CW structure on X, choose a longitudinal circle in the torus, intersecting each of themeridionaldisksinonepoint. Theseintersectionpointsarethenthe 0 cells,the 1 cellsaretherestofthelongitudinalcircleandtheboundarycirclesofthemeridional disks, and the 2 cells are the remaining regions of the torus and the interiors of the meridional disks. Collapsing each meridional disk to a point yields a homotopy X Y Z W equivalent space Y consisting of n 2 spheres, each tangent to its two neighbors, a ‘necklacewith n beads.’ Thethirdspace Z inthefigure,astrandof n beadswitha stringjoiningitstwoends,collapsesto Y bycollapsingthestringtoapoint,sothis collapseisahomotopyequivalence. Finally,bycollapsingthearcin Z formedbythe front halves of the equators of the n beads, we obtain the fourth space W, a wedge sum of S1 with n 2 spheres. (One can see why a wedge sum is sometimes called a ‘bouquet’intheolderliterature.) Example 0.10: Reduced Suspension. Let X be a CW complex and x 2 X a 0 cell. 0 Insidethesuspension SX wehavethelinesegment fx g(cid:2)I,andcollapsingthistoa 0 pointyieldsaspace (cid:214)X homotopyequivalentto SX,calledthereducedsuspension of X. For example, if we take X to be S1_S1 with x the intersection point of the 0 twocircles,thentheordinarysuspension SX istheunionoftwospheresintersecting along the arc fx g(cid:2)I, so the reduced suspension (cid:214)X is S2_S2, a slightly simpler 0 space. More generally we have (cid:214)(cid:132)X _Y(cid:133) (cid:131) (cid:214)X _(cid:214)Y for arbitrary CW complexes X and Y. Anotherwayinwhichthereducedsuspension (cid:214)X isslightlysimplerthan SX isinitsCWstructure. In SX therearetwo 0 cells(thetwosuspensionpoints)andan (cid:132)n(cid:130)1(cid:133) cell en(cid:2)(cid:132)0;1(cid:133) foreach n cell en of X,whereasin (cid:214)X thereisasingle 0 cell andan (cid:132)n(cid:130)1(cid:133) cellforeach n cellof X otherthanthe 0 cell x . 0 The reduced suspension (cid:214)X is actually the same as the smash product X ^S1 sincebothspacesarethequotientof X(cid:2)I with X(cid:2)@I[fx g(cid:2)I collapsedtoapoint. 0 Attaching Spaces Anothercommonwaytochangeaspacewithoutchangingitshomotopytypein- volvestheideaofcontinuouslyvaryinghowitspartsareattachedtogether. Ageneral definitionof‘attachingonespacetoanother’thatincludesthecaseofattachingcells", "rank": 0, "metadata": {"section": "21"}}
