{"chunk_id": "92-0", "text": "Graphs and Free Groups Section 1.A 83 Sinceallgroupscanberealizedasfundamentalgroupsofspaces,thisopensthe way for using topology to study algebraic properties of groups. The topics in this section and the next give some illustrations of this principle, mainly using covering spacetheory. We remind the reader that the Additional Topics which form the remainder of thischapterarenottoberegardedasanessentialpartofthebasiccoreofthebook. Readerswhoareeagertomoveontonewtopicsshouldfeelfreetoskipahead. By definition, a graph is a 1 dimensional CW complex, in other words, a space X obtained from a discrete set X0 by attaching a collection of 1 cells e . Thus X (cid:11) isobtainedfromthedisjointunionof X0 withclosedintervals I byidentifyingthe (cid:11) two endpoints of each I with points of X0. The points of X0 are the vertices and (cid:11) the 1 cellstheedgesof X. Notethatwiththisdefinitionanedgedoesnotincludeits endpoints, so an edge is an open subset of X. The two endpoints of an edge can be thesamevertex,sotheclosure e ofanedge e ishomeomorphiceitherto I or S1. (cid:11) (cid:11) ‘ SinceX hasthequotienttopologyfromthedisjointunionX0 I ,asubsetofX (cid:11) (cid:11) isopen(orclosed)iffitintersectstheclosure e ofeachedge e inanopen(orclosed) (cid:11) (cid:11) setin e . Onesaysthat X hastheweaktopologywithrespecttothesubspaces e . (cid:11) (cid:11) Inthistopologyasequenceofpointsintheinteriorsofdistinctedgesformsaclosed subset, hence never converges. This is true in particular if the edges containing the sequence all have a common vertex and one tries to choose the sequence so that it gets ‘closer and closer’ to the vertex. Thus if there is a vertex that is the endpoint of infinitely many edges, then the weak topology cannot be a metric topology. An exerciseattheendofthissectionistoshowtheconverse, thattheweaktopologyis ametrictopologyifeachvertexisanendpointofonlyfinitelymanyedges. Abasisforthetopologyof X consistsoftheopenintervalsintheedgestogether withthepath-connectedneighborhoodsofthevertices. Aneighborhoodofthelatter sort about a vertex v is the union of connected open neighborhoods U of v in e (cid:11) (cid:11) forall e containing v. Inparticular,weseethat X islocallypath-connected. Hence (cid:11) agraphisconnectediffitispath-connected. If X has only finitely many vertices and edges, then X is compact, being the ‘ continuousimageofthecompactspace X0 I . Theconverseisalsotrue,andmore (cid:11) (cid:11) generally,acompactsubset C ofagraph X canmeetonlyfinitelymanyverticesand edgesof X. Toseethis,letthesubspace D(cid:26)C consistoftheverticesin C together with one point in each edge that C meets. Then D is a closed subset of X since it", "rank": 0, "metadata": {"section": "92"}}
