{"chunk_id": "6.2.1-0", "text": "Introduction to TDA 6.2. Interleaving of Persistence Modules X = [0,1] f : g : Figure 6.4: Two functions [0,1] → R with bounded infinity norm whose persistence diagrams have unbounded Wasserstein distance. 6.2 Interleaving of Persistence Modules 6.2.1 Interleaving Distance Until now, we only compared persistence diagrams. We will now introduce the interleav- ing distance, which instead compares persistence modules directly. Let us begin with a formal definition of persistence modules. Definition 6.16. A persistence module V over R is a collection V = {V a } a∈R of vector spaces V together with linear maps v : V → V for a ⩽ a′, such that v = id a a,a′ a a′ a,a and v ◦v = v for all a ⩽ b ⩽ c. b,c a,b a,c You already know a few examples of persistence modules, e.g., the persistent homol- ogy of sublevel set filtrations or of Čech or Vietoris-Rips complexes (here one simply defines V = 0 for a < 0). a To be able to define distances between persistence modules, we first need to figure out when we want to call two persistence modules “the same”, or more formally speaking, we want to define a notion of isomorphism. Definition 6.17. We say that two persistence modules U and V are isomorphic if there are isomorphisms f : U → V for all a ∈ R such that a a a U u a,a′ U a a′ fa f a′ V v a,a′ V a a′ 67 Chapter 6. Distances and Stability Introduction to TDA commutes both ways, i.e., f ◦u = v ◦f , and u ◦f−1 = f−1 ◦v . a′ a,a′ a,a′ a a,a′ a a′ a,a′ The basic idea of interleaving distance is to measure how close two persistence mod- ules are to being isomorphic. For this, we allow ourselves some slack, in the sense that U does not need to map to V , but it can instead map to V , as long as all the a a a+ϵ relevant maps still behave like they would for an isomorphism. We make this formal in the next definition. Definition6.18(ϵ-interleavingpersistencemodules). Let U and V be persistence modules over R and let ϵ ⩾ 0. We say that U and V are ϵ-interleaved if there exist two families of linear maps, φ : U → V and ψ : V → U such that the a a a+ϵ a a a+ϵ following four diagrams are commutative: U u a,a′ U U u a+ϵ,a′+ϵ U a a′ a+ϵ a′+ϵ φa φ a′ and ψa ψ a′ V v a+ϵ,a′+ϵ V V v a,a′ V a+ϵ a′+ϵ a a′ u U a,a+2ϵ U U a a+2ϵ a+ϵ φa ψa+ϵ and ψa φa+ϵ v V V a,a+2ϵ V a+ϵ a a+2ϵ Note that if U and V are isomorphic, then they are 0-interleaved: the first type of diagrams (the square diagrams) are the commutative diagrams in the definition of isomorphic persistence modules and the the second type of diagrams (the triangular diagrams) collapse to two arrows that say that the maps φ are isomorphisms with a inverses ψ . a Theorem 6.19. Assume U and V are ϵ-interleaved. Let δ > ϵ. Then U and V are also δ-interleaved. Proof. Given φ′ : U → V we define φ : U → V simply as φ := v ◦φ′. a a a+ϵ a a a+δ a a+ϵ,a+δ a Symmetrically, we define ψ := u ◦ ψ′. To check that the correct diagrams a a+ϵ,a+δ a commute, we only check the right diagram of every pair", "rank": 0, "metadata": {"section": "6.2.1"}}
{"chunk_id": "6.2.1-1", "text": "V are also δ-interleaved. Proof. Given φ′ : U → V we define φ : U → V simply as φ := v ◦φ′. a a a+ϵ a a a+δ a a+ϵ,a+δ a Symmetrically, we define ψ := u ◦ ψ′. To check that the correct diagrams a a+ϵ,a+δ a commute, we only check the right diagram of every pair of symmetric diagrams shown above. We have to distinguish two cases for the first diagram, a + δ < a′ + ϵ and a+δ > a′ +ϵ. For the first case, we get the following diagram: U U a a′ V V V V a+ϵ a+δ a′+ϵ a′+δ 68 Introduction to TDA 6.2. Interleaving of Persistence Modules For the second case we get the diagram: U U a a′ V V V V a+ϵ a′+ϵ a+δ a′+δ And finally, for the triangular diagram we get: U U U U a a+2ϵ a+δ+ϵ a+2δ V V a+ϵ a+δ One can now verify that in all of these diagrams the correct paths commute. Thus, the following definition makes sense: Definition 6.20 (Interleaving distance). d (U,V) := inf{ϵ | U and V are ϵ-interleaved }. I Exercise6.21. Show that interleaving distance is a pseudo-metric for persistence mod- ules (up to isomorphism), i.e., prove that (i) the interleaving distance between iso- morphic persistence modules is 0, (ii) the interleaving distance is non-negative, and (iii) the interleaving distance fulfills the triangle inequality. Also show that it is not a metric by showing that there exist non-isomorphic persistence modules with interleaving distance 0. Exercise 6.22. Let W and W be two arbitrary vector spaces. Let U be the persistence 1 2 module such that U = W for a ∈ [w,x), and U = 0, otherwise. For a,a′ ∈ [w,x) a 1 a we have u being the identity map. For a < w or a′ ⩾ x (or both), we have u a,a′ a,a′ being the zero map. Similarly, we define the persistence module V which is W in 2 a ∈ [y,z) and 0 otherwise. Show that d (U,V) ⩽ max(w−x, z−y). I 2 2 The underlying ideas that allowed us to define the interleaving distance of persistence modules can also be applied to filtrations. Definition 6.23 (Interleaving for Filtrations). Let F,G be filtrations over R. F and G are ϵ-interleaved if there exist maps φ : F → G and ψ : G → F such a a a+ϵ a a a+ϵ that the same type of diagrams commute up to homotopy, that is, for example φ ◦ιF ≃ ιG ◦φ are homotopic (contiguous). a′ a,a′ a+ϵ,a′+ϵ a We again define the interleaving distance (now between filtrations): d (F,G) = inf{ϵ | F and G are ϵ-interleaved }. I From induced homology, we immediately get the following observation: 69", "rank": 1, "metadata": {"section": "6.2.1"}}
