{"chunk_id": "4.1-0", "text": "Chapter 4 Persistence In the previous chapter, we have studied the homology of fixed simplicial complexes. In this chapter, we will look at simplicial complexes that grow over time. Let us start with a small example. Consider the following process of building up a triangle abc. At time t , we add the vertices a and b together with the edge ab. This gives birth to a single 1 connectedcomponent. Attimet weaddthevertexc, givingbirthtoasecondconnected 2 component. At time t we add the edge ac, connecting the two components. We can 3 interpret this as the younger of the components being absorbed by the older component. In more crude language, we say that the younger component dies. At time t we add the 4 final edge bc, which gives birth to a hole, that is, an element of the homology group H . 1 Finally, at time t we add the interior of the triangle, killing the hole born at t . We 5 4 can summarize this process as follows: we have a connected component that was born at t and survived the entire process, and a connected component that was born at t 1 2 that died again at t . Finally, we have a hole born at t dying at t . Capturing this 3 4 5 information of holes with their birth and death is the goal of persistent homology. Persistent homology can be applied to data analysis by defining (in a way that we will seesoon)aprocesstobuildupasimplicialcomplexfrompointclouddataandcomputing the birth and death times of holes. Subtracting the birth time from the death time we get the lifespan of a hole; the underlying idea is that holes with a short lifetime are a byproduct of the process (noise), whereas holes with a long lifespan convey information about the shape of the underlying data. 4.1 Filtrations We start by a mathematical formulation of the process of growing a simplicial complex or, more general, a topological space. A filtration is a nested sequence of subspaces F : X ⊆ X ⊆ X ⊆ ... ⊆ X = X. 0 1 2 n For each i ⩽ j, we have the inclusion map ι : X (cid:44)→ X . Given these functions ι, i,j i j we get induced maps in homology: hi,j = ι : H (X ) → H (X ). Filtrations are a very p ∗ p i p j 47", "rank": 0, "metadata": {"section": "4.1"}}
