{"chunk_id": "51-0", "text": "42 Chapter 1 The Fundamental Group composition in P(cid:132)W(cid:133), because of the relation L gg0 (cid:131) L g L g0. Since composition in P(cid:132)W(cid:133) isassociative,weconcludethattheproductin W isassociative. In particular, we have the free product Z(cid:3)Z as described earlier. This is an example of a free group, the free product of any number of copies of Z, finite or infinite. Theelementsofafreegroupareuniquelyrepresentableasreducedwordsin powersofgeneratorsforthevariouscopiesof Z,withonegeneratorforeach Z,just asinthecaseof Z(cid:3)Z. Thesegeneratorsarecalledabasis forthefreegroup,andthe number of basis elements is the rank of the free group. The abelianization of a free groupisafreeabeliangroupwithbasisthesamesetofgenerators,sosincetherank of a free abelian group is well-defined, independent of the choice of basis, the same istruefortherankofafreegroup. Aninterestingexampleofafreeproductthatisnotafreegroupis Z (cid:3)Z . This 2 2 islike Z(cid:3)Z butsimplersince a2 (cid:131)e(cid:131)b2,sopowersof a and b arenotneeded,and Z (cid:3)Z consistsofjustthealternatingwordsin a and b: a, b, ab, ba, aba, bab, 2 2 abab, baba, ababa; (cid:1)(cid:1)(cid:1), together with the empty word. The structure of Z (cid:3)Z 2 2 ! can be elucidated by looking at the homomorphism ’:Z (cid:3)Z Z associating to 2 2 2 eachworditslengthmod 2. Obviously ’ issurjective,anditskernelconsistsofthe wordsofevenlength. Theseformaninfinitecyclicsubgroupgeneratedby ab since ba(cid:131)(cid:132)ab(cid:133) −1 in Z (cid:3)Z . Infact, Z (cid:3)Z isthesemi-directproductofthesubgroups 2 2 2 2 Z and Z generatedby ab and a,withtheconjugationrelation a(cid:132)ab(cid:133)a −1 (cid:131)(cid:132)ab(cid:133) −1. 2 Thisgroupissometimescalledtheinfinitedihedralgroup. For a general free product (cid:3) G , each group G is naturally identified with a (cid:11) (cid:11) (cid:11) subgroup of (cid:3) G , the subgroup consisting of the empty word and the nonidentity (cid:11) (cid:11) one-letter words g 2 G . From this viewpoint the empty word is the common iden- (cid:11) tity element of all the subgroups G , which are otherwise disjoint. A consequence (cid:11) ofassociativityisthatanyproduct g (cid:1)(cid:1)(cid:1)g ofelements g inthegroups G hasa 1 m i (cid:11) unique reduced form, the element of (cid:3) G obtained by performing the multiplica- (cid:11) (cid:11) tions in any order. Any sequence of reduction operations on an unreduced product g 1 (cid:1)(cid:1)(cid:1)g m ,combiningadjacentletters g i and g i(cid:130)1 thatlieinthesame G (cid:11) orcanceling a g thatistheidentity,canbeviewedasawayofinsertingparenthesesinto g (cid:1)(cid:1)(cid:1)g i 1 m andperformingtheresultingsequenceofmultiplications. Thusassociativityimplies that any two sequences of reduction operations performed on the same unreduced wordalwaysyieldthesamereducedword. A basic property of the free product (cid:3) G is that any collection of homomor- (cid:11) (cid:11) ! ! phisms ’ :G H extends uniquely to a homomorphism ’:(cid:3) G H. Namely, (cid:11) (cid:11) (cid:11) (cid:11) thevalueof ’ onaword g (cid:1)(cid:1)(cid:1)g with g 2G mustbe ’ (cid:132)g (cid:133)(cid:1)(cid:1)(cid:1)’ (cid:132)g (cid:133),and 1 n i (cid:11)i (cid:11)1 1 (cid:11)n n usingthisformulatodefine ’ givesawell-definedhomomorphismsincetheprocess of reducing an unreduced product in (cid:3) G does not affect its image under ’. For (cid:11) (cid:11) example,forafreeproduct G(cid:3)H theinclusions G > G(cid:2)H and H > G(cid:2)H induce ! asurjectivehomomorphism G(cid:3)H G(cid:2)H.", "rank": 0, "metadata": {"section": "51"}}
