{"chunk_id": "62-0", "text": "Van Kampen’s Theorem Section 1.2 53 4. Let X (cid:26)R3 betheunionof n linesthroughtheorigin. Compute (cid:25) (cid:132)R3−X(cid:133). 1 5. Let X (cid:26) R2 be a connected graph that is the union of a finite number of straight line segments. Show that (cid:25) (cid:132)X(cid:133) is free with a basis consisting of loops formed by 1 theboundariesoftheboundedcomplementaryregionsof X,joinedtoabasepointby suitablychosenpathsin X. [AssumetheJordancurvetheoremforpolygonalsimple closedcurves,whichisequivalenttothecasethat X ishomeomorphicto S1.] 6. Suppose a space Y is obtained from a path-connected subspace X by attaching n cells for a fixed n (cid:21) 3. Show that the inclusion X > Y induces an isomorphism on (cid:25) . [See the proof of Proposition 1.26.] Apply this to show that the complement 1 ofadiscretesubspaceof Rn issimply-connectedif n(cid:21)3. 7. Let X be the quotient space of S2 obtained by identifying the north and south poles to a single point. Put a cell complex structure on X and use this to compute (cid:25) (cid:132)X(cid:133). 1 8. Compute the fundamental group of the space obtained from two tori S1(cid:2)S1 by identifying a circle S1(cid:2)fx g in one torus with the corresponding circle S1(cid:2)fx g in 0 0 theothertorus. 9. In the surface M of genus g, let g C be a circle that separates M into g 0 twocompactsubsurfaces M 0 and M 0 C h k obtainedfromtheclosedsurfaces M h M 0 C M 0 and M bydeletinganopendiskfrom h k k 0 each. Showthat M doesnotretractontoitsboundarycircle C,andhence M does h g not retract onto C. [Hint: abelianize (cid:25) .] But show that M does retract onto the 1 g 0 nonseparatingcircle C inthefigure. 10. Consider two arcs (cid:11) and (cid:12) embedded in D2(cid:2)I as fi fl showninthefigure. Theloopγ isobviouslynullhomotopic in D2(cid:2)I, but show that there is no nullhomotopy of γ in (cid:176) thecomplementof (cid:11)[(cid:12). ! 11. The mapping torus T of a map f:X X is the quotient of X(cid:2)I obtained f by identifying each point (cid:132)x;0(cid:133) with (cid:132)f(cid:132)x(cid:133);1(cid:133). In the case X (cid:131) S1 _S1 with f basepoint-preserving, compute a presentation for (cid:25) (cid:132)T (cid:133) in terms of the induced 1 f ! map f(cid:3):(cid:25) 1 (cid:132)X(cid:133) (cid:25) 1 (cid:132)X(cid:133). Do the same when X (cid:131) S1(cid:2)S1. [One way to do this is to regard T asbuiltfrom X_S1 byattachingcells.] f 12. The Klein bottle is usually pictured as a sub- space of R3 like the subspace X (cid:26) R3 shown in thefirstfigureattheright. Ifonewantedamodel thatcouldactuallyfunctionasabottle,onewould deletetheopendiskboundedbythecircleofself- intersection of X, producing a subspace Y (cid:26) X. Show that (cid:25) (cid:132)X(cid:133) (cid:25) Z(cid:3)Z and that 1", "rank": 0, "metadata": {"section": "62"}}
