{"chunk_id": "34-0", "text": "Basic Constructions Section 1.1 25 This first section begins with the basic definitions and constructions, and then proceeds quickly to an important calculation, the fundamental group of the circle, usingnotionsdevelopedmorefullyinx1.3. Moresystematicmethodsofcalculation aregiveninx1.2. Thesearesufficienttoshowforexamplethateverygroupisrealized as the fundamental group of some space. This idea is exploited in the Additional Topicsattheendofthechapter,whichgivesomeillustrationsofhowalgebraicfacts about groups can bederived topologically, suchas the fact that every subgroup ofa freegroupisfree. Paths and Homotopy The fundamental group will be defined in terms of loops and deformations of loops. Sometimes it will be useful to consider more generally paths and their defor- mations,sowebeginwiththisslightextragenerality. ! By a path in a space X we mean a continuous map f:I X where I is the unit interval (cid:134)0;1(cid:135). The idea of continuously deforming a path, keeping its endpoints fixed, is made precise by the following definition. A homotopy of paths in X is a ! family f :I X, 0(cid:20)t(cid:20)1,suchthat t (1) The endpoints f (cid:132)0(cid:133) (cid:131) x and f (cid:132)1(cid:133) (cid:131) x t 0 t 1 f areindependentof t. 0 (2) Theassociatedmap F:I(cid:2)I ! X definedby x 0 x 1 f F(cid:132)s;t(cid:133)(cid:131)f (cid:132)s(cid:133) iscontinuous. 1 t Whentwopaths f and f areconnectedinthiswaybyahomotopy f ,theyaresaid 0 1 t tobehomotopic. Thenotationforthisis f ’f . 0 1 Example 1.1: Linear Homotopies. Anytwopaths f and f in Rn havingthesame 0 1 endpoints x and x arehomotopicviathehomotopy f (cid:132)s(cid:133)(cid:131)(cid:132)1−t(cid:133)f (cid:132)s(cid:133)(cid:130)tf (cid:132)s(cid:133). 0 1 t 0 1 Duringthishomotopyeachpoint f (cid:132)s(cid:133) travelsalongthelinesegmentto f (cid:132)s(cid:133) atcon- 0 1 stantspeed. Thisisbecausethelinethrough f (cid:132)s(cid:133) and f (cid:132)s(cid:133) islinearlyparametrized 0 1 as f (cid:132)s(cid:133)(cid:130)t(cid:134)f (cid:132)s(cid:133)−f (cid:132)s(cid:133)(cid:135) (cid:131) (cid:132)1−t(cid:133)f (cid:132)s(cid:133)(cid:130)tf (cid:132)s(cid:133), with the segment from f (cid:132)s(cid:133) to 0 1 0 0 1 0 f (cid:132)s(cid:133) coveredby t valuesintheintervalfrom 0 to 1. If f (cid:132)s(cid:133) happenstoequal f (cid:132)s(cid:133) 1 1 0 then this segment degenerates to a point and f (cid:132)s(cid:133) (cid:131) f (cid:132)s(cid:133) for all t. This occurs in t 0 particular for s (cid:131) 0 and s (cid:131) 1, so each f is a path from x to x . Continuity of t 0 1 ! thehomotopy f asamap I(cid:2)I Rn followsfromcontinuityof f and f sincethe t 0 1 algebraicoperationsofvectoradditionandscalarmultiplicationintheformulafor f t arecontinuous. This construction shows more generally that for a convex subspace X (cid:26) Rn, all pathsin X withgivenendpoints x and x arehomotopic, sinceif f and f liein 0 1 0 1 X thensodoesthehomotopy f . t", "rank": 0, "metadata": {"section": "34"}}
