{"chunk_id": "61-0", "text": "52 Chapter 1 The Fundamental Group (cid:10) (cid:11) identifiedviatheword a2c2. Bytheproposition, (cid:25) (cid:132)N (cid:133)(cid:25) a ;(cid:1)(cid:1)(cid:1);a jjjja2(cid:1)(cid:1)(cid:1)a2 . 1 g 1 g 1 g Thisabelianizestothedirectsumof Z with g−1 copiesof Z sinceintheabelian- 2 ization we can rechoose the generators to be a 1 ; (cid:1)(cid:1)(cid:1); a g−1 and a 1 (cid:130)(cid:1)(cid:1)(cid:1)(cid:130)a g , with 2(cid:132)a (cid:130)(cid:1)(cid:1)(cid:1)(cid:130)a (cid:133) (cid:131) 0. Hence N is not homotopy equivalent to N if g (cid:148) h, nor is 1 g g h N homotopyequivalenttoanyorientablesurface M . g h Hereisanotherapplicationoftheprecedingproposition: C orollary 1.28. For every group G there is a 2 dimensional cell complex X with G (cid:25) (cid:132)X (cid:133)(cid:25)G. 1 G (cid:10) (cid:11) Proof: Choose a presentation G (cid:131) g jjjjr . This exists since every group is a (cid:11) (cid:12) quotient of a free group, so the g ’s can be taken to be the generators of this free (cid:11) group with the r ’s generators of the kernel of the map from the free group to G. (cid:12) W Now construct X from S1 by attaching 2 cells e2 by the loops specified by the G (cid:11) (cid:11) (cid:12) words r . tu (cid:12) (cid:10) (cid:11) Example1.29. If G(cid:131) a jjjjan (cid:131)Z then X is S1 withacell e2 attachedbythemap n G z , zn,thinkingof S1 astheunitcirclein C. When n(cid:131)2 weget X (cid:131)RP2,butfor G n>2 thespace X isnotasurfacesincethereare n ‘sheets’of e2 attachedateach G pointofthecircle S1 (cid:26)X . Forexample,when n(cid:131)3 onecanconstructaneighbor- G hood N of S1 in X by taking the product of the G graph with the interval I, and then identifying thetwoendsofthisproductviaaone-thirdtwistas shown in the figure. The boundary of N consists ofasinglecircle,formedbythethreeendpointsof each crosssectionof N. Tocompletetheconstructionof X from N oneattaches G a disk along the boundary circle of N. This cannot be done in R3, though it can in R4. For n (cid:131) 4 one would use the graph instead of , with a one-quarter twist insteadofaone-thirdtwist. Forlarger n onewouldusean n pointed‘asterisk’and a1= twist. n Exercises 1. Showthatthefreeproduct G(cid:3)H ofnontrivialgroups G and H hastrivialcenter, andthattheonlyelementsof G(cid:3)H offiniteorderaretheconjugatesoffinite-order elementsof G and H. 2. Let X (cid:26)Rm betheunionofconvexopensets X ;(cid:1)(cid:1)(cid:1);X suchthat X \\X \\X (cid:148); 1 n i j k forall i;j;k. Showthat X issimply-connected. 3. Show that the complement of a finite set of points in Rn is simply-connected if n(cid:21)3.", "rank": 0, "metadata": {"section": "61"}}
