{"chunk_id": "3.1-0", "text": "Chapter 3 Homology In this chapter, we introduce homology, a fundamental concept in algebraic topology and, as the name suggests, a crucial element of the persistent homology pipeline in topological data analysis. Very informally, homology can be used to count the number of “holes” of a topological space, where holes can have any dimension. While you might have an intuition of what a 2-dimensional hole in a subspace of R2 might be, it is not at all clear what a 4-dimensional hole in some 7-dimensional space should be. The main idea of homology is to use algebra to talk about holes in an abstract setting. As we have already hinted at in the previous chapter, homology is an invariant of topological spaces preserved under homeomorphism and homotopy equivalence. We will manage to make this formal in Section 3.2.8. 3.1 Simplicial Complexes In order to define homology, we restrict our attention (for now) to special types of topo- logical spaces, namely simplicial complexes. We will see that this covers most natural spaces. Furthermore, homology for simplicial complexes is sufficient for all classical ap- plications in topological data analysis. We will briefly outline a more general definition later in the chapter. While simplicial complexes can be regarded as completely abstract objects, it is more intuitive to think of them in a geometric setting. The basic objects in a geometric simplicial complex are simplices: Definition3.1. A k-simplex in Rd is the convex hull of k+1 affinely independent points in Rd. A face of a simplex is the convex hull of a subset of its vertices. In particular, every face of a simplex is also a simplex. The empty set ∅ is also a face. The (k−1)-faces of a k-simplex are called facets. We say the dimension of a k-simplex is k. Definition 3.2. A geometric simplicial complex is a family K of simplices such that 25 Chapter 3. Homology Introduction to TDA • if τ ∈ K and σ is a face of τ, then σ ∈ K, and • for σ,τ ∈ K, their intersection σ∩τ is a face of both. Figure 3.1: Some examples of simplices: a point (0-dimensional), a line segment (1-dimensional), a triangle (2-dimensional) and a (filled) tetrahedron (3-dimensional). Figure 3.2: The left is a simplicial complex. The right is not, as the intersection of the two triangles is not a face of both of them. We say the dimension of a simplicial complex is the maximum dimension of any simplex. In these lecture notes, and for applications in topological data analysis in general, we may assume that all simplicial complexes are finite, that is, consisting of finitely many simplices. The way we defined them, simplicial complexes are geometric objects. To arrive at a purely combinatorial description, we can simply forget about the points in space spanning our simplices. Definition 3.3. An abstract simplicial complex K is a family of subsets of a vertex set V(K) such that if τ ∈ K and σ ⊆ τ, then σ ∈ K. A k-simplex here is a subset of k+1 elements, and thus again called k-dimensional. Note that 1-dimensional abstract simplicial complexes are exactly graphs: they are de- fined by a vertex set V and a system of two-element subsets of V, called edges. 26 Introduction to TDA 3.1. Simplicial Complexes From every geometric simplicial complex we get an abstract simplicial complex by simply taking the set of points as the vertex set and adding the correct subset for every simplex. For the inverse direction, we have to talk about geometric realizations: Definition 3.4. A geometric simplicial complex K is a", "rank": 0, "metadata": {"section": "3.1"}}
{"chunk_id": "3.1-1", "text": "V, called edges. 26 Introduction to TDA 3.1. Simplicial Complexes From every geometric simplicial complex we get an abstract simplicial complex by simply taking the set of points as the vertex set and adding the correct subset for every simplex. For the inverse direction, we have to talk about geometric realizations: Definition 3.4. A geometric simplicial complex K is a geometric realization of some abstract simplicial complex K′, if there is an embedding e : V(K′) → Rd that takes every (abstract) k-simplex {v ,...,v } in K′ to the (geometric) k-simplex that is the 0 k convex hull of e(v ),...,e(v ). 0 k Does every abstract simplicial complex have a geometric realization? Let us only consider 1-dimensional complexes (graphs) for now. We know that not all graphs admit a straight-line embedding in the plane, as only planar graphs admit any embedding, i.e., crossing-free drawing, in the plane. However, by placing the vertices in R3 in such a way that no four vertices lie on a common plane, we see that we can always find a geometric realization of a graph in R3. This generalizes to the following realization theorem: Theorem 3.5. Every k-dimensional simplicial complex has a geometric realization in R2k+1. Proof. Place the vertices as distinct points on the moment curve in R2k+1, which is the curve given by f(t) = (t,t2,...,t2k+1). This way, any 2k+2 of the placed points are affinely independent. Thus, any two faces with disjoint vertex sets will not intersect in the realization, showing that the realization is indeed an embedding. Sincewenowknowthatabstractandgeometricsimplicialcomplexescanbetranslated into one another, we will not make the distinction between them again and just use the word simplicial complex for both objects in the following. As a subset of Euclidean space, a simplicial complex thus also inherits the subspace topology from Rd, which allows us to view simplicial complexes as topological spaces. We usually write K for the simplicial complex as a family of sets, and |K| for the underlying topological space. Ontheotherhand,mosttopologicalspacesarenotsimplicialcomplexes. Forexample, the 2-sphere S2 is not a simplicial complex, as it is not defined by a vertex set and faces. However, the boundary of a tetrahedron is a simplicial complex, and it is homeomorphic to S2. Considering that we want to consider properties invariant under homeomorphism, we thus might as well work with the boundary of a tetrahedron instead of with S2. This motivates the following definition. Definition 3.6. A simplicial complex K is a triangulation of a topological space X, if |K| is homeomorphic to X. We say that a topological space X is triangulable if it has a triangulation. Triangulable spaces are nice for us, as we can replace them by simplicial complexes without any loss of topological information. Unfortunately, not all topological spaces are triangulable, but in this course we will not deal with such spaces. 27 Chapter 3. Homology Introduction to TDA While triangulations give us simplicial complexes from (triangulable) topological spaces, we would like to mention that one can also go the other way: many combi- natorial structures naturally give rise to (abstract) simplicial complexes, which can in turn be interpreted as topological spaces. Thus, we can use the machinery of topological methods for gaining insights into many combinatorial problems. This gives rise to a sub- field of combinatorics called topological combinatorics, where the topology of simplicial complexes associated to combinatorial objects is studied. Let us give some examples of such simplicial complexes. • As we have already discussed, graphs are equivalent to 1-dimensional simplicial complexes. • Given a graph G = (V,E), we can define a simplicial complex on V by including", "rank": 1, "metadata": {"section": "3.1"}}
{"chunk_id": "3.1-2", "text": "to a sub- field of combinatorics called topological combinatorics, where the topology of simplicial complexes associated to combinatorial objects is studied. Let us give some examples of such simplicial complexes. • As we have already discussed, graphs are equivalent to 1-dimensional simplicial complexes. • Given a graph G = (V,E), we can define a simplicial complex on V by including a face {v ,...,v } whenever these vertices form a clique in G. This is called the 1 k clique complex of G. • For a poset (P,⩽), the set of all chains of P forms a simplicial complex, giving rise to the order topology. In topological data analysis, a highly relevant example is the nerve, which records the intersection pattern of a collection of sets: Definition 3.7. For a finite collection U of sets, its nerve N(U) is a simplicial complex on the vertex set U that contains u ,...,u as a k-simplex iff u ∩...∩u ̸= ∅. 0 k 0 k While the nerve can be seen as a purely combinatorial object describing the inter- section pattern of U, it is also interesting to study its topology. If the considered sets in U are subsets of some topological space X, there is a very strong characterization of the topology of N(U), if the intersections of sets in U are “well-behaved”. Definition 3.8. Let X be a topological space, and U a finite family of closed subsets of X. We call U a good cover, if every non-empty intersection of sets in U is contractible. Under these conditions on the sets we get the following, very powerful theorem, which allows us to relate complex spaces (unions of sets) with a much simpler simplicial complex, namely the nerve of these sets. For a proof of this we refer to any textbook on algebraic topology, for example the one by Hatcher [2]. Theorem3.9(Nerve theorem). If U is a good cover, then |N(U)| is homotopy equivalent (cid:83) to U. The nerve theorem also holds if all the sets in U are open with contractible intersec- tions, but it may fail if some sets in U are closed, and some open: We can have an open and a closed set which do not intersect, but whose union is connected. Now that we have defined simplicial complexes and considered some examples, we once again want to study maps between them. The study of simplicial complexes and the maps between them, as we will define them, is called combinatorial topology. 28 Introduction to TDA 3.1. Simplicial Complexes Definition 3.10. A vertex map f : V(K ) → V(K ) maps vertices in K to vertices in K . 1 2 1 2 Definition 3.11. A map f : K → K is called simplicial if it can be described by a 1 2 vertex map g : V(K ) → V(K ) such that for every simplex {v ,...,v } we have 1 2 0 k f({v ,...,v }) = {g(v ),...,g(v )}. Since f maps to K we must have that f({v ,...,v }) 0 k 0 k 2 0 k is a simplex in K . A simplicial map can also be seen as a map on the underlying 2 spaces f : |K | → |K |. 1 2 Note that for a map to be simplicial, we do not require that {f(v ),...,f(v )} is also 0 k a k-dimensional simplex, we merely require that it is a simplex of K . It is thus possible 2 that distinct vertices of K are mapped to the same vertex of K .", "rank": 2, "metadata": {"section": "3.1"}}
{"chunk_id": "3.1-3", "text": "|K | → |K |. 1 2 Note that for a map to be simplicial, we do not require that {f(v ),...,f(v )} is also 0 k a k-dimensional simplex, we merely require that it is a simplex of K . It is thus possible 2 that distinct vertices of K are mapped to the same vertex of K . 1 2 Recall that simplicial complexes are topological spaces, so there is also the notion of continuous maps between them. It can be shown that every simplicial map is continuous. Exercise 3.12. Let f : |K | → |K | be a simplicial map. Show that f is continuous. 1 2 On the other hand, continuous maps in general do not need to map vertices to vertices, and are thus not simplicial. Simplicial maps are therefore more restrictive than continuous maps. However, the difference of the two concepts is smaller than one might think at first glance. Fact 3.13. Every continuous map f : |K | → |K | can be approximated arbitrarily 1 2 closely by simplicial maps on appropriate subdivisions of K and K . 1 2 This shows that we can consider simplicial maps to be the analogue of continu- ous maps in the world of simplicial complexes. This begs the question whether other definitions from topology, such as homotopies or deformation retracts, have simplicial analogues. As we will see in the next few definitions, they do. Definition 3.14. Two simplicial maps f ,f : K → K are contiguous if for every 1 2 1 2 simplex σ ∈ K we have that f (σ)∪f (σ) is a simplex in K . 1 1 2 2 This is the simplicial analogue of two continuous maps being homotopic. We can thus show two simplicial complexes to be homotopy equivalent by providing two simplicial maps f : K → K and g : K → K such that g◦f is contiguous with the identity map 1 2 2 1 on K and f◦g is contiguous with the identity map on K . 1 2 Definition 3.15. A face of a simplicial complex is called free, if it is non-maximal (not inclusion-maximal) and contained in a unique maximal face. Note that every face that is a superset of a free face is either a maximal face or also free. Definition 3.16. A collapse is the operation of removing all faces γ that are a superset of some fixed free face τ (including τ itself). A simplicial complex is collapsible if there is a sequence of collapses leading to a single point. 29 Chapter 3. Homology Introduction to TDA A collapse can be written as a deformation retract. Thus, a simplicial complex that is collapsible is contractible, and we consider collapses to be the simplicial analogue of deformation retracts. You might wonder whether every contractible simplicial complex is also collapsi- ble. We will see that this not hold: A good counterexample for this is Bing’s house with two rooms, see Figure 3.3. In any triangulation of it, there are no free faces: As a 2-dimensional space, there are only vertices, edges and triangles. We only have to check edges, since triangles are maximal, and vertices are part of edges which are never maximal. Every edge is incident to at least two triangles (there are no edges on the “boundary”), and thus they are not free. Since we have no free faces, it is not collapsible. Figure 3.3: Bing’s house with two rooms. Image taken from [2]. On the other hand, Bing’s house is contractible: both Bing’s house and a point", "rank": 3, "metadata": {"section": "3.1"}}
{"chunk_id": "3.1-4", "text": "are never maximal. Every edge is incident to at least two triangles (there are no edges on the “boundary”), and thus they are not free. Since we have no free faces, it is not collapsible. Figure 3.3: Bing’s house with two rooms. Image taken from [2]. On the other hand, Bing’s house is contractible: both Bing’s house and a point are deformation retracts of a 3-dimensional ball, and thus by Fact 2.24 they are homotopy equivalent. For a visual sketch of the deformation retract from a 3-dimensional ball to Bing’s house, see Figure 3.4. To summarize, the connection between simplicial complexes and topological spaces is that every simplicial complex defines a topological space, since we can consider a geomet- ricembedding, andtheunderlyingspaceoftheembeddinginheritsthesubspacetopology from Rd. On the other hand, some topological spaces (the triangulable ones) can be ex- pressed by simplicial complexes. As for maps, every simplicial map is continuous. On the other hand, continuous maps between simplicial complexes can be approximated by simplicial maps between subdivisions of the simplicial complexes. A similar property holds between homotopic maps and contiguous maps, as well as between deformation retracts and collapses. In general, we can say that the terms in combinatorial topol- ogy are special cases of their “continuous” counterparts, and if we consider triangulable spaces, the continuous terms can be approximated in some way by their combinatorial counterparts. The terms can thus be considered to be equivalent. Table 3.1 summarizes the equivalent words in “continuous topology” on triangulable spaces and in combinatorial topology on simplicial complexes. 30", "rank": 4, "metadata": {"section": "3.1"}}
