{"chunk_id": "22-0", "text": "Two Criteria for Homotopy Equivalence Chapter 0 13 is the following. We start with a space X and another space X that we wish to 0 1 attach to X by identifying the points in a subspace A (cid:26) X with points of X . The 0 1 0 ! data needed to do this is a map f:A X , for then we can form a quotient space 0 of X qX by identifying each point a 2 A with its image f(cid:132)a(cid:133) 2 X . Let us de- 0 1 0 notethisquotientspaceby X t X ,thespace X with X attachedalong A via f. 0 f 1 0 1 When (cid:132)X ;A(cid:133) (cid:131) (cid:132)Dn;Sn−1(cid:133) we have the case of attaching an n cell to X via a map 1 0 f:Sn−1 ! X . 0 Mappingcylindersareexamplesofthisconstruction,sincethemappingcylinder ! M ofamap f:X Y isthespaceobtainedfrom Y byattaching X(cid:2)I along X(cid:2)f1g f via f. Closelyrelatedtothemappingcylinder M isthemappingcone C (cid:131)Y t CX f f f where CX isthecone (cid:132)X(cid:2)I(cid:133)=(cid:132)X(cid:2)f0g(cid:133) andweattachthisto Y along X(cid:2)f1g via the identifications (cid:132)x;1(cid:133) (cid:24) f(cid:132)x(cid:133). For exam- CX ple,when X isasphere Sn−1 themappingcone C isthespace f obtained from Y by attaching an n cell via f:Sn−1 ! Y. A Y mappingcone C canalsobeviewedasthequotient M =X of f f themappingcylinder M withthesubspace X (cid:131)X(cid:2)f0g collapsedtoapoint. f Ifonevariesanattachingmap f byahomotopy f , onegetsafamilyofspaces t whoseshapeisundergoingacontinuouschange,itwouldseem,andonemightexpect thesespacesalltohavethesamehomotopytype. Thisisoftenthecase: ! If (cid:132)X ;A(cid:133) isaCWpairandthetwoattachingmaps f;g:A X arehomotopic,then 1 0 X t X ’X t X . 0 f 1 0 g 1 Againletusdefertheproofandlookatsomeexamples. Example0.11. LetusrederivetheresultinExample0.8thataspherewithtwopoints identified is homotopy equivalent to S1_S2. The sphere withtwopointsidentifiedcanbeobtainedbyattaching S2 S2 to S1 byamapthatwrapsaclosedarc A in S2 around S1, A S1 asshowninthefigure. Since A iscontractible,thisattach- ingmapishomotopictoaconstantmap,andattaching S2 to S1 via a constant map of A yields S1_S2. The result then follows since (cid:132)S2;A(cid:133) is a CW pair, S2 being obtained from A by attaching a 2 cell. Example 0.12. In similar fashion we can see that the necklace in Example 0.9 is homotopy equivalent to the wedge sum of a circle with n 2 spheres. The necklace can be obtained from a circle by attaching n 2 spheres along arcs, so the necklace is homotopy equivalent to the space obtained by attaching n 2 spheres to a circle at points. Then we can slide these attaching points around the circle until they all coincide,producingthewedgesum. Example0.13. Hereisanapplicationoftheearlierfactthatcollapsingacontractible subcomplex is a homotopy equivalence: If (cid:132)X;A(cid:133) is a CW pair, consisting of a cell", "rank": 0, "metadata": {"section": "22"}}
