{"chunk_id": "31-0", "text": "22 Chapter 1 The Fundamental Group Consider two linked circles A and B in R3, as shown in the figure. Our experience with actual links and chains tells us that since the two circles are linked, it is impossi- ble to separate B from A by any continuous motion of B, A B such as pushing, pulling, or twisting. We could even take B to be made of rubber or stretchable string and allow completely general continu- ous deformations of B, staying in the complement of A at all times, and it would still be impossible to pull B off A. At least that is what intuition suggests, and the fundamentalgroupwillgiveawayofmakingthisintuitionmathematicallyrigorous. Instead of having B link with A just once, we could makeitlinkwithAtwoormoretimes,asinthefigurestothe right. Asafurthervariation,byassigninganorientationtoB wecanspeakof B linking A apositiveoranegativenumber A B 2 oftimes,saypositivewhen B comesforwardthrough A and negative for the reverse direction. Thus for each nonzero integer n wehaveanorientedcircle B linking A n times, n whereby‘circle’wemeanacurvehomeomorphictoacircle. A B To complete the scheme, we could let B be a circle not ¡3 0 linkedto A atall. Now,integersnotonlymeasurequantity,buttheyformagroupunderaddition. Can the group operation be mimicked geometrically with some sort of addition op- eration on the oriented circles B linking A? An oriented circle B can be thought of as a path traversed in time, starting and ending at the same point x , which we 0 can choose to be any point on the circle. Such a path starting and ending at the 0 same point is called a loop. Two different loops B and B both starting and end- ing at the same point x can be ‘added’ to form a new loop B(cid:130)B 0 that travels first 0 0 0 around B,thenaround B . Forexample,if B and B areloopseachlinking A oncein 1 1 the positive direction, thentheirsum B (cid:130)B 0 1 1 B B 1 2 is deformable to B , 2 x x 0 0 linking A twice. Simi- 0 B larly, B 1 (cid:130)B−1 can be A 1 A deformed to the loop B B , unlinked from A. 1 0 x x Moregenerally,wesee 0 0 B that B (cid:130) B can be A ¡1 A B 0 m n deformedto B m(cid:130)n for arbitraryintegers m and n. Notethatinformingsumsofloopsweproduceloopsthatpassthroughthebase- pointmorethanonce. Thisisonereasonwhyloopsaredefinedmerelyascontinuous", "rank": 0, "metadata": {"section": "31"}}
