{"chunk_id": "5.3-0", "text": "Chapter 5. Simplicial Complexes on Point Clouds Introduction to TDA BasedontheDelaunaytriangulation, wedefinetheAlpha complex byparameterizing using a radius as follows: Definition 5.10. Given a finite point set P ⊂ Rd in general position as well as a real number radius r > 0, the Alpha complex Delr(P) consists of all simplices σ ∈ Del(P) for which the circumscribing ball of σ has radius at most r. The following fact provides us with an alternative definition of the Alpha complex: Fact 5.11. The Alpha complex Delr(P) is the nerve of the sets B(p,r) ∩ V for all p p ∈ P. Since the Alpha complex is a subset of the Delaunay triangulation (and for large enough radius is equal to the Delaunay triangulation), it also has complexity O(n⌈d/2⌉). Further, the above fact together with the Nerve theorem implies that the Alpha complex Delr(P) is homotopy equivalent to the Čech complex Cr(P). Exercise 5.12. Is the following true or false? Consider a point set P ⊂ R2 in gen- eral position and a radius r > 0. Then the Alpha complex (with radius r) is the intersection of the Čech complex (with radius r) with the Delaunay triangulation. 5.3 Subsample Complexes For many applications, the Alpha complex is still too large. It is further expensive to compute, as computing a Delaunay triangulation in Rd takes O(n⌈d/2⌉) time. Sparser complexes can be constructed by looking at subsamples of the data, and relating the rest of the data to these subsamples. In the following, we will discuss two examples of complexes based on this idea. Definition5.13. Given a finite point set Q and a point set P ⊃ Q in some metric space, we say that a simplex σ ⊆ Q is weakly witnessed by x ∈ P \\ Q, if d(q,x) ⩽ d(p,x) for every q ∈ σ and p ∈ Q\\σ. Note that the set of weakly witnessed simplices is not downwards closed. We thus define a simplicial complex by requiring that all faces are weakly witnessed: Definition 5.14. The Witness complex W(Q,P) is the collection of simplices on Q for which every face is weakly witnessed by some point in P\\Q. Notethatifwetakethemetricspace Rd andweletP bethewhole Rd,then W(Q,P) = Del(Q), and by definition we thus get in general that W(Q,P) ⊆ Del(Q). To arrive at a filtration, we again have to introduce a parameter r > 0: Definition 5.15. Given a finite point set Q and a point set P ⊃ Q in some metric space as well as a real number radius r > 0, the parameterized Witness complex Wr(Q,P) is a simplicial complex on Q defined as follows: Every point p ∈ Q defines a vertex in Wr(Q,P). Further, an edge pq is in Wr(Q,P) if it is weakly witnessed by x ∈ P \\ Q and d(p,x) ⩽ r and d(q,x) ⩽ r. A simplex σ ⊆ Q is in Wr(Q,P) if all its edges are. 58 Introduction to TDA 5.3. Subsample Complexes Note that from this definition it is not guaranteed that the parameterized Witness complex is a subcomplex of the Witness complex. The idea of the parameterized Witness complex is that it should approximate the Vietoris-Rips complex on P. There are theoretical guarantees about this approximation for manifolds of dimension at most 2, but the parameterized witness complex may fail to capture the topology of manifolds in dimension 3 and above. Exercise 5.16. Show that W(Q,P) ⊆ W(Q,P′) for P ⊆ P′. On the other hand, give an example of point sets Q ⊆ Q′ and P for which W(Q,P) ̸⊆ W(Q′,P). Let us now consider a second", "rank": 0, "metadata": {"section": "5.3"}}
{"chunk_id": "5.3-1", "text": "of dimension at most 2, but the parameterized witness complex may fail to capture the topology of manifolds in dimension 3 and above. Exercise 5.16. Show that W(Q,P) ⊆ W(Q,P′) for P ⊆ P′. On the other hand, give an example of point sets Q ⊆ Q′ and P for which W(Q,P) ̸⊆ W(Q′,P). Let us now consider a second subsample complex, the graph induced complex. Definition 5.17. Given two finite point sets Q,P in Rd, as well as a graph G(P) with vertices in P, we define v : P → Q by sending each point in P to its closest point in Q. The graph induced complex G(Q,G(P)) contains a simplex σ = {q ,...,q } ⊂ Q 0 k if and only if there is a clique {p ,...,p } in G(P) for which v(p ) = q . 0 k i i We again parameterize this: Definition5.18. Let Gr(P) be the graph on P where pq is an edge if and only if d(p,q) ⩽ 2r. The parameterized graph induced complex Gr(Q,P) is defined as G(Q,Gr(P)). This complex again has theoretical guarantees of approximating the Vietoris-Rips complex on P∪Q. Exercise 5.19. Let P,Q be point sets and G(P) a graph with P as its vertex set. Let v : P → Q be the map sending each point of P to its closest point of Q (assume that this closest point is always unique). Let C be the clique complex of G(P) (the complex which includes a simplex iff its corresponding vertices in G(P) form a clique). Show that v extends to a simplicial map ¯v : C → G(Q,G(P)). Also show that any simplicial complex K with V(K) = Q for which v has a simplicial extension must contain G(Q,G(P)). Questions 16. What are the Čech and Vietoris-Rips complexes? Give the definitions, discuss their size and theoretical guarantees, and how they are related. 17. What are the Delaunay and Alpha complexes? Give the definitions, discuss their size and theoretical guarantees, and how they are related. 18. What is the Witness complex? State the Definition and describe how it relates to the non-sparse complexes. 19. What is the Graph induced complex? State the Definition and describe how it relates to the non-sparse complexes. 59", "rank": 1, "metadata": {"section": "5.3"}}
