{"chunk_id": "69-0", "text": "60 Chapter 1 The Fundamental Group morphismbetweencoveringspacesof X isjustagraphisomorphismthatpreserves the labeling and orientations of edges. Thus the covering spaces in (3) and (4) are isomorphic,butnotbyanisomorphismpreservingbasepoints,sothetwosubgroups of (cid:25) (cid:132)X;x (cid:133) corresponding to these covering spaces are distinct but conjugate. On 1 0 theotherhand,thetwocoveringspacesin(5)and(6)arenotisomorphic,thoughthe graphsarehomeomorphic,sothecorrespondingsubgroupsof (cid:25) (cid:132)X;x (cid:133) areisomor- 1 0 phicbutnotconjugate. Some of the covering spaces (1)–(14) are more symmetric than others, where by a ‘symmetry’ we mean an automorphism of the graph preserving the labeling and orientations. Themostsymmetriccoveringspacesarethosehavingsymmetriestaking anyonevertexontoanyother. Theexamples(1),(2),(5)–(8),and(11)aretheoneswith thisproperty. Weshallseethatacoveringspaceof X hasmaximalsymmetryexactly whenthecorrespondingsubgroupof (cid:25) (cid:132)X;x (cid:133) isanormalsubgroup,andinthiscase 1 0 the symmetries form a group isomorphic to the quotient group of (cid:25) (cid:132)X;x (cid:133) by the 1 0 normal subgroup. Since every group generated by two elements is a quotient group of Z(cid:3)Z,thisimpliesthateverytwo-generatorgroupisthesymmetrygroupofsome coveringspaceof X. Lifting Properties e! Coveringspacesaredefinedinfairlygeometricterms,asmaps p:X X thatare localhomeomorphismsinaratherstrongsense. Butfromtheviewpointofalgebraic topology, the distinctive feature of covering spaces is their behavior with respect to liftingofmaps. RecalltheterminologyfromtheproofofTheorem1.7: Aliftofamap f:Y ! X isamap f e :Y ! X e suchthat pf e(cid:131)f. Wewilldescribethreespeciallifting propertiesofcoveringspaces,andderiveafewapplicationsofthese. First we have the homotopy lifting property, or covering homotopy property, asitissometimescalled: P roposition 1.30. Given a covering space p:X e! X, a homotopy f :Y ! X, and a t e !e e !e e map f :Y X lifting f ,thenthereexistsauniquehomotopy f :Y X of f that 0 0 t 0 lifts f . t ! Proof: For the covering space p:R S1 this is property (c) in the proof of Theo- rem1.7,andtheproofthereappliestoanycoveringspace. tu Taking Y to be a point gives the path lifting property for a covering space p:X e! X, which says that for each path f:I ! X and each lift xe of the starting 0 point f(cid:132)0(cid:133)(cid:131)x thereisauniquepath f e :I ! X e lifting f startingat xe . Inparticular, 0 0 the uniqueness of lifts implies that every lift of a constant path is constant, but this couldbededucedmoresimplyfromthefactthat p −1(cid:132)x (cid:133) hasthediscretetopology, 0 bythedefinitionofacoveringspace.", "rank": 0, "metadata": {"section": "69"}}
