{"chunk_id": "13-0", "text": "4 Chapter 0 Some Underlying Geometric Notions Aspacehavingthehomotopytypeofapointiscalledcontractible. Thisamounts torequiringthattheidentitymapofthespacebenullhomotopic,thatis,homotopic toaconstantmap. Ingeneral,thisisslightlyweakerthansayingthespacedeforma- tion retracts to a point; see the exercises at the end of the chapter for an example distinguishingthesetwonotions. Letusdescribenowanexampleofa 2 dimensionalsubspaceof R3,knownasthe housewithtworooms,whichiscontractiblebutnotinanyobviousway. Tobuildthis = [ [ space,startwithaboxdividedintotwochambersbyahorizontalrectangle,wherebya ‘rectangle’wemeannotjustthefouredgesofarectanglebutalsoitsinterior. Accessto thetwochambersfromoutsidetheboxisprovidedbytwoverticaltunnels. Theupper tunnelismadebypunchingoutasquarefromthetopoftheboxandanothersquare directly below it from the middle horizontal rectangle, then inserting four vertical rectangles, the walls of the tunnel. This tunnel allows entry to the lower chamber fromoutsidethebox. Thelowertunnelisformedinsimilarfashion,providingentry to the upper chamber. Finally, two vertical rectangles are inserted to form ‘support walls’ for the two tunnels. The resulting space X thus consists of three horizontal pieceshomeomorphictoannuliplusalltheverticalrectanglesthatformthewallsof thetwochambers. To see that X is contractible, consider a closed \" neighborhood N(cid:132)X(cid:133) of X. This clearly deformation retracts onto X if \" is sufficiently small. In fact, N(cid:132)X(cid:133) is the mapping cylinder of a map from the boundary surface of N(cid:132)X(cid:133) to X. Less obvious is the fact that N(cid:132)X(cid:133) is homeomorphic to D3, the unit ball in R3. To see this, imagine forming N(cid:132)X(cid:133) from a ball of clay by pushing a finger into the ball to createtheuppertunnel,thengraduallyhollowingoutthelowerchamber,andsimilarly pushingafingerintocreatethelowertunnelandhollowingouttheupperchamber. ! Mathematically,thisprocessgivesafamilyofembeddings h :D3 R3 startingwith t theusualinclusion D3>R3 andendingwithahomeomorphismonto N(cid:132)X(cid:133). Thus we have X ’ N(cid:132)X(cid:133) (cid:131) D3 ’ point, so X is contractible since homotopy equivalenceisanequivalencerelation. Infact, X deformationretractstoapoint. For ! iff isadeformationretractionoftheballN(cid:132)X(cid:133)toapointx 2X andifr:N(cid:132)X(cid:133) X t 0 isaretraction,forexampletheendresultofadeformationretractionof N(cid:132)X(cid:133) to X, thentherestrictionofthecomposition rf to X isadeformationretractionof X to t x . However, it is quite a challenging exercise to see exactly what this deformation 0 retractionlookslike.", "rank": 0, "metadata": {"section": "13"}}
