{"chunk_id": "27-0", "text": "18 Chapter 0 Some Underlying Geometric Notions Exercises 1. Construct an explicit deformation retraction of the torus with one point deleted onto a graph consisting of two circles intersecting in a point, namely, longitude and meridiancirclesofthetorus. 2. Constructanexplicitdeformationretractionof Rn−f0g onto Sn−1. ! ! 3. (a) Show that the composition of homotopy equivalences X Y and Y Z is a ! homotopy equivalence X Z. Deduce that homotopy equivalence is an equivalence relation. ! (b)Showthattherelationofhomotopyamongmaps X Y isanequivalencerelation. (c)Showthatamaphomotopictoahomotopyequivalenceisahomotopyequivalence. 4. A deformation retraction in the weak sense of a space X to a subspace A is a ! homotopy f :X X such that f (cid:131) 11, f (cid:132)X(cid:133) (cid:26) A, and f (cid:132)A(cid:133) (cid:26) A for all t. Show t 0 1 t > thatif X deformationretractsto A inthisweaksense,thentheinclusion A X is ahomotopyequivalence. 5. Show that if a space X deformation retracts to a point x 2 X, then for each neighborhood U of x in X there exists a neighborhood V (cid:26) U of x such that the > inclusionmap V U isnullhomotopic. 6. (a)LetX bethesubspaceofR2 consistingofthehorizontalsegment (cid:134)0;1(cid:135)(cid:2)f0g togetherwithalltheverticalsegments frg(cid:2)(cid:134)0;1−r(cid:135) for r a rational number in (cid:134)0;1(cid:135). Show that X deformation retracts to anypointinthesegment (cid:134)0;1(cid:135)(cid:2)f0g,butnottoanyotherpoint. [See theprecedingproblem.] (b)Let Y bethesubspaceof R2 thatistheunionofaninfinitenumberofcopiesof X arrangedasinthefigurebelow. Showthat Y iscontractiblebutdoesnotdeformation retractontoanypoint. (c) Let Z be the zigzag subspace of Y homeomorphic to R indicated by the heavier line. Show there is a deformation retraction in the weak sense (see Exercise 4) of Y onto Z,butnotruedeformationretraction. 7. Fill in the details in the following construction from [Edwards 1999] of a compact space Y (cid:26) R3 with the samepropertiesasthespace Y inExercise6,thatis, Y is contractible but does not deformation retract to any point. To begin, let X be the union of an infinite se- quenceofconesontheCantorsetarrangedend-to-end, X Y asinthefigure. Next,formtheone-pointcompactifica- tion of X(cid:2)R. This embeds in R3 as a closed disk with curved ‘fins’ attached along", "rank": 0, "metadata": {"section": "27"}}
