{"chunk_id": "10.2-0", "text": "Introduction to TDA 10.2. Mapper for Medical Data Figure 10.5: The barcodes including the medium density part of the data. consider the PCA, depicted in Figure 10.6, we see a cross in the middle of the circle seen previously. However, this only shows four circles! Where is the fifth one? Most likely some cycle is orthogonal to the projection chosen by the PCA. The interpretation picked from this situation is that the dataset consists of three great circles of some S2 that are all orthogonal. We can interpret these three circles as the circle described above, a circle describing different translations of vertical edges, and one circle describing translations of horizontal edges. This is depicted in Figure 10.7. However, if we finally also include points from the lowest density parts of the data, we get the barcodes depicted in Figure 10.8. We start seeing some feature in the persistent 2-homology, and reduce β to most likely 2 again. How can this space look? It must 1 somehow include the three circles found before. We can embed the circles as in the Figure 10.9, indicating that the space is a Klein bottle. Clearly, this is not a proof. The persistent homology computed agrees with the Klein bottle, but it would also agree with a torus. To give more evidence, we could for example compute persistent homology over a different field such as , with which we Z 3 can distinguish between a Klein bottle and a torus. It turns out that the space is indeed a Klein bottle, as is shown in the work of Carlsson et al. [1]. 10.2 Mapper for Medical Data The following application comes from the original paper describing the Mapper approach [6]. Thedatacomesfromadiabetesstudyin1979on145participants, withsixquantities 107 Chapter 10. Applications Introduction to TDA Figure 10.6: Using PCA on the high and medium density part of the data. Figure 10.7: The interpretation of the high and medium density part of the data. 108 Introduction to TDA 10.2. Mapper for Medical Data Figure 10.8: The barcodes for the entire data. Figure 10.9: The interpretation of the entire data. 109 Chapter 10. Applications Introduction to TDA Figure 10.10: The classical illustration of the diabetes data set. measured per participant: age, relative weight, fasting plasma glucose, area under the plasma glucose curve for the three hour glucose tolerance test (OGTT), area under the plasma insulin curve for the (OGTT), and steady state plasma glucose response. After applying various classical methods, the original study came up with a picture containing a blob of healthy people, with two strains coming out of this blob, called type 1 and type 2 diabetes [4]. See Figure 10.10 for their illustration. The same behaviour can be automatically detected using Mapper, as showcased in [6]. As the filter function they used a density estimator for each point. They created two different outputs, one for 3 and one for 4 intervals, always with a 50% overlap. In the output of Mapper depicted in Figure 10.11 you also see areas of large density, with 2 flares going out of it. The Mapper approach has later also been applied to genomic data from a breast cancer study [7] by Nicolau, Levine and Carlsson [5]. This data is very high dimensional, each patient defines a data point in R262. As a filter function they used the distance to some baseline healthy tissue. The output presented in their paper is depicted in Figure 10.12. The strain labelled c-MYB+ tumors corresponds to a type of tumor which has previously not been classified, where the other strains confirm the strains of breast cancer known previously.", "rank": 0, "metadata": {"section": "10.2"}}
{"chunk_id": "10.2-1", "text": "patient defines a data point in R262. As a filter function they used the distance to some baseline healthy tissue. The output presented in their paper is depicted in Figure 10.12. The strain labelled c-MYB+ tumors corresponds to a type of tumor which has previously not been classified, where the other strains confirm the strains of breast cancer known previously. 110 Introduction to TDA 10.2. Mapper for Medical Data Figure 10.11: The output of Mapper on the diabetes data set. Figure 10.12: The output of Mapper on the breast cancer data set. 111", "rank": 1, "metadata": {"section": "10.2"}}
