{"chunk_id": "7.3.2-0", "text": "Chapter 7. Reeb Graphs and Mapper Introduction to TDA • f(β(y)) = g(y)+ϵ for all y ∈ T 2 • β◦α(x) = x2ϵ for all x ∈ T 1 • α◦β(y) = y2ϵ for all y ∈ T . 2 The interleaving distance between merge trees d (T ,T ) can now be defined as I 1 2 the infimum of all ϵ such that T and T are ϵ-compatible. Show that d (T ,T ) = 1 2 I 1 2 d (T ,T ). FD 1 2 Note: we technically only defined d for Reeb graphs. You can simply consider a FD merge tree to be the Reeb graph of itself (with regards to the same filter function). 7.3 Mapper Reeb graphs lose a lot of information, since they at most retain some 1-dimensional holes, butnolargerholes. TogeneralizeReebgraphsfurther, westartlookingatneighborhoods instead of levelsets, which will then lead to the Mapper algorithm. 7.3.1 An Approximation of the Reeb Graph To begin, we consider the 1-dimensional case, and try to find an approximation of the Reeb graph. Instead of looking at pre-images of points, we will now look at pre-images of intervals. Let U = {U } be an open cover of R (i.e., a collection of open sets whose α α∈A union is R ). As always, we consider a function f : X → R . For each f−1(U ), we consider α a partition into path-connected components, i.e., f−1(U ) = (cid:83) V . We then look at f∗(U) := {V }, the set of all V we get over all α. Our α object β of ∈B inαter β est is the nerve of β β this family, i.e., N(f∗(U)). If we take sufficiently nice functions, and sufficiently fine covers, then N(f∗(U)) is isomorphic to R . f 7.3.2 Topological Mapper We can generalize this idea to maps to arbitrary spaces. Definition 7.29. Let X,Z be topological spaces. Then we call f : X → Z well-behaved if for all path-connected open sets U ⊆ Z, f−1(U) has finitely many path-connected components. Definition 7.30 (Mapper). Let f : X → Z be well-behaved, and U be a (finite) open cover of Z. Then the Mapper is defined as M(U,f) := N(f∗(U)). As an example, we look at X being the boundary of the 3-cube [0,1]3. We then also look at Z = R2 spanned by the x- and y-axis, with f : X → Z being the projection onto 1 1 1 this plane. Furthermore, we look at Z = R , spanned by just the x-axis, and f : X → Z 2 2 2 being again the projection. 84", "rank": 0, "metadata": {"section": "7.3.2"}}
