{"chunk_id": "6-0", "text": "This book was written to be a readable introduction to algebraic topology with rather broad coverage of the subject. The viewpoint is quite classical in spirit, and stays well within the confines of pure algebraic topology. In a sense, the book could have been written thirty or forty years ago since virtually everything in it is at least that old. However, the passage of the intervening years has helped clarify what are themostimportantresultsandtechniques. Forexample,CWcomplexeshaveproved over time to be the most natural class of spaces for algebraic topology, so they are emphasizedheremuchmorethaninthebooksofanearliergeneration. Thisempha- sisalsoillustratesthebook’sgeneralslanttowardsgeometric, ratherthanalgebraic, aspectsofthesubject. Thegeometryofalgebraictopologyissopretty,itwouldseem apitytoslightitandtomissalltheintuitionitprovides. Attheelementarylevel,algebraictopologyseparatesnaturallyintothetwobroad channels of homology and homotopy. This material is here divided into four chap- ters, roughly according to increasing sophistication, with homotopy split between Chapters 1 and 4, and homology and its mirror variant cohomology in Chapters 2 and3. Thesefourchaptersdonothavetobereadinthisorder,however. Onecould begin with homology and perhaps continue with cohomology before turning to ho- motopy. Intheotherdirection,onecouldpostponehomologyandcohomologyuntil afterpartsofChapter4. Ifthislatterstrategyispushedtoitsnaturallimit,homology and cohomology can be developed just as branches of homotopy theory. Appealing asthisapproachisfromastrictlylogicalpointofview,itplacesmoredemandsonthe reader,andsincereadabilityisoneofthefirstprioritiesofthebook,thishomotopic interpretationofhomologyandcohomologyisdescribedonlyafterthelattertheories havebeendevelopedindependentlyofhomotopytheory. Preceding the four main chapters there is a preliminary Chapter 0 introducing some of the basic geometric concepts and constructions that play a central role in both the homological and homotopical sides of the subject. This can either be read beforetheotherchaptersorskippedandreferredbacktolaterforspecifictopicsas theybecomeneededinthesubsequentchapters. Eachofthefourmainchaptersconcludeswithaselectionofadditionaltopicsthat thereadercansampleatwill,independentofthebasiccoreofthebookcontainedin theearlierpartsofthechapters. Manyoftheseextratopicsareinfactratherimportant in the overall scheme of algebraic topology, though they might not fit into the time", "rank": 0, "metadata": {"section": "6"}}
