{"chunk_id": "2.1-0", "text": "Chapter 2 Mathematical Foundations 2.1 Topological Spaces Topology, sometimes also called “rubber-sheet geometry”, stems from the Greek words tópos, which means place or locality, and lógos, which means study. So, it can be roughly translated as the study of places and shapes. Indeed, as the name rubber-sheet geometry suggests, topology studies similar objects as geometry, but in a setting where properties are preserved under continuous deformations like stretching and twisting. In particular, these properties should be independent of metrics, but we would still like to have ways to describe proximity between points. We do this by looking at open neighborhoods of points. The core objects in topology are topological spaces, whose definition captures the system of open neighborhoods of the points in the space. Definition 2.1. A topological space (X,T) is a set of points X, with a system T of subsets of X (called the topology on X), such that 1. ∅ ∈ T, X ∈ T. (cid:83) 2. For every S ⊆ T, S ∈ T. (cid:84) 3. For every finite S ⊆ T, S ∈ T. The sets in T are called the open sets of X. For example, setting X = R2 and T to be the collection of open subsets (in the geometric/calculus sense) of R2, we can check that (X,T) is a topological space. A further example of a topological space is (X,2X), where 2X denotes the family of all subsets of X. This is called a discrete topology. Another example is the Euclidean space X = Rd, where the open sets T are defined as we know from calculus. This example also shows why we restrict the third condition of the definition above only to finite intersections of open sets: If we allowed infinite intersections in Condition 3, a set {p} consisting of a single point p ∈ Rd (which by the 11 Chapter 2. Mathematical Foundations Introduction to TDA calculus definition is not an open set) would have to be considered to be open; it is the intersection of the infinite series of open balls of radius 1/n centered at p, for n ∈ N . In most applications in these lecture notes, we work with subspaces of this Euclidean space Rd. In that context we not only know the notion of open sets from calculus, but also notions such as closed sets, closure, interior and boundary. These terms can also be defined for abstract topological spaces: Definition 2.2. A set Q ⊆ X is called closed, if its complement X \\ Q is open. The closure clQ is the smallest closed set containing Q. The interior intQ is the union of all open subsets of Q. The boundary bndQ is the set minus its interior: bndQ = Q\\intQ. Note that sets can be open and closed simultaneously: in every topological space (X,T), ∅ and X are such examples. In a discrete topology, every subset S ⊆ X is both open and closed. Exercise 2.3. Show that a finite union of closed sets is closed. So far we have only seen two topological spaces: Euclidean space, and the (rather boring) discrete topology on any set X. In order to see the value in the abstractions we are doing, we would like to have more examples of topological spaces. In particular, it would be great if we had a way to get new topological spaces from known ones. In the following we discuss some ways to do this, starting with taking intersections. Lemma2.4. Let (X,T) be some topological space, and Y ⊆ X. Then, U := {A∩Y | A ∈ T} is a", "rank": 0, "metadata": {"section": "2.1"}}
{"chunk_id": "2.1-1", "text": "have more examples of topological spaces. In particular, it would be great if we had a way to get new topological spaces from known ones. In the following we discuss some ways to do this, starting with taking intersections. Lemma2.4. Let (X,T) be some topological space, and Y ⊆ X. Then, U := {A∩Y | A ∈ T} is a topology on Y. We call this a subspace topology. Proof. We check the three conditions of a topology: 1. ∅ = ∅∩Y, therefore ∅ ∈ U. Similarly, Y = X∩Y, and thus Y ∈ U. 2. (cid:83) (A ∩Y) = ( (cid:83) A )∩Y, and thus (cid:83) (A ∩Y) ∈ U. i∈I i i∈I i i∈I i 3. (cid:84)n (A ∩Y) = ( (cid:84)n A )∩Y, and thus (cid:84)n (A ∩Y) ∈ U. i=1 i i=1 i i=1 i Since we have seen a natural topology on Rd, this already gives us a natural topology for all subsets of Rd. Another way to get topological spaces is as a product of spaces. We will not discuss the details of this here, and refer the interested reader to any textbook on topology, such as the excellent book by Munkres [2]. Fact 2.5. Let (X,T ),(Y,T ) be two topological spaces. Then there exists a topology X Y on X×Y, called the product topology. Finally, we can also get a topological space by taking the union of two disjoint topo- logical spaces. If a space can be obtained as such a union, we call it disconnected: 12", "rank": 1, "metadata": {"section": "2.1"}}
