{"chunk_id": "82-0", "text": "Covering Spaces Section 1.3 73 something weaker: Every point x 2 X has a neighborhood U such that U \\g(cid:132)U(cid:133) is nonempty for only finitely many g 2 G. Many symmetry groups have this proper discontinuity property without satisfying (cid:132)(cid:3)(cid:133), for example the group of symmetries of the familiar tiling of R2 by regular hexagons. The reason why the action of this group on R2 fails to satisfy (cid:132)(cid:3)(cid:133) is that there are fixed points: points y for which there is a nontrivial element g 2G with g(cid:132)y(cid:133)(cid:131)y. For example, the vertices of the hexagonsarefixedbythe120degreerotationsaboutthesepoints,andthemidpoints ofedgesarefixedby180degreerotations. Anactionwithoutfixedpointsiscalleda freeaction. Thusforafreeactionof G on Y,onlytheidentityelementof G fixesany pointof Y. Thisisequivalenttorequiringthatalltheimages g(cid:132)y(cid:133) ofeach y 2Y are distinct, or in other words g (cid:132)y(cid:133)(cid:131)g (cid:132)y(cid:133) only when g (cid:131)g , since g (cid:132)y(cid:133)(cid:131)g (cid:132)y(cid:133) 1 2 1 2 1 2 isequivalentto g −1g (cid:132)y(cid:133)(cid:131)y. Thoughcondition (cid:132)(cid:3)(cid:133) impliesfreeness,theconverse 1 2 isnotalwaystrue. Anexampleistheactionof Z on S1 inwhichageneratorof Z acts byrotationthroughanangle (cid:11) thatisanirrationalmultipleof 2(cid:25). Inthiscaseeach orbit Zy isdensein S1,socondition (cid:132)(cid:3)(cid:133) cannotholdsinceitimpliesthatorbitsare discrete subspaces. An exercise at the end of the section is to show that for actions onHausdorffspaces,freenessplusproperdiscontinuityimpliescondition (cid:132)(cid:3)(cid:133). Note thatproperdiscontinuityisautomaticforactionsbyafinitegroup. Example1.41. LetY betheclosedorientablesurfaceofgenus11,an‘11 holetorus’as showninthefigure. Thishasa 5 foldrotationalsymme- try,generatedbyarotationofangle 2(cid:25)=5. Thuswehave thecyclicgroup Z 5 actingon Y,andthecondition (cid:132)(cid:3)(cid:133) is C 4 C 3 obviouslysatisfied. ThequotientspaceY=Z isasurface 5 ofgenus3,obtainedfromoneofthefivesubsurfacesof C C Y cutoffbythecircles C ;(cid:1)(cid:1)(cid:1);C byidentifyingitstwo 5 2 1 5 C boundary circles C i and C i(cid:130)1 to form the circle C as 1 ! shown. Thuswehaveacoveringspace M M where 11 3 p M denotes the closed orientable surface of genus g. g In particular, we see that (cid:25) (cid:132)M (cid:133) contains the ‘larger’ 1 3 group (cid:25) (cid:132)M (cid:133) as a normal subgroup of index 5, with C 1 11 quotient Z . This example obviously generalizes by re- 5 placing the two holes in each ‘arm’ of M by m holes and the 5 fold symmetry by 11 ! n foldsymmetry. Thisgivesacoveringspace M mn(cid:130)1 M m(cid:130)1 . Anexerciseinx2.2is ! toshowbyanEulercharacteristicargumentthatifthereisacoveringspace M M g h then g(cid:131)mn(cid:130)1 and h(cid:131)m(cid:130)1 forsome m and n. Asaspecialcaseofthefinalstatementoftheprecedingpropositionweseethat foracoveringspaceactionofagroup G onasimply-connectedlocallypath-connected space Y, the orbit space Y=G has fundamental group isomorphic to G. Under this isomorphismanelement g2G correspondstoaloopin Y=G thatistheprojectionof", "rank": 0, "metadata": {"section": "82"}}
