{"chunk_id": "2.3-0", "text": "Chapter 2. Mathematical Foundations Introduction to TDA 2.3 Maps Between Topological Spaces In most areas of mathematics, there are two things that are at the core of every theory: objects, and mappings between them. For example, in linear algebra we study vector spaces and the linear maps between then. Now that we have defined the objects of study — topological spaces — we want to look at the mappings between them. Definition 2.10. A function f : X → Y is continuous if for every open set U ⊆ Y, its pre-image f−1(U) ⊆ X (the set of all elements x ∈ X such that f(x) ∈ U) is open. Continuous functions are also called maps. If f is an injective map, it is called an embedding. Let us give some examples: • For X ⊆ Y, we write X (cid:44)→ Y for the function f(x) = x,∀x ∈ X. This function, which is also called the inclusion map, is continuous: f−1(U) = U∩X, which is open in the subspace topology on X. • For a function f : R → R , continuity agrees with the “ϵ-δ” definition of continuity from calculus. Exercise 2.11. A topological space (X,T) is called path-connected if any two points x,y ∈ X can be joined by a path, i.e., there exists a map f : [0,1] → X of the segment [0,1] ⊂ R onto X such that f(0) = x and f(1) = y. Prove that a path-connected space is connected. An important question we have to answer is when we want to consider two topological spaces to be “the same”. In the rest of this section we develop some notions of equivalence of topological spaces, each based on the existence of some continuous function(s). Definition 2.12. A homeomorphism is a bijective map f : X → Y whose inverse is also continuous. Two topological spaces are homeomorphic, if there is a homeomorphism between them. We also write X ≃ Y to say that X,Y are homeomorphic. To make sure that homeomorphism is a reasonable notion of equivalence, we should check that it is indeed an equivalence relation. Exercise 2.13. Show that the relation of being homeomorphic is an equivalence rela- tion, that is, show that every space is homeomorphic to itself, show that the relation is symmetric (X ≃ Y iff Y ≃ X), and show that ≃ is transitive (if X ≃ Y and Y ≃ Z, then X ≃ Z). Let us apply our definition to some examples, to see whether it captures our intuition: • The boundary of a tetrahedron is homeomorphic to the sphere S2 (with both spaces considered as a subspace of R3). A homeomorphism can be found by taking a point c in the interior of the tetrahedron, and sending each point p of the boundary to the point f(p) on the ray from c through p such that d(c,f(p)) = 1. 14 Introduction to TDA 2.3. Maps Between Topological Spaces • The open interval I := (−1,1) is homeomorphic to R . The following map f is a homeomorphism: f : I → R , x (cid:55)→ x . Its inverse is f−1 : R → I, y (cid:55)→ y . 1−|x| 1+|y| • All knots (a knot is the image of an embedding of the circle into R3) are homeo- morphic. Thus, we cannot distinguish between knots using only homeomorphism. (cid:39) Figure 2.1: Two knots. Exercise 2.14. Give an example of a map f : X → Y that is bijective but not a homeo- morphism. Exercise 2.15. Consider a grid of 2", "rank": 0, "metadata": {"section": "2.3"}}
{"chunk_id": "2.3-1", "text": "All knots (a knot is the image of an embedding of the circle into R3) are homeo- morphic. Thus, we cannot distinguish between knots using only homeomorphism. (cid:39) Figure 2.1: Two knots. Exercise 2.14. Give an example of a map f : X → Y that is bijective but not a homeo- morphism. Exercise 2.15. Consider a grid of 2 vertical line segments and k + 2 horizontal seg- ments, for some k ⩾ 0. For k = 1, this looks as follows: Now, we consider the problem of placing a point on each of the k + 2 horizontal line segments, such that each of the k+4 total line segments contains at least one point. (a) How could one define a topology on the set of all such point placements? (b) Convince yourself that this space is homeomorphic to Sk. The example of the knots shows that in certain cases, homeomorphism does not capture all the information we can use to distinguish two spaces. In this example, this distinguishing information is not really stored in the topological spaces themselves, but in the way they are embedded in the “ambient” space (in this example R3). In such a case, where the two spaces we consider are both embedded into the same ambient space, we can not only look at maps between the two spaces themselves, but we can also consider whether one of them can be continuously deformed into the other: Definition2.16([1, Def. 1.18]). An isotopy connecting X ⊆ A and Y ⊆ A is a continuous map ϕ : X×[0,1] → A, such that ϕ(X,0) = X, ϕ(X,1) = Y, and ∀t ∈ [0,1], ϕ(·,t) is a homeomorphism between X and its image. Two spaces are called isotopic, if there is an isotopy connecting them. Exercise 2.17. Show that the relation of being isotopic is an equivalence relation. Let us check isotopy on a few examples, starting with the knots from above: 15 Chapter 2. Mathematical Foundations Introduction to TDA • The two knots from Figure 2.1 above (embedded in A = R3) are homeomorphic but not isotopic. Isotopy thus captures our intuition more accurately than home- omorphism in this case. • Let X ⊂ R be the union of {0}, and [1,2], and let Y ⊂ R be the union of [0,1] and {2}. These spaces are homeomorphic (X ≃ Y), but not isotopic. Just as with the knots, the difference between these spaces does not lie in their topology, but in the way they are embedded into the ambient space . R • Consider the two spaces in Figure 2.2, which are considered to be embedded in the ambient space A consisting of R3 minus the grey infinitely long pole in the middle. Do you think the spaces are isotopic? Most people would probably ar- gue that they are not, as in the left space both loops of the handcuff are locked around pole while in the right space one loop is free. However, it turns out that the spaces are in fact isotopic. An isotopy is illustrated by the following video: https://www.youtube.com/watch?v=wDZx9B4TAXo Figure 2.2: Left: Both loops of the handcuffs are wrapped around an infinite pole. Right: Only one loop of the handcuffs is wrapped around the infinite pole. These spaces are isotopic. Using isotopy we have now managed to distinguish between two spaces (embeddings) that homeomorphism could not distinguish. On the other hand, homeomorphism is also very restrictive: For example, any two-dimensional space X (such as the mantle of a cylinder) cannot be homeomorphic to any one-dimensional space Y (such as a circle), simply due", "rank": 1, "metadata": {"section": "2.3"}}
{"chunk_id": "2.3-2", "text": "the infinite pole. These spaces are isotopic. Using isotopy we have now managed to distinguish between two spaces (embeddings) that homeomorphism could not distinguish. On the other hand, homeomorphism is also very restrictive: For example, any two-dimensional space X (such as the mantle of a cylinder) cannot be homeomorphic to any one-dimensional space Y (such as a circle), simply due to the difference in dimension of X and Y. We thus also want to develop a weaker notion of equivalence than homeomorphism. 16 Introduction to TDA 2.3. Maps Between Topological Spaces To do this, we take the idea of continuous deformations from isotopy, but instead of applying it to deform spaces into each other, we deform maps into each other: Definition 2.18. Let g,h be maps X → Y. A homotopy connecting g and h is a map H : X × [0,1] → Y such that H(·,0) = g and H(·,1) = h. In this case g and h are called homotopic. Before we use homotopies to define an equivalence on topological spaces, let us again consider some examples: • The inclusion map g : B3 (cid:44)→ R3 (where B3 is the unit ball in R3), and the constant map h : B3 → R3 which sends every point to the origin, are homotopic, as shown by the homotopy H(x,t) = (1−t)g(x). • The identity map g : S1 → S1, and the constant map h : S1 → S1 which sends everything to a single point p ∈ S1, are not homotopic. The notion of homotopy now allows us to define our desired equivalence relation on topological spaces that is weaker than homeomorphism. Intuitively, this relation says that two spaces are the same if they can be continuously transformed into each other not only by bending, twisting and stretching, but also by shrinking or blowing up parts of different dimensions. However, note that unlike with isotopy, we do not need to consider the two spaces to be embedded in any ambient space. Definition 2.19. Two spaces X,Y are homotopy equivalent if there exist maps g : X → Y and h : Y → X such that: • h◦g is homotopic to id (the identity map x (cid:55)→ x), and X • g◦h is homotopic to id . Y Exercise 2.20. Show that the relation of being homotopy equivalent is an equivalence relation. Let us consider some examples: • The circle S1 and R2 \\ {0} are homotopy equivalent: We pick g as the inclusion map S1 (cid:44)→ R2 \\ {0}, and h(x) := x . We see that h ◦ g(x) = x, i.e., h ◦ g = id . |x| S1 Furthermore, g◦h(x) = h(x). Finally, g◦h and id are homotopic as certified R2\\{0} by the homotopy H(x,t) := tx+(1−t)h(x). • The cylinder mantle and the circle are homotopy equivalent, but not homeomor- phic. • Any ball Bd is homotopy equivalent to the single point. We call such spaces contractible. 17 Chapter 2. Mathematical Foundations Introduction to TDA The next lemma shows that homotopy equivalence is a strictly weaker notion than homeomorphism: Lemma 2.21. If X and Y are homeomorphic, they are also homotopy equivalent. Proof. Let g : X → Y be the homeomorphism, and h := g−1 its inverse. Then g◦h = id Y and h◦g = id , and id is homotopic to itself. X With the need for two maps and a proof that they are homotopic, proving homotopy equivalence directly can be quite tedious. The following notion of deformation retracts gives an easy way of proving homotopy equivalence in some cases.", "rank": 2, "metadata": {"section": "2.3"}}
{"chunk_id": "2.3-3", "text": "h := g−1 its inverse. Then g◦h = id Y and h◦g = id , and id is homotopic to itself. X With the need for two maps and a proof that they are homotopic, proving homotopy equivalence directly can be quite tedious. The following notion of deformation retracts gives an easy way of proving homotopy equivalence in some cases. Definition2.22. Let A ⊆ X. A deformationretract of X onto A is a map R : X×[0,1] → X, such that • R(·,0) = id X • R(x,1) ∈ A,∀x ∈ X • R(a,t) = a,∀a ∈ A,t ∈ [0,1] If such a deformation retract of X onto A exists, we also say that A is a deformation retract of X. The intuition behind a deformation retract is that the map R continuously shrinks X to A, while leaving A fixed. Note that unlike homeomorphism, isotopy and homotopy equivalence, deformation retracts are inherently asymmetric. Fact 2.23. If A is a deformation retract of X, then A and X are homotopy equivalent. Let us use this to prove homotopy equivalence of some examples: • The circle S1 is a deformation retract of R2 \\{0}: R(x,t) = (1−t)x+t· x . Note |x| how much easier this is to prove without needing to use the two maps h and g as above. • A punctured torus can be deformation retracted onto the symbol 8 where one of the two circles is rotated by 90◦, as seen by the following video: https://www.youtube.com/watch?v=tz3QWrfPQj4 One may think that deformation retracts are only useful for proving homotopy equiv- alence when one space is a subspace of the other. However, the following fact shows that deformation retracts can prove homotopy equivalence of any pair of spaces: Fact 2.24. X,Y are homotopy equivalent if and only if there exists a space Z such that X and Y are deformation retracts of Z. An example of this fact can be found in Figure 2.3. 18 Introduction to TDA 2.3. Maps Between Topological Spaces Figure 2.3: The top space deformation retracts to both spaces below, showing that they are homotopy equivalent. Exercise2.25. Sort the letters of the alphabet into equivalence classes under homotopy equivalence. Exercise 2.26. Show that both a cylinder and a Möbius strip are homotopy equivalent to a circle. Exercise 2.27. Let X be S2 where the north pole and the south pole have been glued together, see Figure 2.4a. Let Y be S2 with an S1 attached at the north pole, see Figure 2.4b. (a) The space X. (b) The space Y. Figure 2.4: The spaces from Exercise 2.27. Give an informal argument that X and Y are homotopy equivalent. Bonus ques- tion: Are they also homeomorphic? We note that in general showing existence of a map with certain properties (e.g., a homeomorphism, isotopy, homotopy) is easy: just give a map and show that it satisfies therequiredproperties. Ontheotherhand, showingthatsuchamapcannotexistishard, as there are usually infinitely many candidate maps. The idea of algebraic topology is to identify invariant properties preserved by these maps. Then, we know that no map can exist between spaces on which these invariants differ. An example of such an invariant is the number of “holes” a space has, which we will formalize when we introduce the notion of homology. 19", "rank": 3, "metadata": {"section": "2.3"}}
{"chunk_id": "2.3-4", "text": "notion of homology. 19", "rank": 4, "metadata": {"section": "2.3"}}
