{"chunk_id": "14-0", "text": "Cell Complexes Chapter 0 5 Cell Complexes A familiar way of constructing the torus S1(cid:2)S1 is by identifying opposite sides ofasquare. Moregenerally,anorientablesurface M ofgenus g canbeconstructed g fromapolygonwith4g sides a byidentifyingpairsofedges, as shown in the figure in the b b first three cases g (cid:131) 1;2;3. b a The 4g edgesofthepolygon a c becomeaunionof 2g circles d b in the surface, all intersect- b c ing in a single point. The in- c a terior of the polygon can be a d d b thought of as an open disk, a c or a 2 cell, attached to the d d union of the 2g circles. One e c c d can also regard the union of b e f b the circles as being obtained from their common point of e a intersection,byattaching 2g a f f a b open arcs, or 1 cells. Thus the surface can be built up in stages: Start with a point, attach 1 cells to this point, thenattacha 2 cell. Anaturalgeneralizationofthisistoconstructaspacebythefollowingprocedure: (1) Startwithadiscreteset X0,whosepointsareregardedas 0 cells. (2) Inductively,formthen skeleton Xn from Xn−1 byattaching n cells en viamaps (cid:11) ’ :Sn−1 ! Xn−1. Thismeansthat Xn isthequotientspaceofthedisjointunion (cid:11) ‘ Xn−1 Dn of Xn−1 with a collection of n disks Dn under the identifications (cid:11) (cid:11) (cid:11)‘ x (cid:24) ’ (cid:132)x(cid:133) for x 2 @Dn. Thus as a set, Xn (cid:131) Xn−1 en where each en is an (cid:11) (cid:11) (cid:11) (cid:11) (cid:11) open n disk. (3) One can either stop this inductive process at a finite stage, setting X (cid:131) Xn for S some n < 1, or one can continue indefinitely, setting X (cid:131) Xn. In the latter n case X isgiventheweaktopology: Aset A(cid:26)X isopen(orclosed)iff A\\Xn is open(orclosed)in Xn foreach n. A space X constructed in this way is called a cell complex or CW complex. The explanation of the letters ‘CW’ is given in the Appendix, where a number of basic topological properties of cell complexes are proved. The reader who wonders about various point-set topological questions lurking in the background of the following discussionshouldconsulttheAppendixfordetails.", "rank": 0, "metadata": {"section": "14"}}
