{"chunk_id": "7.1.1-0", "text": "Introduction to TDA 7.1. Reeb Graphs 7.1.1 Homology of Reeb Graphs The Reeb graph of a topological space X with respect to a function f can be viewed as a summary of X through the lens of f. The natural question is: how good of a summary is it? It is clear that in general we lose information, for example on the dimension of X, but we can still hope that some topological information is retained. In this section, we thus compare the homology of the Reeb graph to the homology of X. Since the Reeb graph R is a graph (a 1-dimensional object), we have H (R ) = 0 for p ⩾ 2, so f p f any higher-dimensional homology gets lost. However, a graph can still have non-trivial homology in dimensions 0 and 1. Observation 7.8. For a levelset tame f : X → R, we have β (X) = β (R ). 0 0 f In other words, the Reeb graph captures the 0-homology of the input space X per- fectly, no matter which levelset tame function f we use. Sadly, the same does not hold for the 1-homology. Let us consider a torus, as in Figure 7.3. In general, it can be that the choice of function f determines whether we capture a hole or not, consider for example a cylinder. However note that for the torus, it is actually the case that no matter which function f we choose, we cannot capture its 1-homology (this is non-trivial to show). f Figure 7.3: The torus and its Reeb graph. On the other hand, we can see that every cycle in the Reeb graph is indeed also a cycle in the topological space X, and it cannot be filled in, so it is indeed a hole. Thus we also get the following observation: Observation 7.9. For a levelset tame f : X → R, we have β (X) ⩾ β (R ). 1 1 f Canwesomehowformalizewhichholeswelose? Todothis, wesplituphomologyinto “horizontal” and a “vertical” parts. The intuition behind these terms is that we consider f to be a function pointing upwards, and thus roughly, horizontal means “perpendicular to f” and vertical means “along f”. 79 Chapter 7. Reeb Graphs and Mapper Introduction to TDA Definition 7.10. A p-th homology class h ∈ H (X) is called horizontal if there is a p finite set of values A = {a ,...,a } such that h ∈ im(ι ) where ι is the map 1 k ∗ ∗ (cid:83) H ( X ) → H (X) induced by inclusion, where X = f−1(a). p a∈A a p a This definition means that we need to be able to find a finite set of levelsets, such that we can find cycles contained in these levelsets, which are in the homology class h in H (X). p One now wonders whether the set of horizontal homology classes forms a group. Let this set be H (X). It turns out that it is indeed a group. p Lemma 7.11. H (X) is a subgroup of H (X). p p Proof. First, we see that the identity element 0 is in H (X). We can take an arbitrary p set A, and we can always map the 0 element of H ( (cid:83) X ) to 0. p a∈A a Next, we show that the set is closed under addition. Let p,q ∈ H (X), and we show p that p+q ∈ H (X). p has a pre-image in some levelset A , and q has a pre-image in p p some levelset A", "rank": 0, "metadata": {"section": "7.1.1"}}
{"chunk_id": "7.1.1-1", "text": "always map the 0 element of H ( (cid:83) X ) to 0. p a∈A a Next, we show that the set is closed under addition. Let p,q ∈ H (X), and we show p that p+q ∈ H (X). p has a pre-image in some levelset A , and q has a pre-image in p p some levelset A . p+q must have a pre-image in A ∪A . q p q Finally, we show that the inverse of every element is contained in the group, but since every element is self-inverse in Z -homology, we get that for every element its inverse is 2 also contained in H (X). p Since the horizontal homology is a sub-group, we can now easily define vertical ho- mology by taking quotient groups. ∨ Definition7.12. The verticalhomologygroup of X with respect to f is the group H (X) := p H (X)/H (X). p p ∨ Observation 7.13. dim(H (X)) = dim(H (X))+dim(H (X)). p p p The following fact that we do not prove here shows that when we go from a space X to its Reeb graph, we keep the vertical homology classes, and lose the horizontal ones. ∨ ∨ Fact 7.14. The surjection ϕ : X → R induces an isomorphism Φ : H (X) → H (R ). f 1 1 f Corollary 7.15. Given X an orientable connected compact 2-manifold, and a Morse function f : X → R, then β (R ) = β (X)/2. 1 f 1 Here, a 2-manifold is a space that locally at every point looks like R2. Orientable means that there is an inside and an outside side. A Morse function is a “nice enough” function defined in terms of some derivatives, which we do not need to specify here. Exercise 7.16. (a) Consider a 2-dimensional geometric simplicial complex K embed- ded in R2. Consider the function f(x) = x . Show that β (K) = β (R ). 1 1 1 f (b) Find a geometric simplicial complex K embedded in R2 and a map f : K → R such that β (K) > β (R ). 1 1 f 80", "rank": 1, "metadata": {"section": "7.1.1"}}
