{"chunk_id": "33-0", "text": "24 Chapter 1 The Fundamental Group Toshedfurtherlightonthisexample,supposewemodifyitslightlysothatthecir- cles A and B arenowlinked,asinthenextfigure. Thecircle C canthenbedeformed into the position shown at theright,whereitagainrep- A B A B resents the composite loop aba −1b −1, where a and b are loops linking A and B. But from the picture on the C C leftitisapparentthat C can actuallybeunlinkedcompletelyfrom A and B. Sointhiscasetheproduct aba −1b −1 shouldbetrivial. The fundamental group of a space X will be defined so that its elements are loops in X starting and ending at a fixed basepoint x 2 X, but two such loops 0 areregardedasdeterminingthesameelementofthefundamentalgroupifoneloop canbecontinuouslydeformedtotheotherwithinthespace X. (Allloopsthatoccur duringdeformationsmustalsostartandendat x .) Inthefirstexampleabove, X is 0 thecomplementofthecircle A,whileintheothertwoexamples X isthecomplement ofthetwocircles A and B. Inthesecondsectioninthischapterwewillshow: Thefundamentalgroupofthecomplementofthecircle A inthefirstexampleis infinitecyclicwiththeloop B asagenerator. Thisamountstosayingthatevery loop in the complement of A can be deformed to one of the loops B , and that n B cannotbedeformedto B if n(cid:148)m. n m Thefundamentalgroupofthecomplementofthetwounlinkedcircles A and B in thesecondexampleisthenonabelianfreegroupontwogenerators,represented bytheloops a and b linking A and B. Inparticular,thecommutator aba −1b −1 isanontrivialelementofthisgroup. Thefundamentalgroupofthecomplementofthetwolinkedcircles A and B in thethirdexampleisthefreeabeliangroupontwogenerators,representedbythe loops a and b linking A and B. As a result of these calculations, we have two ways to tell when a pair of circles A and B is linked. The direct approach is given by the first example, where one circle isregardedasanelementofthefundamentalgroupofthecomplementoftheother circle. An alternative and somewhat more subtle method is given by the second and thirdexamples,whereonedistinguishesapairoflinkedcirclesfromapairofunlinked circlesbythefundamentalgroupoftheircomplement,whichisabelianinonecaseand nonabelianintheother. Thismethodismuchmoregeneral: Onecanoftenshowthat twospacesarenothomeomorphicbyshowingthattheirfundamentalgroupsarenot isomorphic,sinceitwillbeaneasyconsequenceofthedefinitionofthefundamental groupthathomeomorphicspaceshaveisomorphicfundamentalgroups.", "rank": 0, "metadata": {"section": "33"}}
