{"chunk_id": "3.2.8-0", "text": "Introduction to TDA 3.2. Homology neighboring some d-simplex σ′ ̸∈ c′. The (d−1)-simplex that is a boundary of both σ and σ′ would then be part of δ (c′). We conclude that Z (Sd) = ⟨c⟩. p d Since δ(∆d+1) is a d-dimensional simplicial complex, and thus does not contain any (d+1)-simplices, no non-empty d-chain can be a boundary. We thus get that B (Sd) is d the group containing only 0. ∼ We finally get H (Sd) = Z /B = Z = Z . d d d d 2 (cid:80) H (Sd): Finally, let us go to H (Sd), for 0 < p < d: Let c = α σ be a p-cycle. We p p i i aim to show that c is homologous to the 0-chain, i.e., that [c] = [0]. Equivalently, we show that c must be a boundary. Let σ = (v ,...,v ) be any p-simplex in c which does not include v . We will m 0 mp 0 keep replacing such simplices by simplices which do contain v , until we have no more 0 simplices not containing v . 0 Let b be the (p+1)-simplex (v ,v ,...,v ). Note that b ∈ δ(∆d+1) and thus δ(b) 0 m 0 mp is a p-boundary. Also note that σ is in δ(b). Furthermore, σ is the only p-simplex in δ(b) which does not contain v . We now add δ(b) to c, to get c′ := c+δ(b). Since we 0 added a boundary, [c] = [c′] (i.e., c and c′ are homologous). Furthermore, c′ contains one fewer p-simplex not containing v , when compared to c. 0 We repeat this process until we reach a cycle c∗ in which every p-simplex contains v . We now claim that c∗ must be the trivial cycle: Assume c∗ contains some p-simplex 0 a = (v ,v ,...,v ). Then, the (p−1)-simplex a′ = (v ,...,v ) is part of δ(a). But, 0 a 1 ap a 1 ap a′ cannot be part of the boundary of any other p-simplex in c∗, since the only p-simplex containing a′ as a face while also containing v is a. Thus, to have an empty boundary, 0 we have c∗ = 0. By construction, [c] = [c∗], therefore [c] = 0 as we aimed to prove. We have proven that every cycle is homologous to 0, and we can conclude that for all 0 < p < d, H (Sd) = 0. p Since Sd is d-dimensional, we do not have any simplices of dimensions p > d, and thus H (Sd) = 0 for p > d. Combining all these arguments we conclude the following p theorem: Theorem 3.39. For any d > 0, we have (cid:14) Z p ∈ {0,d} H (Sd) = 2 p 0 else. (cid:14) 1 p ∈ {0,d} β (Sd) = p 0 else. 3.2.8 Induced Homology As usual, now that we have defined some mathematical objects (homology groups) we are also interested in the maps between them. For simplicial complexes we have defined 41 Chapter 3. Homology Introduction to TDA simplicial maps, and we now want to study the effect that simplicial maps have on the homology of a space. We first extend simplicial maps to the chain groups. Definition 3.40. Let f : K → K be a simplicial map. This induces a chain map 1 2 f : C (K ) → C (K ) # p 1 p 2 (cid:14) (cid:88) (cid:88) f(σ ) if f(σ ) is p-simplex in K i i 2 c = α", "rank": 0, "metadata": {"section": "3.2.8"}}
{"chunk_id": "3.2.8-1", "text": "We first extend simplicial maps to the chain groups. Definition 3.40. Let f : K → K be a simplicial map. This induces a chain map 1 2 f : C (K ) → C (K ) # p 1 p 2 (cid:14) (cid:88) (cid:88) f(σ ) if f(σ ) is p-simplex in K i i 2 c = α σ (cid:55)→ f (c) := α τ , where τ = i i # i i i 0 otherwise Note that f(σ ) is always a simplex in K since f is a simplicial map, but it could be a i 2 simplex of smaller dimension. This is why we need the condition in the above definition of τ . i The following can be shown with a bit of work: • f ◦δ = δ◦f # # • f (B (K )) ⊆ f (Z (K )) # p 1 # p 1 • f (Z (K )) ⊆ Z (K ), f (B (K )) ⊆ B (K ) # p 1 p 2 # p 1 p 2 From this chain map f , we now get a well-defined induced homomorphism between # the homology groups of K and K . 1 2 Definition 3.41. Let f be a simplicial map and f its induced chain map. This induces # a homomorphism f : H (K ) → H (K ) ∗ p 1 p 2 [c] = c+B (cid:55)→ f (c)+B (K ) = [f (c)]. p # p 2 # Fact 3.42. If H (K ) and H (K ) are vector spaces (as they are in e.g. Z -homology, p 1 p 2 2 which is what we are using), then f is a linear map. ∗ We also get the following functorial property, which we will not prove. Fact 3.43. For two simplicial maps f : X → Y, g : Y → Z, we have (g◦f) = g ◦f . ∗ ∗ ∗ Let us compute the induced homomorphism of a small example: b b a d a d K K 1 2 c c We consider the inclusion map f : K (cid:44)→ K . 1 2 ∼ H (K ) = {0,[abc],[bcd],[abdc]} = Z2 1 1 2 f (0) = 0, f ([abc]) = [abc] ∗ ∗ f ([bcd]) = 0, f ([abdc]) = [abc] ∗ ∗ 42 Introduction to TDA 3.2. Homology Exercise 3.44. Let K = {∅,a,b,c,d,e,ab,ac,bc,bd,cd,ce,de,abc} 1 and K = {∅,w,x,y,z,wx,wy,xy,xz,yz}. 2 Consider the map f : K → K induced by the vertex map 1 2 a (cid:55)→ y,b (cid:55)→ x,c (cid:55)→ y,d (cid:55)→ z,e (cid:55)→ z. You can verify easily that f is simplicial. Compute f : H (K ) → H (K ) for ∗ p 1 p 2 0 ⩽ p ⩽ 2. Exercise 3.45. Which of the following four statements is true for every simplicial map f? “If f is {injective, surjective}, then f is {injective, surjective}.” ∗ The following fact has some very powerful consequences, as we will see. Fact 3.46. If f,g : K → K are contiguous, f = g . 1 2 ∗ ∗ Note that the definition of induced homology extends from simplicial maps to maps between any topological spaces. We will not state the exact definitions, but the following fact is the continuous analogue (remember that two simplicial maps being contiguous is analogous to two maps being homotopic) of Fact 3.46. Fact 3.47. If f,g : X → Y are homotopic, f = g . ∗ ∗ Thanks to this fact we get the following corollary,", "rank": 1, "metadata": {"section": "3.2.8"}}
{"chunk_id": "3.2.8-2", "text": "any topological spaces. We will not state the exact definitions, but the following fact is the continuous analogue (remember that two simplicial maps being contiguous is analogous to two maps being homotopic) of Fact 3.46. Fact 3.47. If f,g : X → Y are homotopic, f = g . ∗ ∗ Thanks to this fact we get the following corollary, which shows that homology is indeed an invariant under homeomorphisms, and even under homotopy equivalence. This also gives us the option to compute the homology of a space by computing the homology of a potentially simpler homotopy equivalent space. Corollary 3.48. If f : X → Y is a homotopy equivalence (i.e., there exists g : Y → X such that f ◦ g is homotopic to id and g ◦ f is homotopic to id ), then f is an Y X ∗ isomorphism. Proof. Thanks to Fact 3.43 we have (g◦f) = g ◦f . By Fact 3.47, (g◦f) = (id ) , ∗ ∗ ∗ ∗ X ∗ whichisanisomorphism. Sincewethusknowthatg ◦f isanisomorphism,weknowthat ∗ ∗ f must be injective and g must be surjective. By a symmetric argument considering ∗ ∗ f ◦ g we also get that f is surjective and g is injective, and thus both f and g are ∗ ∗ ∗ ∗ isomorphisms. Exercise 3.49. Consider the space you get when you glue together two points of a torus. What is the homology of this space? 43", "rank": 2, "metadata": {"section": "3.2.8"}}
