{"chunk_id": "6.2.3-0", "text": "Introduction to TDA 6.2. Interleaving of Persistence Modules 6.2.3 Stability for Čech Complexes So far, we have only seen stability results comparing filtrations induced by different func- tions on a fixed space. However, in applications in data analysis, we consider complexes on point clouds, and two different point clouds might not have the same size. Thus, the simplicial complexes on which we get filtrations are generally different. Using interleav- ing distance, we can however still give stability results. In this section, we will do this for Čech complexes. Consider two point clouds P,Q in the same metric space X. Let us first consider the really simple case, where P = {p}, and Q = {q} with d(p,q) = d. Then, B(p,r) ⊆ B(q,r+d). Now, how does this generalize to larger point sets? To get the same kind of behavior, we need that for every point in P, there exists some point in Q with distance at most d. This motivates the following distance measure: Definition 6.28 (Hausdorff distance). Let A,B ⊆ X be compact sets. Then the Hausdorff distance between A and B is defined as d (A,B) := max{maxd(a,B),maxd(b,A)}. H a∈A b∈B Exercise 6.29. Show that Hausdorff distance is a metric. We can now see that if d (P,Q) = d, then (cid:83) B(p,r) ⊆ (cid:83) B(q,r+d). From H p∈P q∈Q this, we get the following lemma: Lemma6.30. For P,Q with d (P,Q) = d, the (filtrations given by) the Čech complexes H of P and Q are d-interleaved. Proof. Consider the following diagram: Cr(P) Cr+d(P) Cr+2d(P) ≃ ≃ ≃ (cid:83) (cid:83) (cid:83) B(p,r) B(p,r+d) B(p,r+2d) p∈P p∈P p∈P (cid:83) (cid:83) (cid:83) B(q,r) B(q,r+d) B(q,r+2d) q∈Q q∈Q q∈Q ≃ ≃ ≃ Cr(Q) Cr+d(Q) Cr+2d(Q) The relevant sub-diagrams commute up to homotopy, since we only chain together ho- motopies and inclusion maps. Note that for the trapezoidal diagrams we would need to consider the horizontal inclusions between the Čech complexes in the diagram above for arbitrary distances and not just d. 71", "rank": 0, "metadata": {"section": "6.2.3"}}
