{"chunk_id": "3.2.7-0", "text": "Chapter 3. Homology Introduction to TDA Theorem 3.36. Let X be a topological space, K a triangulation of X. Then we have ∼ H (X) = H (K) for all p ⩾ 0. p p As isomorphisms for vector spaces are an equivalence relation, we also get the desired independence of the triangulation. ∼ Corollary 3.37. Let K ,K be two distinct triangulations of X. Then, H (K ) = H (K ) 1 2 p 1 p 2 for all p ⩾ 0, that is, homology is independent of the chosen triangulation. For the remainder of these lecture notes we will only work with simplicial homol- ogy, but we often talk about the homology of a triangulable space without specifying a triangulation. The above corollary gives us the right to do this. 3.2.6 The 0-th homology group The homology group that is easiest to understand is the 0-th one. Recall that the 0- simplices of a simplicial complex K are simply its vertices. Since vertices do not have any boundaries, every vertex is a 0-cycle. The boundary of a 1-simplex simply consists of the two vertices which are connected by the edge. We can thus see that two vertices v and v are homologous if there is a path from v to v , and the homology class [v ] is 1 2 1 2 1 simply the connected component containing v . 1 Observation 3.38. β (K) is the number of connected components of K. 0 As a consequence, the 0-homology classes are all the formal sums of connected com- ponents. 3.2.7 Homology of Spheres One of the main intuitions for us when we introduced homology was that a d-sphere should have a single d-hole and no other holes. We will now check whether our definition captured this intuition correctly. Since we have seen in Section 3.2.5 that homology is independent from the chosen triangulation, let us fix some triangulation of the sphere Sd. A good candidate (due to its simplicity) is the boundary of a simplex, that is, Sd ≃ δ(∆d+1), with the vertex set V = {v ,...,v }. 0 d+1 H (Sd): Let us first investigate H (Sd). Since all vertices are connected, all vertices are 0 0 ∼ homologous, and H (Sd) = ⟨[v]⟩ = Z . 0 2 H (Sd): Next, let us check H (Sd). We first compute Z : The d-simplices are exactly d d d the sets σ = {v ,...,vˆ,...,v }. Note that every (d−1)-simplex occurs as the bound- i 0 i d+1 ary of exactly two such d-simplices. Thus, both the zero element (empty chain) as well as the chain c consisting of all d-simplices are part of Z . On the other hand, no chain d c′ ̸∈ {0,c} can be a cycle, since for such a chain there must be some d-simplex σ ∈ c′ 40", "rank": 0, "metadata": {"section": "3.2.7"}}
