{"chunk_id": "57-0", "text": "48 Chapter 1 The Fundamental Group X \\X isthecircleS1(cid:2)f1= g,thedomainendofeachmappingcylinder. m n 2 Toobtainanembeddingof X in S3−K asadeformationretractwewillusethe standard decomposition of S3 into two solid tori S1(cid:2)D2 and D2(cid:2)S1, the result of regarding S3 as @D4 (cid:131) @(cid:132)D2(cid:2)D2(cid:133) (cid:131) @D2(cid:2)D2 [D2(cid:2)@D2. Geometrically, the first solid torus S1(cid:2)D2 can be identified with the compact region in R3 bounded by the standard torus S1(cid:2)S1 containing K, and the second solid torus D2(cid:2)S1 is then the closureofthecomplementofthefirstsolidtorus,togetherwiththecompactification pointatinfinity. Noticethatmeridionalcirclesin S1(cid:2)S1 bounddisksinthefirstsolid torus,whileitislongitudinalcirclesthatbounddisksinthesecondsolidtorus. In the first solid torus, K intersects each of the meridian K circles fxg(cid:2)@D2 in m equally spaced points, as indicated in the figure at the right, which shows a meridian disk fxg(cid:2)D2. These m points can be separated by a union of m radial line segments. Letting x vary,theseradialsegmentsthentraceout K K acopyofthemappingcylinder X inthefirstsolidtorus. Sym- m metrically,thereisacopyoftheothermappingcylinder X inthesecondsolidtorus. n Thecomplementof K inthefirstsolidtorusdeformationretractsonto X byflowing m within each meridian disk as shown. In similar fashion the complement of K in the secondsolidtorusdeformationretractsonto X . Thesetwodeformationretractions n do not agree on their common domain of definition S1(cid:2)S1−K, but this is easy to correct by distorting the flows in the two solid tori so that in S1(cid:2)S1−K both flows areorthogonalto K. Afterthismodificationwenowhaveawell-defineddeformation retraction of S3 −K onto X. Another way of describing the situation would be to saythatforanopen \" neighborhood N of K boundedbyatorus T,thecomplement ! S3−N isthemappingcylinderofamap T X. To compute (cid:25) (cid:132)X(cid:133) we apply van Kampen’s theorem to the decomposition of X 1 as the union of X and X , or more properly, open neighborhoods of these two m n sets that deformation retract onto them. Both X and X are mapping cylinders m n that deformation retract onto circles, and X \\X is a circle, so all three of these m n spaces have fundamental group Z. A loop in X \\X representing a generator of m n (cid:25) (cid:132)X \\X (cid:133) ishomotopicin X toalooprepresenting m timesagenerator,andin 1 m n m X toalooprepresenting n timesagenerator. VanKampen’stheoremthensaysthat n (cid:25) (cid:132)X(cid:133) isthequotientofthefreegroupongenerators a and b obtainedbyfactoring 1 outthenormalsubgroupgeneratedbytheelement amb −n. Let us denote by G this group (cid:25) (cid:132)X (cid:133) defined by two generators a and m;n 1 m;n b and one relation am (cid:131) bn. If m or n is 1, then G is infinite cyclic since in m;n these cases the relation just expresses one generator as a power of the other. To describe the structure of G when m;n > 1 let us first compute the center of m;n G ,thesubgroupconsistingofelementsthatcommutewithallelementsof G . m;n m;n Theelement am (cid:131)bn commuteswith a and b,sothecyclicsubgroup C generated", "rank": 0, "metadata": {"section": "57"}}
