{"chunk_id": "3.2.9-0", "text": "Chapter 3. Homology Introduction to TDA Consider the space you get when you simultaneously pierce a balloon at n distinct locations. What is the homology of this space? Exercise 3.50. Let f,g : S1 → S1 be continuous maps such that f(−x) = f(x) and g(−x) = −g(x) for all x ∈ S1. a) Convince yourself that f : H (S1) → H (S1) is trivial (maps everything to 0) ∗ 1 1 and that g is an isomorphism. ∗ b) Show that f and g are not homotopic. c) Show that there is no map h : S2 → S1 such that h(−x) = −h(x). d) Conclude that every map ϕ : S2 → R2 with ϕ(−x) = −ϕ(x) has a zero. The statement you have proven in d) is equivalent to the 2-dimensional case of the famous Borsuk-Ulam theorem, which implies statements such as “at any time, there are two antipodal points on the earth with both the same temperature and atmospheric pressure”. 3.2.9 Application: Brouwer Fixed Point Theorem In this section we finally collect the fruits of our hard work by using homology to give a relatively short proof of the famous fixed point theorem by Brouwer. Here, Bd denotes the unit ball of dimension d. Theorem 3.51 (Brouwer fixed point theorem). Let f : Bd → Bd be continuous. Then, f has a fixed point, that is, ∃x ∈ Bd such that f(x) = x. This theorem has many fascinating implications: • Take two sheets of paper lying on top of each other. Crumple the top sheet and set it back onto the other sheet. No matter how you crumpled the sheet, at least one point of the crumpled sheet lies exactly above its corresponding point in the bottom sheet. • If you open a map of Switzerland in Switzerland, there is at least one point on the map which is at its exact position.2 • If you take a cup of liquid and stir or slosh it, at least one atom ends up at its original position (but if you shake you might break continuity). • The theorem also has many applications in mathematics and computer science, such as in fair divisions or for proving existence of Nash equilibria. 2The theorem only applies when ignoring the Italian and German exclaves of Campione d’Italia and Büsingen am Hochrhein. 44 Introduction to TDA 3.2. Homology ToproveTheorem3.51,wefirstintroducethefollowingdefinitionandahelperlemma, which we only prove after proving Theorem 3.51 itself. Definition 3.52. A map r : X → A ⊆ X is a retraction if r(a) = a, ∀a ∈ A. Lemma 3.53. There is no retraction r : Bd → Sd−1. Proof of Theorem 3.51. We prove the theorem by contradiction. For an illustration of the argument see Figure 3.11. Assume f : Bd → Bd has no fixed point. For each −−−→ x, consider the ray f(x)x and let r(x) be the intersection of this ray with Sd−1. Then, r : Bd → Sd−1 is continuous (which we do not prove here) and r(s) = s ∀s ∈ Sd−1, since −−→ no matter where f(s) lies, f(s)s first intersects Sd−1 in s. Thus, r is a retraction, which does not exist by Lemma 3.53. f(x) x r(x) Figure 3.11: If f has no fixed point, we get a retraction to the boundary. It remains to prove the helper lemma. Proof of Lemma 3.53. Consider the inclusion map i : Sd−1 (cid:44)→ Bd, and a retraction r : Bd → Sd−1. By definition, we have r ◦ i = id. Let us look at the induced maps ∼ of r and", "rank": 0, "metadata": {"section": "3.2.9"}}
{"chunk_id": "3.2.9-1", "text": "f has no fixed point, we get a retraction to the boundary. It remains to prove the helper lemma. Proof of Lemma 3.53. Consider the inclusion map i : Sd−1 (cid:44)→ Bd, and a retraction r : Bd → Sd−1. By definition, we have r ◦ i = id. Let us look at the induced maps ∼ of r and i in the (d − 1)-th homology of Sd−1 and Bd. Recall that H (Sd−1) = Z d−1 2 ∼ and H (Bd) = 0. We thus view i as a homomorphism from Z to 0, and r as a d−1 ∗ 2 ∗ homomorphism from 0 to Z . But since r ◦ i = id, we also have r ◦ i = id. We can 2 ∗ ∗ combine this to reach a contradiction: 1 = id(1) = (r ◦i )(1) = r (i (1)) = r (0) = 0 ∗ ∗ ∗ ∗ ∗ Thus, either i or r cannot exist, but since i exists, r cannot. 45 Chapter 3. Homology Introduction to TDA Questions 5. What is a simplicial complex? Define geometric and abstract simplicial com- plexes and state and prove the realization theorem (Theorem 3.5). 6. What are simplicial and contiguous maps? State the definitions and discuss the connection to their counterparts in continuous topology. 7. Is every contractible simplicial complex collapsible? Define the notion of col- lapsibility and describe Bing’s house with two rooms. 8. What is simplicial homology? Explain the intuition and give the formal defini- tions of chains, boundaries and cycles. 9. Why is the homology of a triangulable space independent of the chosen trian- gulation? Explain the idea of singular homology. 10. What are the homology groups of a sphere? State and prove the corresponding theorem (Theorem 3.39). 11. How does a simplicial map between two simplicial complexes induce maps between their homology groups? Define induced homomorphisms. 12. What is the Brouwer fixed point theorem? State, illustrate and prove the Brouwer fixed point theorem (Theorem 3.51). References [1] Kenneth Baker, Sketches of topology - Bing’s house. https://sketchesoftopology. wordpress.com/2010/03/25/bings-house/, accessed: 2023-04-27. [2] Allen Hatcher, Algebraic topology, Cambridge Univ. Press, Cambridge, 2000. 46", "rank": 1, "metadata": {"section": "3.2.9"}}
