{"chunk_id": "90-0", "text": "Covering Spaces Section 1.3 81 ! of M inthe 3 torus T3 (cid:131)S1(cid:2)S1(cid:2)S1 suchthattheinducedmap (cid:25) (cid:132)M (cid:133) (cid:25) (cid:132)T3(cid:133) g 1 g 1 issurjective. 20. ConstructnonnormalcoveringspacesoftheKleinbottlebyaKleinbottleandby atorus. 21. Let X bethespaceobtainedfromatorus S1(cid:2)S1 byattachingaM¨obiusbandviaa homeomorphismfromtheboundarycircleoftheM¨obiusbandtothecircle S1(cid:2)fx g 0 in the torus. Compute (cid:25) (cid:132)X(cid:133), describe the universal cover of X, and describe the 1 action of (cid:25) (cid:132)X(cid:133) on the universal cover. Do the same for the space Y obtained by 1 attaching a M¨obius band to RP2 via a homeomorphism from its boundary circle to thecirclein RP2 formedbythe 1 skeletonoftheusualCWstructureon RP2. 22. Givencoveringspaceactionsofgroups G on X and G on X ,showthattheac- 1 1 2 2 tionof G (cid:2)G on X (cid:2)X definedby (cid:132)g ;g (cid:133)(cid:132)x ;x (cid:133)(cid:131)(cid:132)g (cid:132)x (cid:133);g (cid:132)x (cid:133)(cid:133) isacovering 1 2 1 2 1 2 1 2 1 1 2 2 spaceaction,andthat (cid:132)X (cid:2)X (cid:133)=(cid:132)G (cid:2)G (cid:133) ishomeomorphicto X =G (cid:2)X =G . 1 2 1 2 1 1 2 2 23. Show that if a group G acts freely and properly discontinuously on a Hausdorff space X,thentheactionisacoveringspaceaction. (Here‘properlydiscontinuously’ meansthateach x2X hasaneighborhood U suchthat fg2GjU\\g(cid:132)U(cid:133)(cid:148);g is finite.) Inparticular,afreeactionofafinitegrouponaHausdorffspaceisacovering spaceaction. 24. Given a covering space action of a group G on a path-connected, locally path- connectedspace X,theneachsubgroup H (cid:26)G determinesacompositionofcovering ! ! spaces X X=H X=G. Show: (a) Everypath-connectedcoveringspacebetween X and X=G isisomorphicto X=H forsomesubgroup H (cid:26)G. (b) Two such covering spaces X=H and X=H of X=G are isomorphic iff H and 1 2 1 H areconjugatesubgroupsof G. 2 ! (c) The covering space X=H X=G is normal iff H is a normal subgroup of G, in whichcasethegroupofdecktransformationsofthiscoveris G=H. ! 25. Let ’:R2 R2 bethelineartransformation ’(cid:132)x;y(cid:133)(cid:131)(cid:132)2x;y=2(cid:133). Thisgenerates an action of Z on X (cid:131) R2 −f0g. Show this action is a covering space action and compute (cid:25) (cid:132)X=Z(cid:133). Showtheorbitspace X=Z isnon-Hausdorff,anddescribehowitis 1 aunionoffoursubspaceshomeomorphicto S1(cid:2)R,comingfromthecomplementary componentsofthe x axisandthe y axis. e! 26. For a covering space p:X X with X connected, locally path-connected, and semilocallysimply-connected,show: e (a) The components of X are in one-to-one correspondence with the orbits of the actionof (cid:25) (cid:132)X;x (cid:133) onthefiber p −1(cid:132)x (cid:133). 1 0 0 (b) Under the Galois correspondence between connected covering spaces of X and e subgroups of (cid:25) (cid:132)X;x (cid:133), the subgroup corresponding to the component of X 1 0", "rank": 0, "metadata": {"section": "90"}}
