{"chunk_id": "5.2-0", "text": "Introduction to TDA 5.2. Delaunay and Alpha complexes Observation 5.3. Cr(P) ⊆ VR r(P) ⊆ C2r(P). Exercise 5.4. Prove Observation 5.3. Exercise 5.5. Find a point set P ⊂ R2 and a radius r such that its Vietoris-Rips ∼ complex has non-trivial 2-homology, i.e., such that H (VR r(P)) ̸= 0. 2 Furthermore, is there a dimension k such that H (VR r(Q)) = 0 for all k′ ⩾ k, all k′ r > 0, and all point sets Q ⊂ R2? 5.2 Delaunay and Alpha complexes Recall that computing persistent homology takes O(N3) time, where N is the size of the simplicial complex in the filtration. For large enough radii, both the Čech and the Vietoris-Rips complex become complete, and thus contain 2n simplices. Computing persistent homology using those complexes is therefore computationally very expensive, which is why in many applications we would like to have sparser complexes. For data in Rd we can look at the so-called Delaunay triangulation, which only has complexity O(n⌈d/2⌉). Definition 5.6. Given a finite point set P ⊂ Rd, a Delaunay simplex is a geometric simplex whose vertices are in P and lie on the boundary of a ball whose interior contains no points of P. A Delaunay triangulation Del(P) of P is a geometric simplicial complex with the vertex set P where every simplex is a Delaunay simplex and whose underlying space covers the convex hull of P. Given a finite point set P ⊂ Rd, the extended Delaunay complex is the simplicial complex where for every face σ, for d′ ⩽ d, every d′-face of σ is a Delaunay simplex. It is a well-known fact that for a point set in general position (no d+2 points lie on a common sphere), there is a unique Delaunay triangulation. Furthermore, in this case the extended Delaunay complex and this unique Delaunay triangulation coincide. Definition 5.7. Given a finite point set P ⊂ Rd, the Voronoi diagram is the tessellation of Rd into the Voronoi cells V = {x ∈ Rd | d(x,p) ⩽ d(x,q)∀q ∈ P} p for all p ∈ P. Fact 5.8. The nerve of the Voronoi cells of P is the extended Delaunay complex of P. Exercise 5.9. Convince yourself that for a point set in R2, the nerve of the Voronoi diagram is the extended Delaunay complex. Furthermore, convince yourself that if the points are in general position (there are no three points that are collinear, and no four points that are cocircular), then there is a unique Delaunay triangulation. 57", "rank": 0, "metadata": {"section": "5.2"}}
