{"chunk_id": "49-0", "text": "40 Chapter 1 The Fundamental Group ! 20. Suppose f :X X isahomotopysuchthat f and f areeachtheidentitymap. t 0 1 UseLemma1.19toshowthatforanyx 2X,theloopf (cid:132)x (cid:133)representsanelementof 0 t 0 thecenterof (cid:25) (cid:132)X;x (cid:133). [Onecaninterprettheresultassayingthatalooprepresents 1 0 ! anelementofthecenterof (cid:25) (cid:132)X(cid:133) ifitextendstoaloopofmaps X X.] 1 ThevanKampentheoremgivesamethodforcomputingthefundamentalgroups ofspacesthatcanbedecomposedintosimplerspaceswhosefundamentalgroupsare alreadyknown. Bysystematicuseofthistheoremonecancomputethefundamental groupsofaverylargenumberofspaces. Weshallseeforexamplethatforeverygroup G thereisaspace X whosefundamentalgroupisisomorphicto G. G To give some idea of how one might hope to compute fundamental groups by decomposing spaces into simpler pieces, let us look at an example. Consider the space X formed by two circles A and B intersecting in a single point, which we choose as the basepoint x . By our preceding calculations we know that (cid:25) (cid:132)A(cid:133) is 0 1 infinitecyclic,generatedbyaloop a thatgoesoncearound A. Similarly, (cid:25) (cid:132)B(cid:133) is a copy of Z generated by a loop b going b a 1 oncearound B. Eachproductofpowersof a and b thengives an element of (cid:25) (cid:132)X(cid:133). For example, the product a5b2a −3ba2 is the loop that goes 1 fivetimesaround A,thentwicearound B,thenthreetimesaround A intheopposite direction, then once around B, then twice around A. The set of all words like this consistingofpowersof a alternatingwithpowersof b formsagroupusuallydenoted Z(cid:3)Z. Multiplication in this group is defined just as one would expect, for example (cid:132)b4a5b2a −3(cid:133)(cid:132)a4b −1ab3(cid:133)(cid:131)b4a5b2ab −1ab3. Theidentityelementistheemptyword, and inverses are what they have to be, for example (cid:132)ab2a −3b −4(cid:133) −1 (cid:131) b4a3b −2a −1. It would be very nice if such words in a and b corresponded exactly to elements of (cid:25) (cid:132)X(cid:133),sothat (cid:25) (cid:132)X(cid:133) wasisomorphictothegroup Z(cid:3)Z. ThevanKampentheorem 1 1 willimplythatthisisindeedthecase. Similarly, if X is the union of three circles touching at a single point, the van Kampen theorem will imply that (cid:25) (cid:132)X(cid:133) is Z(cid:3)Z(cid:3)Z, the group consisting of words 1 in powers of three letters a, b, c. The generalization to a union of any number of circlestouchingatonepointwillalsofollow. The group Z(cid:3)Z is an example of a general construction called the free product ofgroups. ThestatementofvanKampen’stheoremwillbeintermsoffreeproducts, so before stating the theorem we will make an algebraic digression to describe the constructionoffreeproductsinsomedetail.", "rank": 0, "metadata": {"section": "49"}}
