{"chunk_id": "7.1-0", "text": "Chapter 7 Reeb Graphs and Mapper In this chapter we look at another tool in topological data analysis, called Mapper. The underlying idea of Mapper has its roots in Morse theory, where Georges Reeb defined a graph to summarize a Morse function on a manifold. We first discuss these graphs, called Reeb graphs, and then how to mimic the ideas for the case where instead of a manifold we have point cloud data. Before we dive into the mathematical details, a short remark about the pronunciation of the word “Reeb graph”: Georges Reeb, after whom these graphs are named, was a French mathematician born in the German speaking region Alsace. Thus, he likely pronounced his name the German way, that is, with the “ee” spoken similar to the “ea” in “bear” (as opposed to “beer”). 7.1 Reeb Graphs The idea of Reeb graphs is that given some topological space X, and some function f : X → R , we consider the preimage of f for some fixed value a ∈ R . We place one point per connected path-component of the preimage. We do this for all values in , R and connect the points corresponding to neighboring connected components in adjacent preimages. More formally, Definition 7.1. Let X be some topological space, and f a function f : X → R. Two points x,y are called equivalent (x ∼ y), iff f(x) = f(y) = α and x and y are in the same path-connected component of f−1(α). The Reeb graph R is the quotient space f X/ ∼. We assume all of our functions to be levelset tame for the space X: Definition 7.2. A function f : X → R is levelset tame if • each levelset f−1(α) has finitely many connected components, all of which are path-connected, and 75 Chapter 7. Reeb Graphs and Mapper Introduction to TDA R f : X → X R f Figure 7.1: An example of a Reeb graph • the homology groups of the levelsets only change at finitely many critical val- ues. As we have defined it, the Reeb graph is just a (continuous) topological space. We call it a graph since it is 1-dimensional, but to arrive at a graph as we know it in combinatorics, we will need to discretize it. For this we need to define vertices and edges. There are many different possibilities of defining vertices and edges to discretize the Reeb graph, but we want to define some type of minimal one. Let us look at the neighborhood of some point p in the Reeb graph (as a topological space). We look at how many ways there exist to go from p towards the direction of higher f-value (we call this number the up-degree u), and how many ways to go towards the direction of lower f-value (we call this the down-degree l). Depending on u and l, we classify p as in Table 7.1. Table 7.1: Classifications of points in the Reeb graph. u l Classification 1 1 regular 0 > 0 maximum > 0 0 minimum ⩾ 2 l up-fork u ⩾ 2 down-fork Note that a point can fall into multiple of these classes, for example it can be a maxi- mum and a down-fork simultaneously, or an up-fork and a down-fork simultaneously. We 76 Introduction to TDA 7.1. Reeb Graphs call the minima, maxima, up-forks, and down-forks critical points. Our discretization places vertices at the critical points, and all the connections between critical points (that are made up of only regular points) become the edges of our graph. Note", "rank": 0, "metadata": {"section": "7.1"}}
{"chunk_id": "7.1-1", "text": "maxi- mum and a down-fork simultaneously, or an up-fork and a down-fork simultaneously. We 76 Introduction to TDA 7.1. Reeb Graphs call the minima, maxima, up-forks, and down-forks critical points. Our discretization places vertices at the critical points, and all the connections between critical points (that are made up of only regular points) become the edges of our graph. Note that the graph we get through this process is not necessarily simple, we may have multi-edges. Exercise 7.3. Consider a double torus embedded in R3. You can imagine it as the result of taking the figure depicted in Figure 7.2 embedded in the plane x = 0, 3 replacing every point by a 3-dimensional ball with radius r < min{d/2,R/2}, and taking the boundary of the union of these balls. x 2 R R d x 1 Figure 7.2: The space blown up to a double torus in Exercise 7.3. Draw the Reeb graphs for the functions f (x) = x , f (x) = x , and f (x) = x . 1 1 2 2 3 3 We next consider merge trees and split trees, which are variants of the Reeb graph, where instead of levelsets, we look at sub-level sets or super-level sets. Definition 7.4. Let X be some topological space, and f a function f : X → R. We have x ∼ y for two points x,y, if and only if f(x) = f(y) = α and x and y are in M the same connected component of f−1((−∞,α]). The merge tree T is the quotient M space X/ ∼ . M Note that in the merge tree, since we only increase the space under consideration, we never have a connected component that splits. We can only have new connected components appearing, and connected components merging. This also tells us that the Merge tree (or its discretization) is always a tree. Definition 7.5. Let X be some topological space, and f a function f : X → R. We have x ∼ y for two points x,y, if and only if f(x) = f(y) = α and x and y are in the same S connected component of f−1([α,∞)). The split tree T is the quotient space X/ ∼ . S S To be able to compute Reeb graphs in actual TDA applications, we now look at Reeb graphs in the context of simplicial complexes. We consider a simplicial complex K and a function f : |K| → R , which is piece-wise linear (linear on each simplex). We observe that 77 Chapter 7. Reeb Graphs and Mapper Introduction to TDA the Reeb graph then only depends on the 2-skeleton of K. This is the case since looking at a levelset is the same as cutting through the simplicial complex. When we cut through a simplex, we generally get a simplex of one dimension lower. In a simplicial complex, connectivity is completely determined by the 1-skeleton. Thus, before cutting, the 2- skeleton suffices. We can also see that the critical points are images of the vertices of K. This happens since a connected component can only appear, disappear, split, or merge at some local maximum or minimum of the connected component. Since the function is linear, the maximum or minimum of every simplex is always attained at some vertex. We define the augmented Reeb graph of a simplicial complex with a PL-function, as the discretization of the Reeb graph by placing a vertex for every connected component in all the levelsets for the values a for which f(v) = a for some vertex of the", "rank": 1, "metadata": {"section": "7.1"}}
{"chunk_id": "7.1-2", "text": "linear, the maximum or minimum of every simplex is always attained at some vertex. We define the augmented Reeb graph of a simplicial complex with a PL-function, as the discretization of the Reeb graph by placing a vertex for every connected component in all the levelsets for the values a for which f(v) = a for some vertex of the simplicial complex. Theorem 7.6. Given a simplicial complex K with m faces and a piece-wise linear function f : |K| → R on it, we can compute the augmented Reeb graph R of K with f respect to f in time O(mlogm). Proof. We only have to consider the 2-skeleton of K. To compute the augmented Reeb graph, we perform a discrete sweep (or scan) through K in the order given by f, only stopping at values a such that f(v) = a for some vertex v. In this sweep, we want to keep track of the connected components. For any α ∈ R , the levelset f−1(α) of the 2-skeleton of K is just a graph G : vertices α andedgesofKinduceverticesofG , trianglesinduceedges. Intheopenintervalbetween α any two values a with f(v) = a, G stays the same. In our sweep, we track the graph α G . Whenever we enter a vertex v, faces may end: The vertices in G that correspond α α to edges vw in K with f(v) > f(w) all get merged into a single vertex. Whenever we then exit v, some faces may start. The vertex corresponding to v is split into one vertex per edge vw in K such that f(v) < f(w). Some of these vertices are connected: the vertices corresponding to the edges vw and vx are connected by an edge if vwx is a triangle of K. To build the augmented Reeb graph out of these G graphs, we use a dynamic α spanning forest data structure. Such a data structure can update connected components under both insertion and deletions of edges (vertices we only delete when also deleting all their incident edges). There exist such data structures that can do each update in amortized time O(logm), where m is the size of the graph. The size of the graph is bounded by the sum m of vertices, edges, and triangles in K. Each such feature appears at one point, and disappears at one point, and we thus have at most 2m insertions and deletions in total, giving an O(mlogm) algorithm. Exercise 7.7. Consider a simplicial complex K and a PL (piece-wise linear) function f : |K| → R. What happens to the Reeb graph when you add one additional face to K and extend f accordingly? 78", "rank": 2, "metadata": {"section": "7.1"}}
