{"chunk_id": "28-0", "text": "Exercises Chapter 0 19 circulararcs,andwiththeone-pointcompactificationof X asacross-sectionalslice. Thedesiredspace Y isthenobtainedfromthissubspaceof R3 bywrappingonemore coneontheCantorsetaroundtheboundaryofthedisk. 8. For n>2,constructan n roomanalogofthehousewithtworooms. 9. Showthataretractofacontractiblespaceiscontractible. ! 10. Show that a space X is contractible iff every map f:X Y, for arbitrary Y, is ! nullhomotopic. Similarly, show X is contractible iff every map f:Y X is nullho- motopic. ! ! 11. Show that f:X Y is a homotopy equivalence if there exist maps g;h:Y X such that fg ’ 11 and hf ’ 11. More generally, show that f is a homotopy equiva- lenceif fg and hf arehomotopyequivalences. ! 12. Showthatahomotopyequivalence f:X Y inducesabijectionbetweentheset ofpath-componentsofX andthesetofpath-componentsofY,andthatf restrictsto ahomotopyequivalencefromeachpath-componentof X tothecorrespondingpath- componentof Y. Provealsothecorrespondingstatementswithcomponentsinstead of path-components. Deduce that if the components of a space X coincide with its path-components,thenthesameholdsforanyspace Y homotopyequivalentto X. 13. Show that any two deformation retractions r0 and r1 of a space X onto a t t subspace A can be joined by a continuous family of deformation retractions rs, t ! 0(cid:20)s (cid:20)1, of X onto A, where continuity means that the map X(cid:2)I(cid:2)I X sending (cid:132)x;s;t(cid:133) to rs(cid:132)x(cid:133) iscontinuous. t 14. Given positive integers v, e, and f satisfying v −e(cid:130)f (cid:131) 2, construct a cell structureon S2 having v 0 cells, e 1 cells,and f 2 cells. 15. Enumerateallthesubcomplexesof S 1 ,withthecellstructureon S 1 thathas Sn asits n skeleton. 1 16. Showthat S iscontractible. ! 17. (a)Showthatthemappingcylinderofeverymap f:S1 S1 isaCWcomplex. (b)Constructa 2 dimensionalCWcomplexthatcontainsbothanannulus S1(cid:2)I and aM¨obiusbandasdeformationretracts. 18. Showthat S1(cid:3)S1 (cid:131)S3,andmoregenerally Sm(cid:3)Sn (cid:131)Sm(cid:130)n(cid:130)1. 19. Showthatthespaceobtainedfrom S2 byattaching n 2 cellsalonganycollection of n circlesin S2 ishomotopyequivalenttothewedgesumof n(cid:130)1 2 spheres. 20. Show that the subspace X (cid:26) R3 formed by a Klein bottle intersectingitselfinacircle, asshowninthefigure, ishomotopy equivalentto S1_S1_S2. 21. If X is a connected space that is a union of a finite number of 2 spheres, any twoofwhichintersectinatmostonepoint,showthat X ishomotopyequivalenttoa wedgesumof S1’sand S2’s.", "rank": 0, "metadata": {"section": "28"}}
