{"chunk_id": "3.2.2-0", "text": "Chapter 3. Homology Introduction to TDA Commutativity follows from + in R being commutative (recall that for any ring (R,+,·), (R,+)isanabeliangroup), thusthegroupisabelian. Finally, thep-simplicesclearlyform a basis since the set of chains is defined as the set of formal sums of these p-simplices. We can further turn C (K) into an R-module: p Observation3.19. Equipped with the appropriate function · : R×C (K) → C (K), C (K) p p p is an R-module. Proof (sketch). We can define r·c by simply using the multiplication · of R component- (cid:80) (cid:80) wise on each coefficient of c, i.e., r· mp α σ = mp (r·α )σ . We leave the proof of i=1 i i i=1 i i the necessary properties as an exercise. From now on we will always work with one of the simplest possible rings, the ring R = Z . In particular this allows us to simply view chains as sets of p-simplices, the sum 2 of chains being their symmetric differences, and we get the nice identity c+c = 0. With R = Z , we will define homology over Z , often also just called Z -homology. Using 2 2 2 some slightly more abstract definitions, all of the following can be extended to define homology over any ring R. For more on this, we refer to any textbook on algebraic topology, e.g., the one by Hatcher [2]. 3.2.2 Boundary Maps Now that we can talk algebraically about sets of p-simplices, we can now formalize the notion of the boundary. It should be intuitively clear what the boundary of a single p-simplex should be: just take the (p−1)-chain formed by its facets. More formally, let σ = {v ,...,v } be a p-simplex. Then, δ (σ) is defined by 0 p p (cid:88)p {v ,...,v }+{v ,v ,...,v }+...+{v ,...,v } = {v ,...,vˆ,...,v } 1 p 0 2 p 0 p−1 0 i p i=0 In the above notation, vˆ denotes that the element v is omitted from the set. Note that i i δ (σ) is indeed a (p−1)-chain. For some examples, see Figure 3.6. p 3 3 δ ( ) = + + ≈ 2 1 2 1 2 δ ( ) = 0 0 Figure 3.6: The boundary chains of two different simplices. We have seen that δ is a map that sends a p-simplex to a (p − 1)-chain. Thanks p to the group structure of the chain group, we can now immediately extend this to any 34 Introduction to TDA 3.2. Homology chain. After this extension, δ defines a map from C (K) to C (K): p p p−1 δ : C (K) → C (K) p(cid:88)p p−1 (cid:88) c = α σ (cid:55)→ δ (c) = α (δ (σ )) i i p i p i It is easy to prove that δ is a group homomorphism, and we call it the boundary operator homomorphism. Let us apply this definition to the following example. In a slight abuse of notation in favor of legibility, we denote faces {a,b,c} by abc. d b a e c δ (abc+bcd) = δ (abc)+δ (bcd) 2 2 2 = (ab+bc+ac)+(bc+cd+bd) = ab+ac+cd+bd δ (abc+bcd+bce) = (ab+bc+ac)+(bc+cd+bd)+(bc+ce+be) 2 = ab+bc+ac+cd+bd+ce+be We can see that an edge is in the boundary of a chain of triangles exactly if it is contained in an odd number of triangles of the chain, thanks to the fact that we use addition in Z . 2 We have already seen that cycles can be boundaries. On the flipside we have also seen that the boundary of a simplex", "rank": 0, "metadata": {"section": "3.2.2"}}
{"chunk_id": "3.2.2-1", "text": "that an edge is in the boundary of a chain of triangles exactly if it is contained in an odd number of triangles of the chain, thanks to the fact that we use addition in Z . 2 We have already seen that cycles can be boundaries. On the flipside we have also seen that the boundary of a simplex should have no boundary (i.e., it should be a cycle), where the interior of the simplex fills up the cavity given by its boundary. The following lemma generalizes this to boundaries of any chain: It states that the boundary of any boundary is empty. Lemma 3.20. For p > 0, δ ◦δ (c) = 0, for any p-chain c. p−1 p In the example above, δ (δ (abc+bcd)) = (a+b)+(a+c)+(c+d)+(b+d) = 0. 1 2 (cid:80) Proof. It is enough to show this for simplices, as δ ◦δ (c) = δ ( α (δ (σ ))) = (cid:80) p−1 p p−1 i p i α (δ ◦δ (σ )). For a p-simplex σ, every (p−2)-face of σ is contained in exactly 2 i p−1 p i (p−1)-faces of σ, and does thus not appear in δ ◦δ (σ). p−1 p 35", "rank": 1, "metadata": {"section": "3.2.2"}}
