{"chunk_id": "55-0", "text": "46 Chapter 1 The Fundamental Group If γ isapathin I(cid:2)I fromtheleftedgetotherightedge,thentherestriction F jjγ isaloopatthebasepoint x since F mapsboththeleftandrightedgesof I(cid:2)I to x . 0 0 Let γ be the path separating the first r rectangles R ;(cid:1)(cid:1)(cid:1);R from the remaining r 1 r rectangles. Thus γ is the bottom edge of I(cid:2)I and γ is the top edge. We pass 0 mn from γ r to γ r(cid:130)1 bypushingacrosstherectangle R r(cid:130)1 . Letuscallthecornersofthe R ’svertices. Foreachvertex v with F(cid:132)v(cid:133)(cid:148)x ,let r 0 g beapathfromx toF(cid:132)v(cid:133). Wecanchooseg tolieintheintersectionofthetwoor v 0 v three A ’scorrespondingtothe R ’scontaining v sinceweassumetheintersection ij r of any two or three A ’s is path-connected. If we insert into F jjγ the appropriate ij r paths g g atsuccessivevertices,asintheproofofsurjectivityof(cid:216),thenweobtaina v v factorizationof(cid:134)F jjγ (cid:135)byregardingtheloopcorrespondingtoahorizontalorvertical r segmentbetweenadjacentverticesaslyinginthe A foreitherofthe R ’scontaining ij s the segment. Different choices of these containing R ’s change the factorization of s (cid:134)F jjγ (cid:135) to an equivalent factorization. Furthermore, the factorizations associated to r successive paths γ r and γ r(cid:130)1 are equivalent since pushing γ r across R r(cid:130)1 to γ r(cid:130)1 changes F jjγ r to F jjγ r(cid:130)1 by a homotopy within the A ij corresponding to R r(cid:130)1 , and wecanchoosethis A ij forallthesegmentsof γ r and γ r(cid:130)1 in R r(cid:130)1 . Wecanarrangethatthefactorizationassociatedto γ isequivalenttothefactor- 0 ization (cid:134)f (cid:135)(cid:1)(cid:1)(cid:1)(cid:134)f (cid:135) bychoosingthepath g foreachvertex v alongtheloweredge 1 k v of I(cid:2)I tolienotjustinthetwo A ’scorrespondingtothe R ’scontaining v,butalso ij s tolieinthe A forthe f containing v initsdomain. Incase v isthecommonend- (cid:11) i pointofthedomainsoftwoconsecutive f ’swehave F(cid:132)v(cid:133)(cid:131)x ,sothereisnoneed i 0 to choose a g . In similar fashion we may assume that the factorization associated v to the final γ is equivalent to (cid:134)f 0 (cid:135)(cid:1)(cid:1)(cid:1)(cid:134)f 0 (cid:135). Since the factorizations associated mn 1 ‘ to all the γ ’s are equivalent, we conclude that the factorizations (cid:134)f (cid:135)(cid:1)(cid:1)(cid:1)(cid:134)f (cid:135) and r 1 k (cid:134)f 0 (cid:135)(cid:1)(cid:1)(cid:1)(cid:134)f 0 (cid:135) areequivalent. tu 1 ‘ Example 1.23: Linking of Circles. WecanapplyvanKampen’stheoremtocalculate thefundamentalgroupsofthreespacesdiscussedintheintroductiontothischapter, thecomplementsin R3 ofasinglecircle,twounlinkedcircles,andtwolinkedcircles. Thecomplement R3−A ofasinglecircle A deformationretractsontoawedgesum S1_S2 embeddedin R3−A asshowninthefirstofthe A A twofiguresattheright. Itmaybeeasiertosee thatR3−Adeformationretractsontotheunion of S2 with a diameter, as in the second figure, wherepointsoutside S2 deformationretractonto S2,andpointsinside S2 andnotin A can be pushed away from A toward S2 or the diameter. Having this deformation retraction in mind, one can then see how it must be modified if the two endpoints of the diameter are gradually moved toward each other along the equator until they coincide,formingthe S1 summandof S1_S2. Anotherwayofseeingthedeformation", "rank": 0, "metadata": {"section": "55"}}
