{"chunk_id": "65-0", "text": "56 Chapter 1 The Fundamental Group We come now to the second main topic of this chapter, covering spaces. We have in fact already encountered one example of a covering space in our calculation ! of (cid:25) (cid:132)S1(cid:133). This was the map R S1 that we pictured as the projection of a helix 1 onto a circle, with the helix lying above the circle, ‘covering’ it. A number of things we proved for this covering space are valid for all covering spaces, and this allows coveringspacestoserveasausefulgeneraltoolforcalculatingfundamentalgroups. But the connection between the fundamental group and covering spaces runs much deeperthanthis,andinmanywaystheycanberegardedastwoviewpointstowardthe same thing. This means that algebraic features of the fundamental group can often be translated into the geometric language of covering spaces. This is exemplified in one of the main results in this section, giving an exact correspondence between the various connected covering spaces of a given space X and subgroups of (cid:25) (cid:132)X(cid:133). 1 ThisisstrikinglyreminiscentofGaloistheory,withitscorrespondencebetweenfield extensionsandsubgroupsoftheGaloisgroup. e Let us begin with the definition. A covering space of a space X is a space X e! together with a map p:X X satisfying the following condition: There exists an opencover fU g of X suchthatforeach (cid:11), p −1(cid:132)U (cid:133) isadisjointunionofopensets (cid:11) (cid:11) e in X, eachofwhichismappedby p homeomorphicallyonto U . Wedonotrequire (cid:11) p −1(cid:132)U (cid:133) tobenonempty,so p neednotbesurjective. (cid:11) ! In the helix example one has p:R S1 given by p(cid:132)t(cid:133) (cid:131) (cid:132)cos2(cid:25)t;sin2(cid:25)t(cid:133), and the cover fU g can be taken to consist of any two open arcs whose union is S1. (cid:11) A related example is the helicoid surface S (cid:26) R3 consisting of points of the form (cid:132)scos2(cid:25)t;ssin2(cid:25)t;t(cid:133) for (cid:132)s;t(cid:133) 2 (cid:132)0;1(cid:133)(cid:2)R. This projects onto R2 −f0g via the map (cid:132)x;y;z(cid:133) , (cid:132)x;y(cid:133),andthisprojectiondefinesacoveringspace p:S ! R2−f0g sinceforeachopendisk U in R2−f0g, p −1(cid:132)U(cid:133) consistsofcountablymanydisjoint opendisksin S,eachmappedhomeomorphicallyonto U by p. ! Another example is the map p:S1 S1, p(cid:132)z(cid:133) (cid:131) zn where we view z as a complex number with jzj (cid:131) 1 and n is any positive integer. The closest one can come to realizing this covering space asalinearprojectionin 3 spaceanalogoustotheprojectionofthe p helix is to draw a circle wrapping around a cylinder n times and intersecting itself in n−1 points that one has to imagine are not really intersections. For an alternative picture without this defect, embed S1 in the boundary torus of a solid torus S1(cid:2)D2 so that it winds n times monotonically around the S1 factor without self-intersections, then restrict the pro- ! jection S1(cid:2)D2 S1(cid:2)f0g tothisembeddedcircle. ThefigureforExample1.29inthe precedingsectionillustratesthecase n(cid:131)3.", "rank": 0, "metadata": {"section": "65"}}
