{"chunk_id": "7-0", "text": "x Preface constraintsofafirstcourse. Altogether,theseadditionaltopicsamounttonearlyhalf thebook,andtheyareincludedherebothtomakethebookmorecomprehensiveand togivethereaderwhotakesthetimetodelveintothemamoresubstantialsampleof thetruerichnessandbeautyofthesubject. Not included in this book is the important but somewhat more sophisticated topic of spectral sequences. It was very tempting to include something about this marvelous tool here, but spectral sequences are such a big topic that it seemed best tostartwiththemafreshinanewvolume. Thisistentativelytitled‘SpectralSequences inAlgebraicTopology’andisreferredtohereinas[SSAT].Thereisalsoathirdbookin progress,onvectorbundles,characteristicclasses,andK–theory,whichwillbelargely independent of [SSAT] and also of much of the present book. This is referred to as [VBKT],itsprovisionaltitlebeing‘VectorBundlesandK–Theory.’ Intermsofprerequisites,thepresentbookassumesthereaderhassomefamiliar- ity with the content of the standard undergraduate courses in algebra and point-set topology. In particular, the reader should know about quotient spaces, or identifi- cation spaces as they are sometimes called, which are quite important for algebraic topology. Good sources for this concept are the textbooks [Armstrong 1983] and [J¨anich1984]listedintheBibliography. Abooksuchasthisone,whoseaimistopresentclassicalmaterialfromarather classicalviewpoint,isnottheplacetoindulgeinwildinnovation. Thereis,however, onesmallnoveltyintheexpositionthatmaybeworthcommentingupon,eventhough inthebookasawholeitplaysarelativelyminorrole. Thisistheuseofwhatwecall (cid:209) complexes, which are a mild generalization of the classical notion of a simplicial complex. Theideaistodecomposeaspaceintosimplicesallowingdifferentfacesof a simplex to coincide and dropping the requirement that simplices are uniquely de- terminedbytheirvertices. Forexample,ifonetakesthestandardpictureofthetorus as a square with opposite edges identified and divides the square into two triangles by cutting along a diagonal, then the result is a (cid:209) complex structure on the torus having2triangles,3edges,and1vertex. Bycontrast,asimplicialcomplexstructure onthetorusmusthaveatleast14triangles,21edges,and7vertices. So (cid:209) complexes provideasignificantimprovementinefficiency,whichisnicefromapedagogicalview- point since it cuts down on tedious calculations in examples. A more fundamental reasonforconsidering (cid:209) complexesisthattheyseemtobeverynaturalobjectsfrom the viewpoint of algebraic topology. They are the natural domain of definition for simplicialhomology,andanumberofstandardconstructionsproduce (cid:209) complexes ratherthansimplicialcomplexes,forinstancethesingularcomplexofaspace,orthe classifyingspaceofadiscretegrouporcategory. Historically, (cid:209) complexeswerefirst introduced by Eilenberg and Zilber in 1950 under the name of semisimplicial com- plexes. Thistermlatercametomeansomethingdifferent,however,andtheoriginal notionseemstohavebeenlargelyignoredsince.", "rank": 0, "metadata": {"section": "7"}}
