{"chunk_id": "2.2-0", "text": "Introduction to TDA 2.2. Metric Spaces Definition 2.6. A topological space (X,T) is disconnected, if there are two disjoint non- empty open sets U,V ∈ T, such that X = U∪V. A topological space is connected, if it is not disconnected. Exercise 2.7. In this exercise, we will use topology to prove that the set of primes is infinite. We define the sets S(a,b) as follows: S(a,b) := {an+b | n ∈ Z}, ∀a ∈ Z\\{0},b ∈ Z We then say that a set U ⊆ Z is open, if and only if for all x ∈ U, there exists a ∈ Z such that S(a,x) ⊆ U. This is equivalent to saying that every open set U is a union of zero or more (including infinitely many) sets S(a,b). (a) Show that this defines a topology on Z. (b) Let A ⊂ Z be finite and non-empty. Show that Z\\A cannot be closed. (c) Show that S(a,b) is both open and closed. (d) Show that (cid:91) S(p,0) = Z\\{−1,1} p prime (e) Conclude that there are infinitely many primes. 2.2 Metric Spaces Recall that topological spaces should capture neighborhoods of points without requiring the notion of a distance. However, if we do have distances, we should still be able to use the framework of topological spaces. In other words, topological spaces should be a generalization of spaces with distances. Definition 2.8. A metric space (X,d) is a set X of points and a distance function d : X×X → R satisfying 1. d(p,q) = 0 if and only if p = q. 2. d(p,q) = d(q,p), ∀p,q ∈ X. (Symmetry) 3. d(p,q) ⩽ d(p,s)+d(s,q), ∀p,q,s ∈ X. (Triangle inequality) Note that these three conditions imply that d(p,q) ⩾ 0 for all p,q ∈ X: If some distance d(p,q) would be negative, we would have 0 = d(p,p) ⩽ d(p,q) + d(q,p) = 2·d(p,q) < 0, a contradiction. Fact 2.9. Every metric space has a topology (the metric space topology) given by the open metric balls B(c,r) = {p ∈ X | d(p,c) < r} and their unions. 13", "rank": 0, "metadata": {"section": "2.2"}}
