{"chunk_id": "7.2.2-0", "text": "Introduction to TDA 7.2. Distances for Reeb Graphs 7.2.2 Functional Distortion Distance As mentioned above, the functional distortion distance is motivated by the Gromov- Hausdorff distance for metric spaces. Thus, the first step is to define a metric on a single Reeb graph. Definition 7.24. Let R be a Reeb graph of a space X, and u,v ∈ R (in the same f f connected component of R ), and let π be a path from u to v. We define the height f of π as height(π) = max f(x)−min f(x). To turn this into a distance metric, x∈π x∈π we consider Π(u,v),the set of all paths between u and v. Then, the function induced metric on R is defined as f d (u,v) = min height(π). f π∈Π(u,v) In a sense, d (u,v) is the “thickness” of the thinnest “slice” of the space X in which u f and v are connected. Definition 7.25 (Functional distortion distance). Let R and R be two Reeb graphs. Let f g Φ : R → R , Ψ : R → R be continuous functions, but not necessarily function- f g g f preserving. Then, we define correspondence and distortion: C(Φ,Ψ) = {(x,y) ∈ R ×R | Φ(x) = y or x = Ψ(y)} f g 1 D(Φ,Ψ) = sup |d (x,x′)−d (y,y′)|. f g 2 (x,y),(x′,y′)∈C(Φ,Ψ) And finally, we define the functional distortion distance, d (R ,R ) = inf max{D(Φ,Ψ),||f−(g◦Φ)|| ,||g−(f◦Ψ)|| }. FD f g ∞ ∞ Φ,Ψ Also for this distance measure there is a stability theorem. Theorem 7.26. Let f,g : X → R be tame functions. Then, d FD (R f ,R g ) ⩽ ||f−g|| ∞ . We can also quantify the relation between the two discussed distances. Theorem 7.27. d (R ,R ) ⩽ d (R ,R ) ⩽ 3d (R ,R ). I f g FD f g I f g Exercise 7.28. Consider a merge tree T with regards to a function f. We define the a-shift xa for any x ∈ T to be the unique “ancestor” of x with function value f(xa) = f(x)+a. We now consider two merge trees; T with regards to f, and T with regards to 1 2 g. We call T and T ϵ-compatible if there exist maps α : T → T and β : T → T 1 2 1 2 2 1 such that we get the following commutativities: • g(α(x)) = f(x)+ϵ for all x ∈ T 1 83", "rank": 0, "metadata": {"section": "7.2.2"}}
