{"chunk_id": "58-0", "text": "Van Kampen’s Theorem Section 1.2 49 by this element lies in the center. In particular, C is a normal subgroup, so we can pass to the quotient group G =C, which is the free product Z (cid:3)Z . According m;n m n toExercise1attheendofthissection,afreeproductofnontrivialgroupshastrivial center. From this it follows that C is exactly the center of G . As we will see in m;n Example1.44,theelements a and b haveinfiniteorderin G ,so C isinfinitecyclic, m;n butwewillnotneedthisfacthere. We will show now that the integers m and n are uniquely determined by the group Z (cid:3)Z , hence also by G . The abelianization of Z (cid:3)Z is Z (cid:2)Z , of m n m;n m n m n order mn,sotheproduct mn isuniquelydeterminedby Z (cid:3)Z . Todetermine m m n and n individually,weuseanotherassertionfromExercise1attheendofthesection, thatalltorsionelementsof Z (cid:3)Z areconjugatetoelementsofthesubgroups Z m n m and Z , hence have order dividing m or n. Thus the maximum order of torsion n elements of Z (cid:3)Z is the larger of m and n. The larger of these two numbers is m n thereforeuniquelydeterminedbythegroup Z (cid:3)Z ,hencealsothesmallersincethe m n productisuniquelydetermined. Theprecedinganalysisof (cid:25) (cid:132)X (cid:133) didnotneedtheassumptionthat m and n 1 m;n arerelativelyprime,whichwasusedonlytorelate X totorusknots. Aninteresting m;n fact is that X can be embedded in R3 only when m and n are relatively prime. m;n ThisisshownintheremarksfollowingCorollary3.45. Forexample, X istheKlein 2;2 bottlesinceitistheunionoftwocopiesoftheM¨obiusband X withtheirboundary 2 circles identified, so this nonembeddability statement generalizes the fact that the Kleinbottlecannotbeembeddedin R3. Analgorithmforcomputingapresentationfor(cid:25) (cid:132)R3−K(cid:133)foranarbitrarysmooth 1 orpiecewiselinearknot K isdescribedintheexercises,buttheproblemofdetermin- ing when two of these fundamental groups are isomorphic is generally much more difficultthaninthespecialcaseoftorusknots. Example 1.25: The Shrinking Wedge of Circles. Considerthesub- space X (cid:26) R2 that is the union of the circles C of radius 1= and n n center (cid:132)1= ;0(cid:133) for n (cid:131) 1;2;(cid:1)(cid:1)(cid:1). At first glance one might confuse n X withthewedgesumofaninfinitesequenceofcircles,butwewill show that X has a much larger fundamental group than the wedge ! sum. Considertheretractions r :X C collapsingall C ’sexcept C totheorigin. n n i n ! Each r induces a surjection (cid:26) :(cid:25) (cid:132)X(cid:133) (cid:25) (cid:132)C (cid:133) (cid:25) Z, where we take the origin as n n 1 1 n Q ! the basepoint. The product of the (cid:26) n ’s is a homomorphism (cid:26):(cid:25) 1 (cid:132)X(cid:133) 1 Z to the directproduct(notthedirectsum)ofinfinitelymanycopiesof Z,and (cid:26) issurjective ! sinceforeverysequenceofintegers k wecanconstructaloop f:I X thatwraps n k n timesaround C n inthetimeinterval(cid:134)1−1= n ;1−1= n(cid:130)1 (cid:135). Thisinfinitecomposition ofloopsiscertainlycontinuousateachtimelessthan 1,anditiscontinuousattime 1 sinceeveryneighborhoodofthebasepointin X containsallbutfinitelymanyofthe Q circles C n . Since (cid:25) 1 (cid:132)X(cid:133) maps onto the uncountable group 1 Z, it is uncountable.", "rank": 0, "metadata": {"section": "58"}}
