{"chunk_id": "20-0", "text": "Two Criteria for Homotopy Equivalence Chapter 0 11 Collapsing Subspaces The operation of collapsing a subspace to a point usually has a drastic effect on homotopy type, but one might hope that if the subspace being collapsed already hasthehomotopytypeofapoint,thencollapsingittoapointmightnotchangethe homotopytypeofthewholespace. Hereisapositiveresultinthisdirection: If(cid:132)X;A(cid:133)isaCWpairconsistingofaCWcomplexX andacontractiblesubcomplexA, ! thenthequotientmap X X=A isahomotopyequivalence. AproofwillbegivenlaterinProposition0.17,butfornowletuslookatsomeexamples showinghowthisresultcanbeapplied. Example0.7: Graphs. Thethreegraphs arehomotopyequivalentsince each is a deformation retract of a disk with two holes, but we can also deduce this from the collapsing criterion above since collapsing the middle edge of the first and thirdgraphsproducesthesecondgraph. Moregenerally,suppose X isanygraphwithfinitelymanyverticesandedges. If thetwoendpointsofanyedgeof X aredistinct,wecancollapsethisedgetoapoint, producingahomotopyequivalentgraphwithonefeweredge. Thissimplificationcan be repeated until all edges of X are loops, and then each component of X is either anisolatedvertexorawedgesumofcircles. This raises the question of whether two such graphs, having only one vertex in each component, can be homotopy equivalent if they are not in fact just isomorphic graphs. Exercise 12 at the end of the chapter reduces the question to the case of W connectedgraphs. Thenthetaskistoprovethatawedgesum S1 ofmcirclesisnot W m homotopyequivalentto S1 if m(cid:148)n. Thissortofthingishardtododirectly. What n onewouldlikeissomesortofalgebraicobjectassociatedtospaces, dependingonly W W ontheirhomotopytype,andtakingdifferentvaluesfor S1 and S1 if m(cid:148)n. In W m n facttheEulercharacteristicdoesthissince S1 hasEulercharacteristic 1−m. Butit m isarathernontrivialtheoremthattheEulercharacteristicofaspacedependsonlyon itshomotopytype. Adifferentalgebraicinvariantthatworksequallywellforgraphs, andwhoserigorousdevelopmentrequireslesseffortthantheEulercharacteristic,is thefundamentalgroupofaspace,thesubjectofChapter1. Example 0.8. Consider the space X obtained from S2 by attaching the two ends of an arc A totwodistinctpointsonthesphere,saythe north and south poles. Let B be an arc in S2 A X=A joiningthetwopointswhere A attaches. Then B X can be given a CW complex structure with the two endpoints of A and B as 0 cells, the X interiorsof A and B as 1 cells,andtherestof X=B S2 asa 2 cell. Since A and B arecontractible,", "rank": 0, "metadata": {"section": "20"}}
