{"chunk_id": "5.1-0", "text": "Chapter 5 Simplicial Complexes on Point Clouds In general, the data we wish to analyze will not come in the form of a simplicial filtration, so in order to use persistent homology we need to transform our data into one. Ideally, the way we do this should retain the underlying shape of the data we want to analyze. In this section we discuss several ways of constructing simplicial complexes from point cloud data, and more generally, from finite metric spaces (i.e., a finite set of data points with given pairwise distances). 5.1 Čech and Vietoris-Rips complexes Definition 5.1. Given a metric space (M,d), a finite point set P ⊆ M, and a real number radius r > 0, the Čech complex Cr(P) is defined as the nerve of the set of balls B(p,r) = {x ∈ M | d(p,x) ⩽ r} for all p ∈ P. The Čech complex has the nice property that (at least for some metric spaces M including Euclidean space Rd) by the Nerve theorem, it is homotopy equivalent to the union of the balls B(p,r). In particular, for nice radii, it will capture the underlying shape. Sadly, checking whether a large number of balls have a common intersection can be computationally expensive. Further, the definition requires that the data points are embedded in a metric space. These two issues motivate the next definition. Definition 5.2. Given a finite metric space (P,d) and a real number radius r > 0, the Vietoris-Rips complex VR r(P) is defined as the simplicial complex containing a simplex σ if and only if d(p,q) ⩽ 2r for every pair p,q ∈ σ. Clearly, for finite subsets of metric spaces, by definition, the Čech complex and the Vietoris-Rips complex for the same radius and the same point set have the same set of 1-simplices (the same 1-skeleton). While the Čech complex then contains additional information about the common intersections of balls, the Vietoris-Rips complex is simply the clique complex of this 1-skeleton. This makes the Vietoris-Rips complex easier to compute. Furthermore, we make the following simple observation, showing that the Vietoris-Rips complex still approximately captures shapes in the data: 56", "rank": 0, "metadata": {"section": "5.1"}}
