{"chunk_id": "41-0", "text": "32 Chapter 1 The Fundamental Group Proof: Supposeonthecontrarythat h(cid:132)x(cid:133)(cid:148)x forall x2D2. ! Then we can define a map r:D2 S1 by letting r(cid:132)x(cid:133) be the pointof S1 wheretherayin R2 startingat h(cid:132)x(cid:133) andpassing h(cid:132)x(cid:133) through x leaves D2. Continuityof r isclearsincesmallper- x turbations of x produce small perturbations of h(cid:132)x(cid:133), hence r(cid:132)x(cid:133) alsosmallperturbationsoftheraythroughthesetwopoints. The crucial property of r, besides continuity, is that r(cid:132)x(cid:133)(cid:131)x if x 2S1. Thus r is aretractionof D2 onto S1. Wewillshowthatnosuchretractioncanexist. Let f beanyloopin S1. In D2 thereisahomotopyof f toaconstantloop,for 0 0 example the linear homotopy f (cid:132)s(cid:133) (cid:131) (cid:132)1−t(cid:133)f (cid:132)s(cid:133)(cid:130)tx where x is the basepoint t 0 0 0 of f . Since the retraction r is the identity on S1, the composition rf is then a 0 t homotopy in S1 from rf (cid:131) f to the constant loop at x . But this contradicts the 0 0 0 factthat (cid:25) (cid:132)S1(cid:133) isnonzero. tu 1 ThistheoremwasfirstprovedbyBrouweraround1910,oneoftheearlytriumphs of algebraic topology. Brouwer in fact proved the corresponding result for Dn, and weshallobtainthisgeneralizationinCorollary2.11usinghomologygroupsinplace of (cid:25) . One could also use the higher homotopy group (cid:25) . Brouwer’s original proof 1 n used neither homology nor homotopy groups, which had not been invented at the ! time. Insteaditusedthenotionofdegreeformaps Sn Sn,whichweshalldefinein x2.2usinghomologybutwhichBrouwerdefineddirectlyinmoregeometricterms. Theseproofsareallargumentsbycontradiction,andsotheyshowjusttheexis- tence of fixed points without giving any clue as to how to find one in explicit cases. Our proof of the Fundamental Theorem of Algebra was similar in this regard. There exist other proofs of the Brouwer fixed point theorem that are somewhat more con- structive, for example the elegant and quite elementary proof by Sperner in 1928, whichisexplainedverynicelyin[Aigner-Ziegler1999]. Thetechniquesusedtocalculate (cid:25) (cid:132)S1(cid:133) canbeappliedtoprovetheBorsuk–Ulam 1 theoremindimensiontwo: T heorem1.10. Foreverycontinuousmapf:S2 ! R2 thereexistsapairofantipodal points x and −x in S2 with f(cid:132)x(cid:133)(cid:131)f(cid:132)−x(cid:133). Itmaybethatthereisonlyonesuchpairofantipodalpoints x, −x,forexample if f issimplyorthogonalprojectionofthestandardsphere S2 (cid:26)R3 ontoaplane. ! TheBorsuk–Ulamtheoremholdsalsoformaps Sn Rn,asweshowinProposi- tion2B.6. Theprooffor n(cid:131)1 iseasysincethedifference f(cid:132)x(cid:133)−f(cid:132)−x(cid:133) changessign as x goeshalfwayaroundthecircle,hencethisdifferencemustbezeroforsome x. For n (cid:21) 2 the theorem is certainly less obvious. Is it apparent, for example, that at every instant there must be a pair of antipodal points on the surface of the earth havingthesametemperatureandthesamebarometricpressure?", "rank": 0, "metadata": {"section": "41"}}
