{"chunk_id": "71-0", "text": "62 Chapter 1 The Fundamental Group When we say a space has a certain property locally, such as being locally path- connected, we shall mean that each point has arbitrarily small open neighborhoods withthisproperty. Thusfor Y tobelocallypath-connectedmeansthatforeachpoint y 2 Y and each neighborhood U of y there is an open neighborhood V (cid:26) U of y that is path-connected. Some authors weaken the requirement that V be path- connected to the condition that any two points in V be joinable by a path in U. This broader definition would work just as well for our purposes, necessitating only small adjustments in the proofs, but for simplicity we shall use the more restrictive definition. Proof: The ‘only if’ statement is obvious since f(cid:3) (cid:131) p(cid:3)f e (cid:3). For the converse, let y 2 Y and let γ be a path in Y from y to y. The path fγ in X starting at x 0 0 has a unique lift f g γ starting at xe . Define f e (cid:132)y(cid:133) (cid:131) f g γ(cid:132)1(cid:133). To show this is well- 0 0 defined,independentofthechoiceof γ,let γ beanotherpathfrom y to y. Then (cid:0) (cid:1) (cid:0) 0 (cid:1) (cid:132)fγ 0 (cid:133) (cid:132)fγ(cid:133) is a loop h 0 at x 0 with (cid:134)h 0 (cid:135) 2 f(cid:3) (cid:25) 1 (cid:132)Y;y 0 (cid:133) (cid:26) p(cid:3) (cid:25) 1 (cid:132)X e ;xe 0 (cid:133) . This meansthereisahomotopy h of h toaloop h thatliftstoa loop h e in X e based at xe . Ap t ply th 0 e covering h 1 omotopy f g (cid:176)0 f f (y) 1 0 e e propertytoh togetaliftingh . Sinceh isaloopat t t 1 f xe , so is h e . Bytheuniquenessofliftedpaths, x 0 f g (cid:176) 0 0 the first half of h e 0 is f g γ0 and the second f f p g h th a e lf c i o s m f m γ o t n ra m ve i r d s p e o d in b t ac f g k γ w (cid:132) a 1 r (cid:133) d (cid:131) s, with (cid:176)0 f f(cid:176)0 f(y) y f g γ0(cid:132)1(cid:133). This shows that f e is y 0 x (cid:176) 0 f(cid:176) well-defined. Toseethat f e iscontinuous,let U (cid:26)X beanopenneighborhoodof f(cid:132)y(cid:133) having a lift U e (cid:26) X e containing f e (cid:132)y(cid:133) such that p:U e! U is a homeomorphism. Choose a path-connected open neighborhood V of y with f(cid:132)V(cid:133) (cid:26) U. For paths from y to 0 points y 0 2 V we can take a fixed path γ from y to y followed by paths (cid:17) in 0 0 g g V from y to the points y . Then the paths (cid:132)fγ(cid:133) (cid:132)f(cid:17)(cid:133) in X have lifts (cid:132)fγ(cid:133) (cid:132)f(cid:17)(cid:133) where f g (cid:17)(cid:131)p −1f(cid:17) and p −1:U ! U e istheinverseof p:U e! U. Thus f e (cid:132)V(cid:133)(cid:26)U e and f ejV (cid:131)p −1f,hence f e iscontinuousat y. tu An example showing the necessity of the local path-connectedness assumption on Y isdescribedinExercise7attheendofthissection. Nextwehavetheuniqueliftingproperty: P roposition 1.34. Givenacoveringspace p:X e! X andamap f:Y ! X withtwo e e !e lifts f ;f :Y X thatagreeatonepointof Y,thenif Y isconnected,thesetwolifts 1 2 mustagreeonallof Y. Proof: For a point y 2 Y, let U be an open neighborhood of f(cid:132)y(cid:133) in X for which p −1(cid:132)U(cid:133) is a disjoint union of open sets U e each mapped homeomorphically to U (cid:11)", "rank": 0, "metadata": {"section": "71"}}
{"chunk_id": "71-1", "text": "2 Y, let U be an open neighborhood of f(cid:132)y(cid:133) in X for which p −1(cid:132)U(cid:133) is a disjoint union of open sets U e each mapped homeomorphically to U (cid:11)", "rank": 1, "metadata": {"section": "71"}}
