{"chunk_id": "12-0", "text": "Homotopy and Homotopy Type Chapter 0 3 ! A deformation retraction f :X X is a special case of the general notion of a t ! homotopy,whichissimplyanyfamilyofmaps f :X Y, t 2I,suchthattheasso- t ! ciated map F:X(cid:2)I Y given by F(cid:132)x;t(cid:133) (cid:131) f (cid:132)x(cid:133) is continuous. One says that two t ! maps f ;f :X Y are homotopic if there exists a homotopy f connecting them, 0 1 t andonewrites f ’f . 0 1 Intheseterms,adeformationretractionof X ontoasubspace A isahomotopy ! from the identity map of X to a retraction of X onto A, a map r:X X such that r(cid:132)X(cid:133) (cid:131) A and r jjA (cid:131) 11. One could equally well regard a retraction as a map X ! A restricting to the identity on the subspace A (cid:26) X. From a more formal viewpoint a ! retractionisamap r:X X with r2 (cid:131)r,sincethisequationsaysexactlythat r isthe identityonitsimage. Retractionsarethetopologicalanalogsofprojectionoperators inotherpartsofmathematics. Not all retractions come from deformation retractions. For example, a space X always retracts onto any point x 2X via the constant map sending all of X to x , 0 0 but a space that deformation retracts onto a point must be path-connected since a deformation retraction of X to x gives a path joining each x 2 X to x . It is less 0 0 trivial to show that there are path-connected spaces that do not deformation retract onto a point. One would expect this to be the case for the letters ‘with holes,’ A, B, D, O, P, Q, R. InChapter1wewilldeveloptechniquestoprovethis. ! Ahomotopy f :X X thatgivesadeformationretractionof X ontoasubspace t A hasthepropertythat f jjA(cid:131)11 forall t. Ingeneral,ahomotopy f :X ! Y whose t t restriction to a subspace A (cid:26) X is independent of t is called a homotopy relative to A,ormoreconcisely,ahomotopy rel A. Thus,adeformationretractionof X onto A isahomotopy relA fromtheidentitymapof X toaretractionof X onto A. ! If a space X deformation retracts onto a subspace A via f :X X, then if t ! ! r:X A denotestheresultingretractionand i:A X theinclusion,wehave ri(cid:131)11 and ir ’ 11, the latter homotopy being given by f . Generalizing this situation, a t ! ! map f:X Y iscalledahomotopyequivalenceifthereisamap g:Y X suchthat fg’11 and gf ’11. Thespaces X and Y aresaidtobehomotopyequivalentorto havethesamehomotopytype. Thenotationis X ’Y. Itisaneasyexercisetocheck that this is an equivalence relation, in contrast with the nonsymmetric notion of de- formationretraction. Forexample,thethreegraphs areallhomotopy equivalent since they are deformation retracts of the same space, as we saw earlier, butnoneofthethreeisadeformationretractofanyother. Itistrueingeneralthattwospaces X and Y arehomotopyequivalentifandonly ifthereexistsathirdspace Z containingboth X and Y asdeformationretracts. For the less trivial implication one can in fact take Z to be the mapping cylinder M of f ! any homotopy equivalence f:X Y. We observed previously that M deformation f retractsto Y,sowhatneedstobeprovedisthat M alsodeformationretractstoits f otherend X if f isahomotopyequivalence. ThisisshowninCorollary0.21.", "rank": 0, "metadata": {"section": "12"}}
