{"chunk_id": "4.2-0", "text": "Chapter 4. Persistence Introduction to TDA general object that appear naturally in many settings. Let us look at some important examples of filtrations. • Given a function f : X → R , we can define the (uncountably infinite) sublevel set filtration X = f−1(−∞,a]. a • A simplicial filtration is a nested sequence of subcomplexes F : K ⊆ K ⊆ ... ⊆ K = K. 0 1 n We call a simplicial filtration simplex-wise, if K \\ K is a single simplex (or i i−1 empty). • We call a function f : K → R simplex-wise monotone if for every σ ⊆ τ we have f(σ) ⩽ f(τ). A simplex-wise monotone function guarantees us that the sublevel set filtration by f gives a proper simplicial filtration. Note that it does not necessarily guaranteeusthatthesublevelsetfiltrationissimplex-wise(e.g., considerafunction f that is not injective). • We can also define a simplicial filtration by ordering our vertices v ,v ,...,v . 0 1 n Then, let K be the simplicial complex induced by the vertices v ,...,v . We call i 0 i the simplices K \\K added when adding v the lower star of v . Thus, this type i i−1 i i of filtration is also called the lower star filtration. • Given some data points in Rd, we can define a filtration based on our intuition of growing balls: We consider the nerve of all balls B(p,r); with growing r we get more and more faces in this nerve. We will later formalize this into the so-called Čech complex. 4.2 Persistent Homology As we have seen, from a filtration X ⊆ X ⊆ ... ⊆ X we get a sequence of homology 0 1 n groups with homomorphisms between them: H (F) : H (X ) → H (X ) → H (X ) → ... → H (X ). p p 0 p 1 p 2 p n Such an object is called a persistence module. Given a persistence module, we can now define groups that capture all the holes that are alive during a certain period. Definition 4.1. The p-th persistent homology group Hi,j is defined by p Hi,j := imhi,j = Z (K )/(B (K )∩Z (K )). p p p i p j p i This definition characterizes the cycles that that are present already in K and that i are not boundaries even in K . j 48 Introduction to TDA 4.2. Persistent Homology [c] ··· H (K ) H (K ) H (K ) H (K ) p i−1 p i p j−1 p j Figure 4.1: An illustration of a class [c] being born at K and dying entering K . i j Definition 4.2. The p-th persistent Betti numbers βi,j are the dimensions of the p-th p persistent homology groups: βi,j = dimHi,j. p p Exercise 4.3. Let p ⩾ 1. For every n ⩾ 1, construct a filtration X ⊆ X ⊆ ... ⊆ X 1 2 n such that • H (X ) ̸= 0 for all k ∈ {1,...,n} and p k • Hi,j = 0 for all i < j. p We say that a p-homology class [c] (a p-hole) is born at K if [c] ∈ H (K ) but i p i [c] ̸∈ Hi−1,i. Similarly, [c] dies entering K , if [c] ̸= 0 in H (K ) but hj−1,j([c]) = 0. p j p j−1 p It is not always obvious which homology class dies. Consider the following filtration: X consists of two points a and b, and in X the two points are", "rank": 0, "metadata": {"section": "4.2"}}
{"chunk_id": "4.2-1", "text": "(K ) but i p i [c] ̸∈ Hi−1,i. Similarly, [c] dies entering K , if [c] ̸= 0 in H (K ) but hj−1,j([c]) = 0. p j p j−1 p It is not always obvious which homology class dies. Consider the following filtration: X consists of two points a and b, and in X the two points are connected by an edge. 1 2 Let us look at H , that is, the connected components. We have that H (X ) ≃ Z2, with 0 0 1 2 the natural basis {[a],[b]}. On the other hand, in X there is only a single connected 2 component, and [a] = [b]. So a homology class is dying, but both our basis elements [a] and [b] survive. What is happening? It turns out that we were not careful with our choice of basis: H (X ) can also be 0 1 viewed as being generated by [a] and [a+b], and the class [a+b] indeed dies going into X . In general, if two homology classes merge, they both do not die, but their sum does. 2 There is a consistent choice of basis which allows us to only look at persistent homology in terms of basis elements, but we do not go into this at this point. If we have a simplex-wise filtration, we can circumvent the above issue by sorting homology classes by the time where they were born (recall the solution to Exercise 3.33 to see why this gives a total order). When two classes merge, we just say the “younger one” dies. This can be seen as adapting the considered basis along the way. Persistence pairings are another way around this issue. We add some final complex K which has trivial homology (i.e., by adding all simplices that are not yet present). n+1 Then, we aim to figure out how many holes get born at K and die entering K . For this, i j 49 Chapter 4. Persistence Introduction to TDA F: t t t t t 1 2 3 4 5 H 0 H 1 ∞ ∞ t t 5 5 t t 4 4 t t 3 3 t t 2 2 Dgm (F) Dgm (F) 0 1 t t 1 1 t t t t t t t t t t 1 2 3 4 5 1 2 3 4 5 Figure 4.2: An example of a filtration with the corresponding barcodes and persistence diagrams. we define µi,j := (βi,j−1 −βi,j)−(βi−1,j−1 −βi−1,j), for i < j ⩽ n+1. p p p p p Here, the content of the left parenthesis denotes the number of holes born at or before K , which die entering K . Conversely, the right parenthesis denotes the number of holes i j born strictly before K , and die entering K . Thus, subtracting the two, gives the number i j of holes born exactly at K and die entering K . Note that this conveys the information i j that we are interested in, but does not require choosing any basis. The persistence diagram Dgm (F) is a birth-death diagram which contains a point p for every pair i,j for which µi,j > 0. If we give each K a timestamp a , the point is drawn p i i at the coordinates (a ,a ). We give each point multiplicity µi,j. On the diagonal we add i j p points with infinite multiplicity, for some technical reasons that will become apparent later. We can also represent the same information by barcodes: For every i,j, we draw", "rank": 1, "metadata": {"section": "4.2"}}
{"chunk_id": "4.2-2", "text": "each K a timestamp a , the point is drawn p i i at the coordinates (a ,a ). We give each point multiplicity µi,j. On the diagonal we add i j p points with infinite multiplicity, for some technical reasons that will become apparent later. We can also represent the same information by barcodes: For every i,j, we draw µi,j intervals [a ,a ]. This is then called the p-th persistence barcode. p i j 50", "rank": 2, "metadata": {"section": "4.2"}}
