{"chunk_id": "3.2.4-0", "text": "Introduction to TDA 3.2. Homology 3.2.4 Homology Groups We are now ready to formalize the notion of holes or cavities. Recall that intuitively, a hole is a cycle that is not a boundary, that is, not filled by something higher-dimensional. Using that all objects defined so far form abelian groups, we can phrase this in algebraic terms using quotient groups. Definition 3.26. The p-th homology group H (K) is the quotient group Z (K)/B (K). p p p Often in the literature we write H (K;R) for homology over some ring R. Since we p only work with homology over Z in these lecture notes, we just write H (K) to mean 2 p H (K;Z ). p 2 Remember that the elements of a quotient group are cosets. In essence, each element of the homology group is a coset called a homology class which contains cycles that differ only by boundaries. The coset [c] = c+B is the homology class of c. We say that p c and c′ are homologous, if [c] = [c′], which is equivalent to the statements c ∈ c′ +B p and c+c′ ∈ B . See Figure 3.8 for an example of homologous cycles, and Figure 3.9 for p an example of the first homology group of a small complex. c c(cid:48) Figure 3.8: c′ and c are homologous cycles. 3 K : 4 H (K) : {0,123,234,1234} ∼ = Z2 1 1 2 2 Figure 3.9: The first homology group of a small complex. Exercise 3.27. Visualize the following simplicial complex K: 0-faces {a,b,c,d,e}, 1- faces {ab,ac,ad,bc,bd,cd,ce,de} and 2-faces {abc,abd,acd,bcd}. For the dimen- sions 1 & 2, what are the cycle, boundary, and homology groups of K? Note: You can express the groups by their generators. You do not need to write out all the elements. 37 Chapter 3. Homology Introduction to TDA Figure 3.10: A torus. Exercise 3.28. Give an informal derivation for the homology groups of a torus (see Figure 3.10). Can you find a space with isomorphic homology that is not homeo- morphic to the torus? Exercise 3.29. For a simplicial complex K, its cone CK is the complex with the same set of vertices plus one additional vertex z, and such that for all simplices in K we have {a,b,c,...} ∈ K =⇒ {a,b,c,...,z} ∈ CK (a) Visualize a cone operation. What does it intuitively do to a complex? (b) Show that the homology of the cone CK is 0 in all dimensions d > 0, for any K. (c) Bonus: What would happen (intuitively and to the homology) if we extended K in the same way as before, but with two points? (this is called the suspension of K) Here are some nice properties of homology groups, that will be beneficial for us, but that we will not prove here. Fact 3.30. • H is abelian and free. p • H is a Z -vector space. p 2 Remark 3.31. If we consider homology defined over other rings, e.g. over Z instead of Z , the homology groups might not be free. 2 38", "rank": 0, "metadata": {"section": "3.2.4"}}
