{"chunk_id": "83-0", "text": "74 Chapter 1 The Fundamental Group apathin Y fromachosenbasepoint y to g(cid:132)y (cid:133). Anytwosuchpathsarehomotopic 0 0 since Y issimply-connected,sowegetawell-definedelementof (cid:25) (cid:132)Y=G(cid:133) associated 1 to g. This method for computing fundamental groups via group actions on simply- connected spaces is essentially how we computed (cid:25) (cid:132)S1(cid:133) in x1.1, via the covering 1 ! space R S1 arisingfromtheactionof Z on R bytranslations. Thisisausefulgen- eral technique for computing fundamental groups, in fact. Here are some examples illustratingthisidea. Example 1.42. Consider the grid in R2 formed by the horizontal and vertical lines throughpointsin Z2. Letusdecoratethisgridwitharrowsineitherofthetwoways showninthefigure,thedifferencebetweenthetwo casesbeingthatinthesecondcasethehorizontal arrowsinadjacentlinespointinoppositiondirec- tions. The group G consisting of all symmetries of the first decorated grid is isomorphic to Z(cid:2)Z since it consists of all translations (cid:132)x;y(cid:133) , (cid:132)x(cid:130)m;y (cid:130)n(cid:133) for m;n 2 Z. For the second grid the symmetry group G contains a subgroup of translations of the form (cid:132)x;y(cid:133) , (cid:132)x(cid:130)m;y (cid:130)2n(cid:133) for m;n 2 Z, but there are also glide-reflection symme- triesconsistingofverticaltranslationbyanoddintegerdistancefollowedbyreflection acrossaverticalline,eitheraverticallineofthegridoraverticallinehalfwaybetween twoadjacentgridlines. Forbothdecoratedgridsthereareelementsof G takingany square to any other, but only the identity element of G takes a square to itself. The minimumdistanceanypointismovedbyanontrivialelementof G is 1,whicheasily impliesthecoveringspacecondition (cid:132)(cid:3)(cid:133). Theorbitspace R2=G isthequotientspace of a square in the grid with opposite edges identified according to the arrows. Thus weseethatthefundamentalgroupsofthetorusandtheKleinbottlearethesymme- try groups G in the two cases. In the second case the subgroup of G formed by the translationshasindextwo,andtheorbitspaceforthissubgroupisatorusforminga two-sheetedcoveringspaceoftheKleinbottle. Example 1.43: RPn. The antipodal map of Sn, x ,−x, generates an action of Z 2 on Sn withorbitspace RPn,realprojective n space,asdefinedinExample0.4. The action is a covering space action since each open hemisphere in Sn is disjoint from itsantipodalimage. AswesawinProposition1.14, Sn issimply-connectedif n(cid:21)2, ! so from the covering space Sn RPn we deduce that (cid:25) (cid:132)RPn(cid:133) (cid:25) Z for n (cid:21) 2. A 1 2 generatorfor (cid:25) (cid:132)RPn(cid:133) isanyloopobtainedbyprojectingapathin Sn connectingtwo 1 antipodalpoints. Onecanseeexplicitlythatsuchaloop γ hasordertwoin (cid:25) (cid:132)RPn(cid:133) 1 if n(cid:21)2 sincethecomposition γ γ liftstoaloopin Sn,andthiscanbehomotopedto thetrivialloopsince (cid:25) (cid:132)Sn(cid:133)(cid:131)0,sotheprojectionofthishomotopyinto RPn gives 1 anullhomotopyof γ γ.", "rank": 0, "metadata": {"section": "83"}}
