{"chunk_id": "10.4-0", "text": "Chapter 10. Applications Introduction to TDA Topological data analysis has been used in many studies in medicine. TDA seems to excel in these high-dimensional datasets since many features seem to be the result of higher-order interactions of different coordinates. TDA can also deal with much smaller data sets than other approaches such as deep neural networks, that need tons of data points to train, validate, etc. In medicine, studies often have very few data points due to the large monetary cost, workload, and also ethical questions involved with data gathering. 10.3 Time Series Time series is data given as a sequence of points x in some metric space X, where t is t a (discrete) variable. The goal in analyzing time series is often analyzing and finding periodic behavior in the time series. We can embed time series in some higher-dimensional space, by always considering a sequence of l+1 consecutive points, i.e., I := {(x ,x ,...,x )} ⊂ Xl+1. The idea l t t t i i+1 i+l is that periodicity in the time series translates to loops (1-dimensional holes) in I . As l an example, consider x = sin(πt), and consider l = 1. Then, we get a loop in R2. If we t 4 however consider x = t, I is just a straight line. t 1 This approach has been used by Vejdemo-Johansson, Pokorny, Skraba and Kragic [9] for analyzing motion capture data, where cameras track the location in 3-space of certain points on a human body marked by physical markers. The data considered are six seconds long recordings of movement such as boxing, see Figure 10.13 for some stills. Every data point in this set is roughly 70-dimensional. Using PCA to project onto 2 dimensions, some loops can be seen but we cannot really distinguish different loops, see Figure 10.14 (left). Computing persistent homology it can be seen that there are six different loops that persist a long time, see Figure 10.14 (right). Looking back at the input data, these six different loops can be mapped to six different boxing movements in the recording. 10.4 Politics The data considered in this application, done in [2], is gathered from the sessions of the US house of representatives through the year 2010. For every vote, we set x = 1 if the i memberisaysYestothevote, −1forNo, and0otherwise. Doingthisforeveryofthe447 representatives in all 664 votes this gives 664 data points in R447. Using PCA to project to two dimensions and coloring the data by splitting the members into the two parties we get the picture depicted in Figure 10.15. We can see that there are four main “corners” in which issues lie: the ones that get bipartisan support, those that get bipartisan rejection, those that are supported by republicans and rejected by democrats, and those where it is the opposite way. We can also see that the corner with bipartisan rejection is very sparsely populated, since such issues rarely make it far enough to be voted on. Further there are few votes that lie in between two of these corners, and almost none that lie 112 Introduction to TDA 10.4. Politics Figure 10.13: Some stills from motion capture data of a boxer. Figure 10.14: Left: PCA of the data set obtained from the boxing recording. Right: the persistent homology of the same data. 113 Chapter 10. Applications Introduction to TDA Figure 10.15: PCA of the voting data from the US house of representatives, colored by parties. Figure 10.16: Persistence diagram in dimension 1, computed on the entire voting data. in the middle of all four corners. There are however", "rank": 0, "metadata": {"section": "10.4"}}
{"chunk_id": "10.4-1", "text": "set obtained from the boxing recording. Right: the persistent homology of the same data. 113 Chapter 10. Applications Introduction to TDA Figure 10.15: PCA of the voting data from the US house of representatives, colored by parties. Figure 10.16: Persistence diagram in dimension 1, computed on the entire voting data. in the middle of all four corners. There are however some: in particular, three of the recordedvoteswhereQuorumcalls, wherebothanswers(Present/NotPresent)arecoded as 0, so there are at least 3 points exactly in the middle of the square. Computing the 1-dimensional persistence diagram, we would hope to recognize the phenomenon of excluded middle by having a 1-dimensional homology class with long persistence, corresponding to the boundary of the square. However, as we can see in the diagram depicted in Figure 10.16, this is not the case. What is going on? If you think about the process of growing balls, it becomes apparent that already a single point in the center of the square is enough to “fill the hole” much faster than we would like. As you can see in Figure 10.15, there are several points in the middle of the square, and it is these points that make the persistence of any 1-dimensional homology class short. This is a general issue of persistent homology: it is very fragile to outliers in the data. 114", "rank": 1, "metadata": {"section": "10.4"}}
