{"chunk_id": "9.3.1-0", "text": "Introduction to TDA 9.3. Distances and robustness for P-persistence modules ψ a : V a → U a+ϵ1 , a ∈ Rn, such that the following diagrams (and their symmetric counterparts obtained by exchanging the role of U and V) are commutative: U u a,a′ U U u a,a+2ϵ1 U a a′ a a+2ϵ1 φa φ a′ and φa ψa+ϵ1 V v a+ϵ1,a′+ϵ1 V V a+ϵ1 a′+ϵ1 a+ϵ1 The interleaving distance between U,V is d I (U,V) := inf ϵ⩾0 { U,V are ϵ-interleaved}. The definition above agrees with our earlier definition of interleaving when n = 1. Contrary to the 1-dimensional case, computing the interleaving distance for n ⩾ 2 is an NP-hard problem (even if the persistence modules U,V are given to us in a ‘nice’ form). For this reason, the following alternative based on the fibered barcode is sometimes used in practice. It is known to be efficiently computable when n = 2. Definition 9.16. The matching distance between p.f.d. Rn-persistence modules U,V is (cid:10) (cid:11) d (U,V) := sup d (cid:0)B(U ), B(V ) (cid:1) , match B L L L where the supremum is taken over all lines L : t (cid:55)→ ta+b with a ⪰ 1, b ∈ Rn. Theorem 9.17 (see [3]). For any two p.f.d. Rn-persistence modules, d (U,V) ⩽ d (U,V). match I Exercise 9.18. Prove that d (cid:0)B(U ), B(V ) (cid:1) ⩽ d (U,V) for all lines L : t (cid:55)→ t1+b. B L L I 9.3.1 Robustness of some bipersistence modules Finally, we come back to the primary reason for studying multiparameter persistence: achieving robustness w.r.t. outliers in the data. To state formal guarantees of this form, we need to think about point-cloud data in a more probablistic way. For a finite (multi)set X ⊆ Rn, we write µ for the uniform probability measure on X, meaning the X measure that assigns probability 1/|X| to each x ∈ X. The following can be thought of as a ‘probabilistic Hausdorff distance’ between point clouds. Definition 9.19. Let X,Y ⊆ Rn finite. The Prohorov distance1 between µ ,µ is X Y d (µ ,µ ) := supinf{δ ⩾ 0 : µ (A) ⩽ µ (Aδ)+δ and µ (A) ⩽ µ (Aδ)+δ}, Pr X Y X Y Y X A where A ranges over all closed subsets of Rn and Aδ := {y ∈ Rn : dist(y,A) ⩽ δ}. 1The Prohorov distance can be defined between any two measures µ,ν on (the same) metric space M. 101 Chapter 9. Multiparameter persistence Introduction to TDA While the definition of the Prohorov distance appears a bit complicated, the following observation suggests that it captures ‘robustness to outliers’ in a meaningful way. Exercise 9.20. Let X ( Y ⊆ Rn, finite, non-empty sets. Show that |Y \\X| d (µ ,µ ) ⩽ . Pr X Y |X| As an example, the normalized multicover persistence module turns out to be stable w.r.t. Prohorov distance (i.e., it is robust to outliers). Definition 9.21. Let X ⊆ Rn be a finite point cloud. For r,ρ ∈ R, the sets NMCr(X) := {x ∈ Rn : |B(x,r)∩X| ⩾ ρ|X|} = {x ∈ Rn : µ (cid:0) B(x,r)∩X (cid:1) ⩾ ρ}. ρ X form a bilfiltration over R×Rop called the normalized multicover bifiltration. Theorem 9.22 (see [1]). Let X,Y ⊆ Rn finite. For all k ⩾ 0, we have d (cid:0) H (NMC(X)), H (NMC(Y)) (cid:1) ⩽ d (µ ,µ ). I k k Pr X Y Proof. Let ϵ = d (µ ,µ ). We will show that Pr X Y NMCr(X) ⊆ NMCr+ϵ(Y) ⊆ NMCr+2ϵ(X) ∀r,ρ ∈", "rank": 0, "metadata": {"section": "9.3.1"}}
{"chunk_id": "9.3.1-1", "text": "the normalized multicover bifiltration. Theorem 9.22 (see [1]). Let X,Y ⊆ Rn finite. For all k ⩾ 0, we have d (cid:0) H (NMC(X)), H (NMC(Y)) (cid:1) ⩽ d (µ ,µ ). I k k Pr X Y Proof. Let ϵ = d (µ ,µ ). We will show that Pr X Y NMCr(X) ⊆ NMCr+ϵ(Y) ⊆ NMCr+2ϵ(X) ∀r,ρ ∈ R. ρ ρ−ϵ ρ−2ϵ These inclusions induce the maps φ : H (NMCr(X)) → H (NMCr+ϵ(Y)), r,ρ k ρ k ρ−ϵ ψ : H (NMCr+ϵ(Y)) → H (NMCr+2ϵ(X)) r+ϵ,ρ−ϵ k ρ−ϵ k ρ−2ϵ required to show that H (NMC(X)) and H (NMC(Y)) are ϵ-interleaved. k k So, let r,ρ ∈ R , and suppose that x ∈ NMCr(X). By definition, this means that ρ µ (B(x,r) ∩ X) ⩾ ρ. Using the definition of the Prohorov distance, and the triangle- X inequality, this implies that ρ ⩽ µ (cid:0) B(x,r)∩X (cid:1) ⩽ µ (cid:0) B(x,r)ϵ ∩Y (cid:1) +ϵ ⩽ µ (cid:0) B(x,r+ϵ)∩Y (cid:1) +ϵ. X Y Y That is to say, µ (B(x,r+ϵ)∩Y) ⩾ ρ−ϵ, meaning x ∈ NMCr+ϵ(Y), giving us the first Y ρ−ϵ inclusion. The second inclusion follows from an analogous argument, switching the roles of X and Y. There are many similar theorems for other bipersistence modules, including the degree-Rips bifiltration. They are often somewhat hard to state and prove, relying on variants of the Prohorov distance, as well as variants of the interleaving distance [1]. 102 Introduction to TDA 9.3. Distances and robustness for P-persistence modules Questions 35. How can we define persistence modules over multiple parameters? Discuss the technical definitions that are needed. 36. What are some common bipersistence modules? How do they relate to the (1-parameter) persistence modules of earlier chapters? 37. What is a major upside of multiparameter persistence? What is a major downside? Discuss robustness and representability. 38. How can we visualize multiparameter persistence modules? References [1] Andrew J. Blumberg and Michael Lesnick, Stability of 2-parameter persistent homol- ogy. Found. Comput. Math., 24/2, (2024), 385–427. [2] Magnus Bakke Botnan and Michael Lesnick, An Introduction to Multiparameter Persistence. 2023. [3] Claudia Landi, The rank invariant stability via interleavings. In Research in compu- tational topology, vol. 13 of Assoc. Women Math. Ser., pp. 1–10, Springer, Cham, 2018. 103", "rank": 1, "metadata": {"section": "9.3.1"}}
