{"chunk_id": "11-0", "text": "2 Chapter 0 Some Underlying Geometric Notions Naturallywewouldlike f (cid:132)x(cid:133) todependcontinuouslyonboth t and x,andthiswill t be true if we have each x 2 X−X move along its line segment at constant speed so as to reach its image point in X at time t (cid:131) 1, while points x 2 X are stationary, as remarkedearlier. Examples of this sort lead to the following general definition. A deformation ! retractionofaspace X ontoasubspace A isafamilyofmaps f :X X, t2I,such t that f (cid:131) 11 (the identity map), f (cid:132)X(cid:133) (cid:131) A, and f jjA (cid:131) 11 for all t. The family f 0 1 t t shouldbecontinuousinthesensethattheassociatedmap X(cid:2)I ! X, (cid:132)x;t(cid:133) , f (cid:132)x(cid:133), t iscontinuous. Itiseasytoproducemanymoreexamplessimilartotheletterexamples,withthe deformationretraction f obtainedbyslidingalonglinesegments. Thefigureonthe t leftbelowshowssuchadeformationretractionofaM¨obiusbandontoitscorecircle. Thethreefiguresontherightshowdeformationretractionsinwhichadiskwithtwo smalleropensubdisksremovedshrinkstothreedifferentsubspaces. Inalltheseexamplesthestructurethatgivesrisetothedeformationretractioncan ! bedescribedbymeansofthefollowingdefinition. Foramap f:X Y,themapping cylinder M isthequotientspaceofthedisjointunion (cid:132)X(cid:2)I(cid:133)qY obtainedbyiden- f tifying each (cid:132)x;1(cid:133) 2 X(cid:2)I with f(cid:132)x(cid:133) 2 Y. In the let- X ter examples, the space X X£I istheouterboundaryofthe f (X) M f thick letter, Y is the thin Y Y ! letter, and f:X Y sends the outer endpoint of each line segment to its inner endpoint. A similar description applies to the other examples. Then it is a general fact that a mapping cylinder M f deformationretractstothesubspace Y byslidingeachpoint (cid:132)x;t(cid:133) alongthesegment fxg(cid:2)I (cid:26)M totheendpoint f(cid:132)x(cid:133)2Y. f Not all deformation retractions arise in this way from mapping cylinders, how- ever. For example, the thick X deformation retracts to the thin X, which in turn deformationretractstothepointofintersectionofitstwocrossbars. Thenetresult is a deformation retraction of X onto a point, during which certain pairs of points follow paths that merge before reaching their final destination. Later in this section wewilldescribeaconsiderablymorecomplicatedexample,theso-called‘housewith tworooms,’whereadeformationretractiontoapointcanbeconstructedabstractly, butseeingthedeformationwiththenakedeyeisarealchallenge.", "rank": 0, "metadata": {"section": "11"}}
