{"chunk_id": "3.2-0", "text": "Introduction to TDA 3.2. Homology Figure 3.4: A visual representation of the deformation retract from a 3-dimensional ball to Bing’s house. Images taken from the blog Sketches of topology [1]. “continuous” topology combinatorial topology topological spaces simplicial complexes continuous maps simplicial maps homotopic maps contiguous maps deformation retracts collapses Table 3.1: Equivalent notions in “continuous” and combinatorial topology 3.2 Homology Recall that homology is intended as a tool to count holes in objects, and recall that this hole count is intended as an invariant of topological spaces under homotopy equiv- alence. We have introduced simplicial complexes, which allow us to consider concrete combinatorial descriptions instead of abstract topological spaces. Let us begin with some basic intuition for holes in simplicial complexes, before diving into the more technical definitions. Consider the two simplicial complexes shown in Figure 3.5. How many (and what kind of) holes should these complexes intuitively have? 31 Chapter 3. Homology Introduction to TDA d d c c a b a b K K 1 2 Figure 3.5: Two simplicial complexes. K contains all four triangles 1 {a,b,c},{a,b,d},{a,c,d},{b,c,d} as well as their subsets, while K 2 only contains the three triangles {a,b,c},{a,c,d},{b,c,d} and their sub- sets. As can be seen, K is the boundary of a tetrahedron. It is a triangulation of the 1 2-dimensional (hollow) sphere, so we would like to say that it has a hole, or cavity. In particular, because this cavity is of the same dimension as the cavity in the 2-dimensional sphere, we want to call this cavity a 2-dimensional hole. On the other hand, K can be viewed as a triangulation of four points in the plane, 2 wherethepointaliesinsidetheconvexhulloftheotherthreepoints. Itishomeomorphic to a 2-dimensional disk. Intuitively we would like to say that the complex K does not 2 have any holes. As a 2-dimensional disk, K has a boundary, consisting of the edges {a,b}, {b,d} 2 and {a,d}. On the other hand, K has no boundary, just as a sphere has no boundary. 1 We will later define a notion of boundary capturing this intuition, at least for pure simplicial complexes, that is, simplicial complexes whose maximal faces all have the same dimension. For example, a 1-dimensional pure simplicial complex is just a graph with no isolated vertices. In such a graph, the boundary will contain all the leaves (vertices of degree 1). Some complexes, like K , will have an empty boundary, and in analogy 1 to graphs without leaves we call such complexes cycles1. Under this viewpoint, our d- dimensional holes of a simplicial complex K should be d-dimensional pure subcomplexes that are cycles. On the other hand, clearly not all cycles should be holes, as can be seen with the boundary of K . This boundary (the three edges {a,b}, {b,d} and {a,d}) itself 2 does not have a boundary, and is thus a 1-dimensional cycle. However we do not want to consider this cycle as a 1-dimensional hole of K since it is “filled up”, it is the boundary 2 of the three filled in triangles. Summed up, our intuition is that holes are subcomplexes that have no boundary (cycles) and that are not themselves boundaries of another subcomplex which would be filling in the hole. In the following we will make this intuition precise by defining the types of subcomplexes we consider, the notions of boundaries and cycles, and how to mathematically describe the cycles that are not boundaries. 1Note that technically graphs without leaves are not necessarily just cycles, but can also consist of multiple cycles glued together at vertices and edges. 32", "rank": 0, "metadata": {"section": "3.2"}}
{"chunk_id": "3.2-1", "text": "we will make this intuition precise by defining the types of subcomplexes we consider, the notions of boundaries and cycles, and how to mathematically describe the cycles that are not boundaries. 1Note that technically graphs without leaves are not necessarily just cycles, but can also consist of multiple cycles glued together at vertices and edges. 32", "rank": 1, "metadata": {"section": "3.2"}}
