{"chunk_id": "32-0", "text": "The Idea of the Fundamental Group 23 paths, which are allowed to pass through the same point many times. So if one is thinkingofaloopassomethingmadeofstretchablestring,onehastogivethestring themagicalpowerofbeingabletopassthroughitselfunharmed. However,wemust besurenottoallowourloopstointersectthefixedcircle A atanytime,otherwisewe couldalwaysunlinkthemfrom A. Nextweconsideraslightlymorecomplicatedsortoflinking,involvingthreecir- clesformingaconfigurationknownastheBorromeanrings,shownattheleftinthefig- urebelow. Theinterestingfeaturehereisthatifanyoneofthethreecirclesisremoved, theothertwoarenot linked. In the same A B A B spiritasbefore,letus regardoneofthecir- cles,say C,asaloop inthecomplementof C C theothertwo, A and B,andweaskwhether C canbecontinuouslydeformedtounlinkitcompletelyfrom A and B,alwaysstayinginthecomplementof A and B duringthedeformation. We canredrawthepicturebypulling A and B apart,dragging C along,andthenwesee C winding back and forth between A and B as shown in the second figure above. In this new position, if we start at the point of C indicated by the dot and proceed in the direction given by the arrow, then we pass in sequence: (1) forward through A, (2) forward through B, (3) backward through A, and (4) backward through B. If we measure the linking of C with A and B by two integers, then the ‘forwards’ and ‘backwards’ cancel and both integers are zero. This reflects the fact that C is not linkedwith A or B individually. To get a more accurate measure of how C links with A and B together, we re- gard the four parts (1)–(4) of C as an ordered sequence. Taking into account the directions in which these segments of C pass throughA andB,wemaydeform C tothesum A B a a(cid:130)b−a−b offourloopsasinthefigure. We b write the third and fourth loops as the nega- ¡a ¡b tivesofthefirsttwosincetheycanbedeformed to the first two, but with the opposite orienta- A B tions, and as we saw in the preceding exam- a ple, the sum of two oppositely oriented loops b ¡a ¡b is deformable to a trivial loop, not linked with anything. Wewouldliketoviewtheexpression a(cid:130)b −a−b as lying in a nonabelian group, so that it is not automatically zero. Changing to the more usual multiplicative notation for nonabelian groups, it would bewritten aba −1b −1,thecommutatorof a and b.", "rank": 0, "metadata": {"section": "32"}}
