{"chunk_id": "7.4-0", "text": "Chapter 7. Reeb Graphs and Mapper Introduction to TDA y M(U ,f ) 2 2 M(U ,f ) 1 1 x Figure 7.6: The cover U , and the two Mappers. The Mapper M(U ,f ) consists ∞ 1 1 of an empty octahedron, with additional filled tetrahedra attached at the purple vertices. The whole space thus collapses to an octahedron. Algorithm: Since at the moment we only have a discrete metric space, we do not really have the notion of connected components yet. For every U ∈ U, we thus cluster the pre- image f−1(U) using some clustering algorithm, which we can also consider as an input. Now, we can just consider each cluster C as a vertex of some simplicial complex K, and i add a face {C ,...,C } to K if these clusters (which are just point sets) have a common 1 k point. Output: We output K, or even just its 1-skeleton. As you can see, this algorithm requires a lot of input parameters. While this allows to encode previous knowledge of the data set (e.g. by choosing as filter function the distance to a known center of the data), it also makes the space of possible outputs very large. Picking the correct parameters is currently still an art form on its own, and there is significant research being done towards understanding the interplay between the parameters and statistical guarantees for certain good choices of parameters. 7.4 Multiscale Mapper Motivated by the many tuneable parameters, we discuss here one idea to look at many values at once. The multiscale Mapper is a combination of the ideas of persistence and of Mapper. We here want to look at different covers. Definition 7.32. Let U = {U } and F = {V } be two covers of the same space X. α α∈A β β∈B A map of covers is a map φ : A → B such that for every α ∈ A, we have U ⊆ V . α φ(α) 86 Introduction to TDA 7.4. Multiscale Mapper Proposition 7.33. If φ : U → V is a map of covers (with a slight abuse of notation), then the map N(φ) : N(U) → N(V) given on the vertices by φ is simplicial. Proof. Let σ ∈ N(U). We need to show that the intersection (cid:84) V is non- β∈N(φ)(σ) β empty. (cid:92) (cid:92) (cid:92) V = V ⊇ U ̸= ∅ β φ(α) α β∈N(φ)(σ) α∈σ α∈σ Thus, N(φ)(σ) ∈ N(V). An example of this map between nerves can be seen in Figure 7.7. Proposition 7.34. Let f : X → Z be some map, and U,V be covers of Z, with φ : U → V some map of covers. Then, there exists a map of covers f∗(φ) : f∗(U) → f∗(V). Recall that f∗(U) is the cover of X consisting of the connected components of the pre-images of the sets of U under f. Proof. For every α, we have U ⊆ V =⇒ f−1(U ) ⊆ f−1(V ). We now need to go α φ(α) α φ(α) from these pre-images to their connected components. Since every connected component of f−1(U ) must lie in a unique connected component of f−1(V ), our desired map of α φ(α) covers is given by exactly mapping to this connected component. If we have multiple maps of covers, U → φ V → ψ W, we can concatenate the maps, and the f∗ function distributes: f∗(ψ◦φ) = f∗(ψ)◦f∗(φ). Let U = U → φ 1 U → φ 2 ... φ →n−1 U be a sequence", "rank": 0, "metadata": {"section": "7.4"}}
{"chunk_id": "7.4-1", "text": "desired map of α φ(α) covers is given by exactly mapping to this connected component. If we have multiple maps of covers, U → φ V → ψ W, we can concatenate the maps, and the f∗ function distributes: f∗(ψ◦φ) = f∗(ψ)◦f∗(φ). Let U = U → φ 1 U → φ 2 ... φ →n−1 U be a sequence of covers of Z with maps between 1 2 n them, which we call a cover tower. By applying f∗ we get a cover tower f∗(U) of X. Definition 7.35 (Multiscale Mapper). Let f : X → Z, U a cover tower of Z. Then, the Multiscale Mapper MM(U,f) is MM(U,f) := N(f∗(U)) = {N(f∗(U )) | U ∈ U}) i i together with the induced simplicial maps N(f∗(φ )) : N(f∗(U )) → N(f∗(U )). i i i+1 Applying homology, we get the sequence homology groups with induced homo- morphisms between them, i.e., a persistence module: H (N(f∗(U ))) N(f − ∗( → φ 1 ))∗ ... N(f∗ − (φ →n−1 ))∗ H (N(f∗(U ))). p 1 p n We can now view Dgm MM(U,f) as a topological summary of f through the lens p of U. As opposed to the normal Mapper, at first glance the Multiscale Mapper adds even more parameters. But a cover tower can be seen as a way of looking at a whole interval of covers. For example, we can get a cover tower by increasing the size of all intervals in an interval cover. The features of the data should show up as a robust feature that persistsforalongertimeoverthisprocess,whilespuriousfeaturesobtainedfromchoosing “wrong” Mapper parameters should disappear quickly. 87 Chapter 7. Reeb Graphs and Mapper Introduction to TDA Figure 7.7: Three pullback covers of a space X (thickened figure “8”), with their nerves and the induced simplicial maps between them. 88 Introduction to TDA 7.4. Multiscale Mapper Questions 24. What is a Reeb graph? State the definition and describe how we get the graph structure. 25. How can we compute the augmented Reeb graph of a piece-wise linear func- tion? Define the augmented Reeb graph and explain the algorithm to compute it. 26. How much of the homology of the underlying topological space is captured by the Reeb graph? Explain vertical and horizontal homology. 27. What is the interleaving distance for Reeb graphs? Give the definitions and state the relevant stability theorems. 28. (Thistopicwasnotcoveredinthisyear’scourseinFS25andthereforethefollowingquestion will not be asked in the exam.)What is the functional distortion distance for Reeb graphs? Give the definitions and state the relevant stability theorems. 29. What is the topological Mapper? State the Definition and give an example. 30. How can we use Mapper on point cloud data? Explain the Mapper algorithm and describe the input parameters. 31. (Thistopicwasnotcoveredinthisyear’scourseinFS25andthereforethefollowingquestion will not be asked in the exam.)How can we use Mapper on several covers at once? Explain the Multiscale Mapper. 89", "rank": 1, "metadata": {"section": "7.4"}}
