{"chunk_id": "3.2.5-0", "text": "Introduction to TDA 3.2. Homology Recallthatouroriginalmotivationforintroducinghomologywastocountthenumber of holes. With homology as we defined it, we have the algebraic structure of a vector space where we can add holes together. The number of distinct holes is now just the dimension of this vector space. Definition 3.32. β := dimH = dimZ −dimB is the p-th Betti number. p p p p In the definition above, dim denotes the dimension of a vector space as you know it from linear algebra, i.e., dimH is the number of elements in a basis of H . p p Exercise 3.33. The Euler characteristic of a simplicial complex K is defined as χ = k −k +k −... 0 1 2 with k denoting the number of i-dimensional simplices in K. Convince yourself that i this is an invariant property for all triangulations of the same topological space X. Hint: Show instead that χ = β (K)−β (K)+.... The statement then follows by 0 1 the fact that homeomorphic spaces have the same homology. Exercise 3.34. Take any vector v = (a ,...,a ) ∈ Nd+1 with a > 0. Show that there 0 d 0 exists a simplicial complex K with that vector as its Betti numbers. v 3.2.5 Singular Homology With our definition of homology for simplicial complexes, we get for free a notion of homology for many topological spaces, namely the triangulable ones: we can simply triangulate them and take the homology of the triangulation. But, a topological space may have many triangulations, and it seems like the structure of the homology groups might differ depending on the choice of triangulation. The aim of this section is to sketch the tools that show that the homology of a triangulable space is independent of the chosen triangulation. The idea of singular homology is to remove the need for a fixed triangulation by looking at all possible simplices at once. Let X be a topological space, and let ∆p be the standard p-simplex in Rp+1. We want to consider all possible occurrences of this simplex in X. Definition 3.35. A singular p-simplex is a map σ : ∆p → X. Note that in this definition we do not require σ to be injective, thus it would even be possible to map the simplex to a single point. We now define C (X) the same way as before, but now on the family of all singular p p-simplices, which in general makes the group uncountably infinite. We also define δ p as before, defining Z (X) and B (X), which are now also uncountably infinite. Finally, p p we again define H (X) = Z (X)/B (X). Surprisingly, this definition agrees with the p p p simplicial definition of homology on any triangulation of X. 39", "rank": 0, "metadata": {"section": "3.2.5"}}
