{"chunk_id": "77-0", "text": "68 Chapter 1 The Fundamental Group Proof: Itremainsonlytoprovethelaststatement. Weshowthatforacoveringspace p:(cid:132)X e ;xe (cid:133) ! (cid:132)X;x (cid:133),changingthebasepoint xe within p −1(cid:132)x (cid:133) correspondsexactly 0 (cid:0) 0 (cid:1) 0 0 to changing p(cid:3) (cid:25) 1 (cid:132)X e ;xe 0 (cid:133) to a conjugate subgroup of (cid:25) 1 (cid:132)X;x 0 (cid:133). Suppose that xe 1 isanotherbasepointin p −1(cid:132)x (cid:133),andlet γe beapathfrom xe to xe . Then γe projects 0 0 1 (cid:0) (cid:1) toaloop γ in X representingsomeelement g 2(cid:25) 1 (cid:132)X;x 0 (cid:133). Set H i (cid:131)p(cid:3) (cid:25) 1 (cid:132)X e ;xe i (cid:133) for i (cid:131) 0;1. We have an inclusion g −1H g (cid:26) H since for f e a loop at xe , γef e γe is a 0 1 0 loop at xe . Similarly we have gH g −1 (cid:26) H . Conjugating the latter relation by g −1 1 1 0 gives H (cid:26) g −1H g, so g −1H g (cid:131) H . Thus, changing the basepoint from xe to xe 1 0 0 1 0 1 changes H totheconjugatesubgroup H (cid:131)g −1H g. 0 1 0 Conversely,tochange H toaconjugatesubgroup H (cid:131)g −1H g,choosealoop 0 1 0 γ representing g,liftthistoapath γe startingat xe ,andlet xe (cid:131)γe(cid:132)1(cid:133). Thepreceding 0 1 argumentthenshowsthatwehavethedesiredrelation H (cid:131)g −1H g. tu 1 0 Aconsequenceoftheliftingcriterionisthatasimply-connectedcoveringspaceof a path-connected, locally path-connected space X is a covering space of every other path-connected covering space of X. A simply-connected covering space of X is thereforecalledauniversalcover. Itisuniqueuptoisomorphism,sooneisjustified incallingitthe universalcover. Moregenerally,thereisapartialorderingonthevariouspath-connectedcovering spaces of X, according to which ones cover which others. This corresponds to the partialorderingbyinclusionofthecorrespondingsubgroupsof (cid:25) (cid:132)X(cid:133),orconjugacy 1 classesofsubgroupsifbasepointsareignored. Representing Covering Spaces by Permutations Wewishtodescribenowanotherwayofclassifyingthedifferentcoveringspaces of a connected, locally path-connected, semilocally simply-connected space X, with- outrestrictingjusttoconnectedcoveringspaces. Togivetheidea,con- sider the 3 sheeted covering spaces of S1. There are three of these, e e e X , X , and X , with the subscript indicating the number of compo- 1 2 3 nents. Foreachofthesecoveringspaces p:X e ! S1 thethreedifferent i liftsofaloopin S1 generating (cid:25) (cid:132)S1;x (cid:133) determineapermutationof 1 0 p −1(cid:132)x (cid:133) sendingthestartingpointofthelifttotheendingpointofthe 0 e e lift. For X thisisacyclicpermutation,for X itisatranspositionof 1 2 e two points fixing the third point, and for X it is the identity permu- 3 tation. These permutations obviously determine the covering spaces uniquely,uptoisomorphism. Thesamewouldbetruefor n sheeted coveringspacesof S1 forarbitrary n,evenfor n infinite. The covering spaces of S1_S1 can be encoded using the same idea. Referring back to the large table of examples near the beginning of this section, we see in the coveringspace(1)thattheloop a liftstotheidentitypermutationofthetwovertices and b liftstothepermutationthattransposesthetwovertices. In(2),both a and b", "rank": 0, "metadata": {"section": "77"}}
