{"chunk_id": "17-0", "text": "8 Chapter 0 Some Underlying Geometric Notions In the examples of cell complexes given so far, the closure of each cell is a sub- complex, and more generally the closure of any collection of cells is a subcomplex. Mostnaturallyarisingcellstructureshavethisproperty,butitneednotholdingen- eral. Forexample,ifwestartwith S1 withitsminimalcellstructureandattachtothis ! a 2 cellbyamap S1 S1 whoseimageisanontrivialsubarcof S1,thentheclosure ofthe 2 cellisnotasubcomplexsinceitcontainsonlyapartofthe 1 cell. Operations on Spaces Cell complexes have a very nice mixture of rigidity and flexibility, with enough rigidity to allow many arguments to proceed in a combinatorial cell-by-cell fashion andenoughflexibilitytoallowmanynaturalconstructionstobeperformedonthem. Herearesomeofthoseconstructions. Products. If X and Y are cell complexes, then X(cid:2)Y has the structure of a cell complex with cells the products em(cid:2)en where em ranges over the cells of X and (cid:11) (cid:12) (cid:11) en ranges over the cells of Y. For example, the cell structure on the torus S1(cid:2)S1 (cid:12) described at the beginning of this section is obtained in this way from the standard cell structure on S1. For completely general CW complexes X and Y there is one smallcomplication: Thetopologyon X(cid:2)Y asacellcomplexissometimesfinerthan theproducttopology,withmoreopensetsthantheproducttopologyhas,thoughthe two topologies coincide if either X or Y has only finitely many cells, or if both X and Y havecountablymanycells. ThisisexplainedintheAppendix. Inpracticethis subtleissueofpoint-settopologyrarelycausesproblems,however. Quotients. If (cid:132)X;A(cid:133) isaCWpairconsistingofacellcomplex X andasubcomplex A, then the quotient space X=A inherits a natural cell complex structure from X. The cellsof X=A arethecellsof X−A plusonenew 0 cell,theimageof A in X=A. Fora cell en of X−A attachedby ’ :Sn−1 ! Xn−1,theattachingmapforthecorrespond- (cid:11) (cid:11) ingcellin X=A isthecomposition Sn−1 ! Xn−1 ! Xn−1=An−1. Forexample,ifwegive Sn−1 anycellstructureandbuild Dn from Sn−1 byattach- ingann cell,thenthequotientDn=Sn−1 isSn withitsusualcellstructure. Asanother example,take X tobeaclosedorientablesurfacewiththecellstructuredescribedat thebeginningofthissection,withasingle 2 cell,andlet A bethecomplementofthis 2 cell,the 1 skeletonof X. Then X=A hasacellstructureconsistingofa 0 cellwith a 2 cellattached,andthereisonlyonewaytoattachacelltoa 0 cell,bytheconstant map,so X=A is S2. Suspension. For a space X, the suspension SX is the quotient of X(cid:2)I obtainedbycollapsing X(cid:2)f0g toonepointand X(cid:2)f1g toan- other point. The motivating example is X (cid:131) Sn, when SX (cid:131) Sn(cid:130)1 with the two ‘suspension points’ at the north and south poles of Sn(cid:130)1,thepoints (cid:132)0;(cid:1)(cid:1)(cid:1);0;(cid:6)1(cid:133). Onecanregard SX asadoublecone", "rank": 0, "metadata": {"section": "17"}}
