{"chunk_id": "89-0", "text": "80 Chapter 1 The Fundamental Group 11. ConstructfinitegraphsX andX havingacommonfinite-sheetedcoveringspace 1 2 X e (cid:131)X e ,butsuchthatthereisnospacehavingboth X and X ascoveringspaces. 1 2 1 2 12. Let a and b be the generators of (cid:25) (cid:132)S1 _ S1(cid:133) corresponding to the two S1 1 summands. Draw a picture of the covering space of S1 _S1 corresponding to the normalsubgroupgeneratedby a2, b2,and (cid:132)ab(cid:133)4,andprovethatthiscoveringspace isindeedthecorrectone. 13. Determine the covering space of S1 _ S1 corresponding to the subgroup of (cid:25) (cid:132)S1_S1(cid:133) generatedbythecubesofallelements. Thecoveringspaceis 27 sheeted 1 and can be drawn on a torus so that the complementary regions are nine triangles with edges labeled aaa, nine triangles with edges labeled bbb, and nine hexagons with edges labeled ababab. [For the analogous problem with sixth powers instead ofcubes,theresultingcoveringspacewouldhave 228325 sheets! Andfor kth powers with k sufficiently large, the covering space would have infinitely many sheets. The underlying group theory question here, whether the quotient of Z(cid:3)Z obtained by factoring out all kth powers is finite, is known as Burnside’s problem. It can also be askedforafreegroupon n generators.] 14. Findalltheconnectedcoveringspacesof RP2_RP2. 15. Let p:X e! X be a simply-connected covering space of X and let A (cid:26) X be a path-connected, locally path-connected subspace, with A e (cid:26) X e a path-component of p −1(cid:132)A(cid:133). Showthat p:A e! A isthecoveringspacecorrespondingtothekernelofthe ! map (cid:25) (cid:132)A(cid:133) (cid:25) (cid:132)X(cid:133). 1 1 ! ! ! ! 16. Given maps X Y Z such that both Y Z and the composition X Z are ! coveringspaces, showthat X Y isacoveringspaceif Z islocallypath-connected, ! andshowthatthiscoveringspaceisnormalif X Z isanormalcoveringspace. 17. Given a group G and a normal subgroup N, show that there exists a normal covering space X e! X with (cid:25) (cid:132)X(cid:133)(cid:25)G, (cid:25) (cid:132)X e (cid:133)(cid:25)N, and deck transformation group 1 1 G(cid:132)X e (cid:133)(cid:25)G=N. 18. For a path-connected, locally path-connected, and semilocally simply-connected e! space X, callapath-connectedcoveringspace X X abelian ifitisnormalandhas abeliandecktransformationgroup. Showthat X hasanabeliancoveringspacethatis acoveringspaceofeveryotherabeliancoveringspaceof X,andthatsucha‘universal’ abelian covering space is unique up to isomorphism. Describe this covering space explicitlyfor X (cid:131)S1_S1 and X (cid:131)S1_S1_S1. 19. Usetheprecedingproblemtoshowthataclosedorientablesurface M ofgenus g g hasaconnectednormalcoveringspacewithdecktransformationgroupisomorphic to Zn (theproductof n copiesof Z)iff n(cid:20)2g. For n(cid:131)3 and g(cid:21)3,describesuch acoveringspaceexplicitlyasasubspaceof R3 withtranslationsof R3 asdecktrans- formations. Show that such a covering space in R3 exists iff there is an embedding", "rank": 0, "metadata": {"section": "89"}}
