{"chunk_id": "66-0", "text": "Covering Spaces Section 1.3 57 As our general theory will show, these examples for n (cid:21) 1 together with the helix example exhaust all the connected coverings spaces of S1. There are many other disconnected covering spaces of S1, such as n disjoint circles each mapped homeomorphicallyonto S1,butthesedisconnectedcoveringspacesarejustdisjoint unionsofconnectedones. Wewillusuallyrestrictourattentiontoconnectedcovering spacesasthesecontainmostoftheinterestingfeaturesofcoveringspaces. Thecoveringspacesof S1_S1 formaremarkablyrichfamilyillustratingmostof thegeneraltheoryveryconcretely,soletuslookatafewofthesecoveringspacesto getanideaofwhatisgoingon. Toabbreviatenotation,set X (cid:131)S1_S1. Weviewthis asagraphwithonevertexandtwoedges. Welabeltheedges a and b and we choose orientations for a and b. Now let b a e X beanyothergraphwithfouredgesmeetingateachvertex, e and suppose the edges of X have been assigned labels a and b and orientations in suchawaythatthelocalpictureneareachvertexisthesameasin X,sothereisan a edgeorientedtowardthevertex,an a edgeorientedawayfromthevertex,a b edge oriented toward the vertex, and a b edge oriented away from the vertex. To give a e nametothisstructure,letuscall X a 2 oriented graph. The table on the next page shows just a small sample of the infinite variety of possibleexamples. e e! Givena 2 orientedgraph X wecanconstructamap p:X X sendingallvertices e e of X tothevertexof X andsendingeachedgeof X totheedgeof X withthesame label by a map that is a homeomorphism on the interior of the edge and preserves orientation. It is clear that the covering space condition is satisfied for p. The con- verse is also true: Every covering space of X is a graph that inherits a 2 orientation from X. Asthereaderwilldiscoverbyexperimentation,itseemsthateverygraphhaving four edges incident at each vertex can be 2 oriented. This can be proved for finite graphsasfollows. Averyclassicalandeasilyshownfactisthateveryfiniteconnected graph with an even number of edges incident at each vertex has an Eulerian circuit, alooptraversingeachedgeexactlyonce. Iftherearefouredgesateachvertex,then labelingtheedgesofanEuleriancircuitalternately a and b producesalabelingwith two a andtwo b edgesateachvertex. Theunionofthe a edgesisthenacollection ofdisjointcircles,asistheunionofthe b edges. Choosingorientationsforallthese circlesgivesa 2 orientation. Itisatheoremingraphtheorythatinfinitegraphswithfouredgesincidentateach vertex can also be 2 oriented; see Chapter 13 of [Koenig 1990] for a proof. There is also a generalization to n oriented graphs, which are covering spaces of the wedge sumof n circles.", "rank": 0, "metadata": {"section": "66"}}
