{"chunk_id": "6.1.2-0", "text": "Chapter 6. Distances and Stability Introduction to TDA that ||y −y || = (t −t )·max(cid:0)|g(σ)−f(σ)|,|g(τ)−f(τ)|(cid:1) ⩽ (t −t )·||f−g|| . i+1 i ∞ i+1 i i+1 i ∞ Thus, since ||·|| is a norm and fulfills the triangle inequality, we also have that from ∞ t = 0 to t = 1, the point can move at most ||f−g|| . We thus have the desired bound ∞ on the Bottleneck distance. Exercise 6.8. Show that Theorem 6.7 above can be tight for all p ⩾ 0 and all values of ||f−g|| . ∞ Exercise 6.9. Let P and Q be subsets of a metric space. We say that P ∪Q is in δ- separated position if for any p ∈ P and q ,q ∈ Q we have that |d(p,q )−d(p,q )| > 1 2 1 2 δ. Assume that P ∪Q is in δ-separated position and let Q′ be an ε-perturbation of Q, that is, there is a bijection between Q and Q′ such that for every original point q ∈ Q and its image q′ ∈ Q′ we have d(q,q′) ⩽ ε. Let D and D′ be the persistence p p diagrams for the p-dimensional persistent homology of the filtration induced by the parameterized witness complexes Wr(Q,P) and Wr(Q′,P), respectively. Show that if ε < δ/2 then d (D ,D′) ⩽ ε. b p p Further, show an example where this fails for ε > δ/2. Wewishtogeneralizethestabilityresultabovefromsimplicialfiltrationstofiltrations of general topological spaces. To this end we consider some topological space X and a function f : X → R , which induces a sublevel set filtration for every r ∈ R . We only want to consider tame functions: A function f is tame if all homology groups of sublevel sets have finite dimension, and the homology groups only change at finitely many values, called critical values. Theorem 6.10. Let X be a triangulable topological space, and f,g : X → R be two tame functions. Then ∀p ⩾ 0, we have d (Dgm (F ),Dgm (F )) ⩽ ||f−g|| . b p f p g ∞ We do not prove this theorem at this point, but with additional tools that we will develop in Section 6.2, the proof of this (and of Theorem 6.7) will follow quite easily. 6.1.2 Wasserstein Distance Consider the following three diagrams: Which of Y and Y is X closer to? Intuitively, one clearly says Y : There are simply 1 2 1 fewer features in Y that are not present in X. In terms of Bottleneck distance, there is 1 only one reasonable matching between X and Y , and also only one between X and Y : 1 2 We simply match each off-diagonal point with its closest point on the diagonal. Since 64 Introduction to TDA 6.1. Distance Metrics on Persistence Diagrams X Y Y 1 2 we only look at the longest edge in this matching, the Bottleneck distance is actually the same for both pairs of diagrams, i.e., d (X,Y ) = d (X,Y ). b 1 b 2 We can get rid of this counter-intuitive behavior of the Bottleneck distance by using the Wasserstein distance. Definition 6.11 (Wasserstein distance). For p ⩾ 0, and q ⩾ 1, the q-Wasserstein dis- tance is defined as (cid:34) (cid:88) (cid:35)1/q (cid:16) (cid:17) d (Dgm (F),Dgm (G)) := inf (||x−π(x)|| )q W,q p p ∞ π∈Π x∈Dgmp(F) Intuitively, we now consider the length of all edges in the matching induced by the bijection, as opposed to just the longest one, but the longer ones get more weight. Note that for q", "rank": 0, "metadata": {"section": "6.1.2"}}
{"chunk_id": "6.1.2-1", "text": "the q-Wasserstein dis- tance is defined as (cid:34) (cid:88) (cid:35)1/q (cid:16) (cid:17) d (Dgm (F),Dgm (G)) := inf (||x−π(x)|| )q W,q p p ∞ π∈Π x∈Dgmp(F) Intuitively, we now consider the length of all edges in the matching induced by the bijection, as opposed to just the longest one, but the longer ones get more weight. Note that for q = ∞, we retrieve the bottleneck distance, that is, d = d . W,∞ b We can see that the stability theorem we proved for Bottleneck distance does not hold for Wasserstein distance: consider two simplex-wise monotone functions f and g on a path, as illustrated in Figure 6.3. In both f and g the first vertex on the path is mapped to 1 and the edges along the path are mapped to increasing odd numbers. In f the remaining vertices along the path get mapped to increasing even numbers, and in g to increasing odd numbers. In particular, ||f − g|| = 1. In the filtration defined by ∞ f, at every even step we add a vertex, creating a new connected component, which gets connected to the rest of the path at the next step. Thus, each vertex of the path will give an off-diagonal point in the 0-persistence diagram, where all of them except the first one have a lifespan of 1. On the other hand, in the filtration defined by g, we always add the new vertices and their connecting edge in the same step, thus the 0-persistence diagram only has a single off-diagonal point with infinite lifespan. In particular, we have that for arbitrarily long paths we get arbitrarily large Wasserstein distances between the diagrams for all q < ∞. A similar counterexample can also be found for topological spaces. Consider the topological space [0,1] and the two functions depicted by the curves in Figure 6.4. Here we again have that ||f−g|| ⩽ ϵ, but the Wasserstein distance between the two diagrams ∞ can be made arbitrarily big. 65 Chapter 6. Distances and Stability Introduction to TDA 0 1 3 5 0 1 3 5 ··· ··· 2 4 6 1 3 5 Figure 6.3: Two simplex-wise monotone functions with bounded infinity norm whose persistence diagrams have unbounded Wasserstein distance. To avoid these types of counterexamples, we want to consider even nicer functions: Definition 6.12 (Lipschitz). Let (X,d) be a metric space. A function f : X → R is Lipschitz if there exists a constant C such that |f(x) − f(y)| ⩽ c · d(x,y) for all x,y ∈ X. Exercise 6.13. For each ℓ ∈ R, give two continuous functions f,g : [0,1] → R such that ∥f − g∥ ⩽ 1, but the Wasserstein distance between the diagrams of the sublevel ∞ set filtrations of f,g is at least ℓ. What happens to the Lipschitz constant of your functions as ℓ → ∞? For Lipschitz-functions we again get stability theorems, however we will not prove these here. Theorem6.14. Let X be a triangulable, compact metric space. Let f,g : X → R be tame Lipschitz functions. Then there exist constants C and k (that may only depend on X and on the Lipschitz constants of f,g) such that for every p ⩾ 0 and every q ⩾ k, d (Dgm (F ),Dgm (F )) ⩽ C·||f−g||1−k/q. W,q p f p g ∞ Theorem 6.15. Let f,g : K → R be simplex-wise monotone functions. Then for all p ⩾ 0 and all q ⩾ 1, (cid:88) (cid:16) (cid:17)1/q d (Dgm (F ),Dgm (F )) ⩽ ||f−g|| = |f(σ)−g(σ)|q . W,q p f", "rank": 1, "metadata": {"section": "6.1.2"}}
{"chunk_id": "6.1.2-2", "text": "0 and every q ⩾ k, d (Dgm (F ),Dgm (F )) ⩽ C·||f−g||1−k/q. W,q p f p g ∞ Theorem 6.15. Let f,g : K → R be simplex-wise monotone functions. Then for all p ⩾ 0 and all q ⩾ 1, (cid:88) (cid:16) (cid:17)1/q d (Dgm (F ),Dgm (F )) ⩽ ||f−g|| = |f(σ)−g(σ)|q . W,q p f p g q σ∈K 66", "rank": 2, "metadata": {"section": "6.1.2"}}
