{"chunk_id": "9.3-0", "text": "Chapter 9. Multiparameter persistence Introduction to TDA For completeness, we note that it is possible to have reasonable barcodes for mul- tiparameter persistence modules if we allow ‘bars’ to occur with negative multiplicity. This leads to so-called signed barcodes. Furthermore, there are several special classes of multiparameter persistence modules which do admit an interval decomposition (note that we did not formally define what an interval is in the poset-setting!). This is true in particular for so-called interlevel persistence. We will not discuss this further here. 9.2.2 Other representations and visualizations Even though we cannot hope for a barcode-like representation of multiparameter per- sistence modules, there are still several useful (partial) representations available. We mention just three of them here: • The Hilbert-function of a p.f.d. persistence module U indexed by P sends p ∈ P to dim U ∈ N . It can be thought of as a ‘homological heatmap’. p • The rank-invariant of U sends a pair (p,p′), p ⪯ p′ to the rank rank(u ) of p,p′ ∼ the map between U and U′. Note that any two modules with U = V have the p p same rank invariant. For modules indexed by , this implication also holds in the R other direction. However, for general P, there exist nonisomorphic modules with the same rank-invariant; • Let L : t (cid:55)→ ta + b be an affine line in R2 with non-negative slope. Then the restriction U of a persistence module U indexed by R2 to the line L can be viewed L as a persistence module indexed by R (with its usual, total ordering). The Fibered Barcode of U sends each such line L to the barcode B(U ). This idea can be L extended to lines in Rn; Exercise 9.14. Show that the rank-invariant of an R2-persistence module can be re- covered from its fibered barcode, and vice versa. The RIVET software package (rivet.readthedocs.io) allows you to compute and visualize each of the invariants above for (among others) the degree-Rips bifiltration. 9.3 Distances and robustness for P-persistence modules As we generally do not have barcodes for P-persistence modules, we cannot rely on the Bottleneck distance to compare them. Instead, we work directly with interleaving distance, which is still well-defined. For simplicity, we only consider P = Rn. Definition 9.15. Write 1 = (1,1,...,1) ∈ Rn. Two Rn-persistence modules U,V are ϵ-interleaved if there exist two families of linear maps, φ : U → V and a a a+ϵ1 100", "rank": 0, "metadata": {"section": "9.3"}}
